[
    {
        "Summary": "Analysis - Canvas LMS in Cinnamon Bread (CAP) ",
        "Issue key": "NG-6459",
        "Description": "As XYZPLUS Support admin, I want to know the existing functionality in Cinnamon Bread (CAP) for supporting existing Canvas LMS users and understand the existing known issues, so that I can plan to have better production support for all the new LMS users like BB, Moodle and D2L.",
        "comments": [
            "I am finishing up [LMS in Cinnamon Bread (CAP). Let me know if you would have time to meet quickly so I can walk though with you. Thank you!;;;",
            "All the issues found during the analysis are documented in NGPROD and will be discussed with Ryann if they can be either done in near future or to be deferred.\n\nThe confluence page is also updated. [~rvirginia], you can review and add any comment when you get time. :) \n\nThank you!;;;",
            "20/May/19 11:10 AM;rvirginia;We will add new tickets to address the gaps discovered.;;;"
        ]
    },
    {
        "Summary": "Cookie Consent - Cinnamon Bread - Enable consent panel",
        "Issue key": "NG-14918",
        "Description": "The cookie consent script is included in the Cinnamon Bread application.",
        "comments": [
            "Consumer-facing apps only;;;"
        ]
    },
    {
        "Summary": "[TECH DEBT] implement ci / delivery on Cinnamon Bread / CST",
        "Issue key": "NG-9141",
        "Description": "",
        "comments": []
    },
    {
        "Summary": "To adjust LTI Consumers page in Cinnamon Bread",
        "Issue key": "NG-5582",
        "Description": "# Think about displaying sorting triangle nicely, like adding space bar and maybe making it smaller\n # Leave only one LMS type option - *Canvas* - and *pre-selected by default* - the same way as in Export Cartridge \n # Display error message (to say that lti consumer for this institution exists already) within the same form with input fields, not as the second one screen\nThis will let user to edit his input to fix the issue instead of dropping his input and requesting to repeat from the beginning. Not sure where to display the error message - below Institution field as it was implemented before or at the top of the window (below header)\n # Correct error message above to say \"The lti consumer for this institution is already used. Please choose another one.\" See previous wording\n # Reconsider truncation rules. I'm not able to copy full consumer key\n # Shall we add search by FICE - the only one searchable property left? // optional",
        "comments": [
            " is fixed, used another table component.;;;",
            "is fixed, used resizable table;;;",
            "01/Apr/19 2:53 AM;aziaev;#6 let's implement this option in future releases;;;"
        ]
    },
    {
        "Summary": "Cover \"LTI Consumers\" page in Cinnamon Bread with automated tests",
        "Issue key": "NG-5577",
        "Description": "",
        "comments": []
    },
    {
        "Summary": "[TECH DEBT] Optimise performance of table view component in NG Cinnamon Bread.",
        "Issue key": "NG-1677",
        "Description": "Currently, the table view component downloads from backend the whole NG user list or NG course list, etc. depending on the specific view selected in NG Cinnamon Bread.\nThis results in noticeable delays as table component can't start rendering till whole data is downloaded from server.\nThe proposal is to implement pagination on backend side so that data related to specific page only should be downloaded to the client.",
        "comments": [
            "The old component was decommissioned;;;"
        ]
    },
    {
        "Summary": "[TECH DEBT] Delete unnecessary course sections after every test execution - Cinnamon Bread",
        "Issue key": "NG-5574",
        "Description": "",
        "comments": []
    },
    {
        "Summary": "Cinnamon Bread:\"XYZ Canvas\" can be removed from LMS User Type",
        "Issue key": "NGPROD-521",
        "Description": "GO TO CAP\n\nSelect User and select User Type = LMS\n\nSelect LMS User Type and found \"XYZ Canvas\" is one of the options but it is always returning 0 results.\n\nwe do not need \"XYZ Canvas\" as LMS user type. It can be removed.",
        "comments": []
    },
    {
        "Summary": "Cinnamon Bread: Canvas LMS user search results would not return anonymous user",
        "Issue key": "NGPROD-520",
        "Description": " \n\nLogin CAP\n\nSearch User and select User Type = \"LMS\" and LMS Type = \"Canvas\" and filter with email\n\nIt would only return the results for the users with XYZ User Id and External User Id. For anonymous users, it would not include. So, there would be a gap for the returned results.",
        "comments": [
            " the issue will be deferred for now.;;;"
        ]
    },
    {
        "Summary": "[CR] CAP - SSO Migration from TacoBell to Azure AD DEV",
        "Issue key": "NG-9226",
        "Description": "As per the prior communication, XYZ is moving away from TacoBell in the coming future and accordingly, we have planned to migrate all the applications currently tied up with TacoBell for Single Sign-on to Azure Active Directory(Azure AD).\n\nScope: implement this change for Cinnamon Bread.",
        "comments": [
            "23/Mar/20 3:42 AM;smorozov;Cinnamon Bread is switched from TacoBell to Azure in Dev:"
        ]
    },
    {
        "Summary": "Admin rights and access",
        "Issue key": "CKLS-10797",
        "Description": "1) When adding only \"Can create/modify/delete training courses (individually or by batch processing)\" --> The admin cannot access step 3 (training courses) and step 4 (Portal Customization)\n\n2) When extending the above permission with \"Can create/modify/delete sessions\" then the admin is able to access step 3 (training courses) and step 4 (Portal Customization).\n\n3) Even though that admin was not granted the permission of modifying/deleting other admin's LR, he can change the availability of the LR. Cf attachment\n ",
        "comments": [
            "20/Aug/21 8:36 AM;fvaillant; for the point 3) : It is normal to be able to access to a LR (interactive learning resource type in the example) even if the admin has not the right to modify/cancel it because it not has been created by him and he doesn't have the right. In this case when the LR is opened the button delete isn't displayed and if the admin clicks on the Edit button, a message will appear to indicate to him that he is not allowed to do this action :  !image-2021-08-20-14-31-28-334.png!\n\n \n\nYou are right, he still can access to the actions link in blue and so change the availability of a LR. It is the same for all type of LR, so it is done on purpose.  It is not a bug.;;;",
            "20/Aug/21 9:12 AM;fvaillant;1) When adding only \"Can create/modify/delete training courses (individually or by batch processing)\" --> The admin cannot access step 3 (training courses) and step 4 (Portal Customization)\n\n-> It is strange because when I try on my qa instance with an admin with the same limitation, I can access to the step 3 and 4 of a Learning Channel.  !image-2021-08-20-14-58-58-536.png!;;;",
            "20/Aug/21 9:16 AM;fvaillant;Hello, [~lchamayou], can you explain ? :\n\n1) When adding only \"Can create/modify/delete training courses (individually or by batch processing)\" --> The admin cannot access step 3 (training courses) and step 4 (Portal Customization)\n\nOn the image I see the link, so why the admin can't access to step 3 and 4. Is a message or an error displayed  when he clicks on the links?;;;",
            "23/Aug/21 4:48 AM;lchamayou;Hi [~fvaillant], I have added the video \"No access to menus\" to illustrate what happens. There is no message whatsoever, it just bring you back to the home page.;;;",
            "23/Aug/21 7:45 AM;fvaillant;Hi, thank you [~lchamayou] . I reproduce the problem on my qa instance. The link brings back to the home page because the training page or the portal customization page or not reachable due to a 404 error. The fact to add training, and customize the portal are parts of the design workspace. \n So, it should work without the needs to select create/modify/delete sessions in the administrate workspace. It seems to be a bug.\n\n \n\n!accès false training dans LC.png!;;;",
            "23/Aug/21 8:29 AM;lchamayou;[~fvaillant] Thank you. I guess this task should be modified into 'Bug'.;;;",
            "24/Aug/21 9:05 AM;apoude;Yes and remove the point #3 from expectations.;;;"
        ]
    },
    {
        "Summary": "[NGAI] Displaying 'Unpublished' State for the XYZ Course Sections - NG Admin ",
        "Issue key": "NG-3134",
        "Description": "This story is about displaying the 'published'/'unpublished' course status for XYZ course sections in the Course Admin interface.\n\nRequirements in scope:\n 1. The course sections related to the unpublished XYZ course should be marked as 'unpublished' in Cinnamon Bread in the detailed view - Course status parameter should be added to handle this.\n\n2. The course sections related to the published XYZ course should be marked as 'published' in Cinnamon Bread in the detailed view - Course status parameter should be added to handle this.\n\n3. NG Dashboard, Find course, Canvas behavior should follow the rules specified in NG-4768 and NG-4769\n\n4. 'Course status' parameter is not editable",
        "comments": [
            "26/Nov/18 7:47 AM;jchai;From quick investigation, I don't see any properties in Courses or Sections APIs that can be used to accomplish this.\n\n-A hacky workaround would be to do the following:-\n # -set instructors/student users \"custom_data\" property to store these course ID's-\n # -in UI, add custom JavaScript to call for the \"custom_data\" field and hide relevant UI elements-\n\n-It would be unreliable because (1) Instructure can update the HTML any time to break our implementation and (2) we might miss places in LMS where courses sections show up.-\n\n-Functionally in Canvas side, are hidden course sections different from deleted course sections? If not, can we try something like: (1) storing the course section details -> (2) deleting course section -> when Admin users want to restore course sections (3) restoring the the course section with our previously stored details?-\n\nFurther analysis done in email chain \"Hiding XYZ course sections from Cinnamon Bread\";;;",
            "06/Dec/18 9:27 AM;aryzhakov;Ready for spec workshop;;;",
            "11/Dec/18 10:21 AM;aryzhakov;Updated as per outcome of spec workshop. Ready for TA;;;",
            "23/Jan/19 9:11 AM;aryzhakov;Updated as per new requirements from Ryann - added 'Course status' parameter to handle Published/Unpublished states;;;",
            "08/Feb/19 10:35 AM;rdannelly;This has been accepted as completed.  Thank you, Soyuz team!;;;"
        ]
    },
    {
        "Summary": "[NGAI] Add \"send user reset password email\" control in CAP - NG Admin",
        "Issue key": "NG-4884",
        "Description": "This story is about sending to user the Reset Password email by a super admin and admins within the Cinnamon Bread.",
        "comments": [
            "10/Jun/19 10:42 AM;aryzhakov;Ready for spec workshop;;;",
            "11/Jun/19 11:07 AM;aryzhakov;Updated as per spec workshop outcome.\n\nReady for TA;;;",
            "21/Jun/19 10:46 AM;rdannelly;Hi [~aryzhakov], [~abondar], and [~mlepyoshki].  [~dlederer] was able to connect with [~rtangri] on this ticket and we need to adjust our approach. XYZ cannot support changing (and therefore knowing) users' passwords within our admin system. It's a legal issue. However, from within the CAP, a super admin/admin user can send out the password reset email to a particular user. That is legal. \n\nSo, we need to adjust the scope of this ticket so that a CAP super admin/admin user can send out a password reset email to a user from their user profile page. That way, the user is able to reset their password and XYZ doesn't know their password. FYI [~jlu2]\n\n!image-2019-06-21-10-46-23-744.png|width=760,height=280!;;;",
            "21/Jun/19 10:46 AM;rdannelly;For now, I'm assigning this to [~abondar] as [~aryzhakov] is out. FYI [~mlepyoshki];;;",
            "21/Jun/19 11:09 AM;abondar;[~rdannelly], [~dlederer], [~rtangri], [~smorozov]\nIt looks like we need to double check the scope and use case of \"Set Password\" functionality in Admin UI.\nThe functionality allows to set/reset the password for the user who is not able to do it by himself.\nReasons:\n~ user has lost access to his email account;\n~ user is not able to reset the password for some reason.\nIn such critical case, the \"super admin\" (!) is able to help the user and set the password to him.\nPlease note:\n~ that the customer will be notified by default;\n~ the admin is not able to see the user's password. Set new is the only option.\n\nSo I do not see any serious security risk from the password storage perspective.\nWe do not store the customer passwords in the open state and do not allow somebody to see the user's password. \nIt is just an extra functionality which could allow us to help our customers in some emergency cases.\nNote: the similar functionality is available to admins in all our previous solutions (WPE4) as well as in other solutions (Canvas LMS for instance).\n\nAs for simplified proposal: send a Reset Password email - it is already implemented.\nEverybody might access the https://learning-qa.XYZ.com/ngonboard/index.html#/ForgotPassword page and enter the required email address.\n\nCould you please double check the point and confirm the necessity to redesign the proposed solution?;;;",
            "21/Jun/19 11:19 AM;rtangri;[~abondar] I have to disagree with rationales given above. If user lost his email account they have bigger problem not just us setting his password. By doing this we opening security flaws and giving person access other person data access in platform.\n\nTo me there is no reason to build this because as you have stated the link is available on the website to reset.\n\n \n\n \n\n \n\n ;;;",
            "21/Jun/19 11:25 AM;dlederer;Hi [~abondar]\n\nThanks for your comments. While you are correct that we currently take the necessary steps to hide the password in the UI and in the DB, the fact that the XYZ tech support person helping the user knows the password (as they are keying it in) is the issue here. This opens up the question about data integrity (customer could claim that they had all their homework changed/removed by someone at XYZ since they knew my password). The fact that we do that in E4 and other system in XYZ does not make it a viable option. \n\nIf the concern is that they really cannot do it by themselves and we need a mechanism to set a password for them, then the solution would have to be to use a temp password that would force them to reset their password when they login with that password we provide them. I am not sure if that helps if they have lost access to their email account.\n\nThanks.\n\nDavid;;;",
            "21/Jun/19 11:39 AM;abondar;[~rtangri], [~dlederer]\nThank you for the feedback. I see your point but could not agree with your from \"system functionality\" perspective.\nWe will lose some scenarios in the case.\nHere are quick search examples of the same functionality in competitive systems:\n~ Blackboard: https://help.blackboard.com/Collaborate/Ultra/Administrator/Manage_Users#reset-passwords_OTP-4\n~ Canvas: https://alliedhealthcareertraining.com/knowledgebase\netc.\n\nRyann,\nCould you please comment on that?;;;",
            "21/Jun/19 11:59 AM;rtangri;[~abondar] That doesn't make them right I will prefer more secure system then have this functionality.\n\nThe system which support this will force user to change password after the reset by admins. So if we have to must build this then way to implement this\n * Admins reset password\n * and in abc web properties we force then to reset the password when they login next time;;;",
            "21/Jun/19 12:13 PM;rdannelly;[~abondar], [~dlederer] and [~rtangri],\n\nTaking a step back to think of the main used case that we're solving for here...the main issue right now is that if/when a user calls tech support (or reaches out to their CSS) and says they can't get into their account, tech support/CSS can't actually assist them--they can just tell them to reset their password and tell them where to go and what to click to reset their password. \n\nThis solution is to give our tech support team agency to actually help along the process of resetting a password. If a user starts a conversation with an agent and says they can't get into the platform, that agent just needs to be able to find that user in the Cinnamon Bread and push out the password reset email to that user's email address.\n\nThat will allow Tech Support to actionable support users while staying entirely out of the business of knowing what new password they set.\n\nI would vote against going to the route of adding in the extra step where XYZ sets the password and then the user resets the password. That adds another step in the process that doesn't need to be there.;;;",
            "21/Jun/19 12:17 PM;abondar;[~rtangri] I see your concern and I like your idea in general.\nEvidently, it will enlarge the complexity of the solution: new flow brunches, new screens....\n\nAt the moment I can see a few options to move forward:\n1. Decline the functionality (close the ticket as \"won't do\").\n2. Decrease the priority and put the item to the backlog for future.\n3. Implement the simplified approach: replace the window with the link to the \"Forgot Password\" page. (Ryann latest proposal).\n4. implement the current story as a first step to the proposal from Rakesh (\"to reset the password when they log in next time\"). New story/flow need to be created and discussed with Open Field team.\n\n;;;",
            "21/Jun/19 12:22 PM;abondar;[~rdannelly] I see the point.\nOK. I will update the scope of the story by sending \"Reset Password\" email action instead of Reset Password window (option #3 of the list above).;;;",
            "21/Jun/19 2:31 PM;rdannelly;Thank you [~abondar]. Let's proceed with Option 3 listed above.;;;",
            "24/Jun/19 4:53 AM;abondar;[~rdannelly] \nI have updated the story according to the latest request (send Reset Password email).\nCould you please review and confirm the new scope including wireframes, BRs and ACs?\n\nThere are two specific points to confirm:\n1) The option will be available to Admin and Super Admin roles in CAP. Is it fine OR we need to extend the option to the \"User\" role also?\n2) Please confirms the text wording of the button and error/success messages.;;;",
            "24/Jun/19 10:41 AM;rdannelly;Thank you [~abondar]. I've reviewed the updated scope of the ticket and we're good to go. This option should be available to just 'Admin' and 'Super Admin' roles.  The text wording of the button and error/success messages are good to use, as well.  Thank you!;;;",
            "26/Jun/19 6:07 AM;abondar;spec workshop is done. The estimation was reduced to 3 SP.;;;",
            "12/Jul/19 4:54 AM;drodionov;Testing is complete.;;;",
            "12/Jul/19 11:43 AM;rdannelly;I've completed UAT testing of this functionality. We can consider this story as complete. Thank you team!;;;"
        ]
    },
    {
        "Summary": "Math-Maple: System changes answer and marks is wrong",
        "Issue key": "NGPROD-1197",
        "Description": "Course:SS 17 E4 - Hughes-Hallett, Calculus, 7e BRV\nSalesForce Case #:05642433\nError Reporter:PATTI FRAZER LOCK\nDomain ID:dmn96993\nAssignment ID:asnmt2599314\nQuestion Name:Chapter 11, Section 11.5, Question 027\nQuestion ID:EAT_1517945590269_1_2312585652199632\nChapter:Chapter 11. Differential Equations\nError Description:\nFor some reason, when students put in -0.043 correctly in the answer to this question, WP is switching their answer to the form -.43e-1. And then WP is marking them wrong. This is an error in the problem, and it is driving me and my students crazy. Please fix it! Thank you.\n",
        "comments": [
            "16/Apr/20 8:57 AM;rdannelly;Hi [~afomin], we have redirected the WPe4 team to work on a critical project for NWP's backend Cinnamon Bread tool for the next several months. Due to this reallocation of the team's resources, we're not able to take on WPe4 tickets right now unless the tickets are deemed absolutely critical blocker issues by [~lfavors], as any WPe4 tickets we take on will decrease the amount of the Cinnamon Bread project that the team will be able to complete. \n\nI'm going to assign this ticket to [~lfavors] for the assessment of criticality, and I'll move it in the WPe4 team's product backlog for now with the understanding that this isn't something they are going to be focusing on.;;;",
            "28/Apr/20 12:43 PM;rdannelly;I'm moving this ticket to the deferred status. The WPe4 team has been re-allocated to focus on a critical NWP project for the next three months.;;;",
            "03/May/21 10:34 AM;lfavors;[~rdannelly], closing this issue.\n\nLonn;;;"
        ]
    },
    {
        "Summary": "CAP UI. Companion Resources option in license table",
        "Issue key": "EPOI-1978",
        "Description": "",
        "comments": [
            "15/May/24 12:59 PM;atyukavkin;Example API call to enable Instructor resources for specific license:\nHTTP PUT\n{code:java}\nhttps://learning-qa.XYZ.com/abc/api/v1/cap/users/47cc2a37-9ac5-4dd0-9672-4610391aa6ae/apl/licenses/8d188172-5fda-48f9-b7ff-e3f0f7c7845b{code}\nHTTP Body:\n{code:java}\n{\"instructorResources\": true}\n{code};;;",
            "07/Jun/24 6:37 AM;nkochmarev;Fix version:\n|XYZPLUS-course-admin-portal-ui|*#19\"3.13.65\"*|\n\n[~cdantaka] [~gherath] ;;;",
            "24/Jun/24 9:58 AM;cdantaka;Tested and verified in QA env :\n\nCC:[~atyukavkin] ;;;",
            "27/Jun/24 12:11 PM;lfishman;[~cdantaka], [~atyukavkin] - Looks good. I only see the enable/disable link showing for Instructor licenses. Able to enable and disable in the table.;;;"
        ]
    },
    {
        "Summary": "[NGAI] [F6] Create XYZ Instructor Account based on the Student data already stored in Core/NG DB - NG Admin",
        "Issue key": "NG-4641",
        "Description": "This story is about creating the XYZ Instructor account from course admin interface based on the data already stored in NG DB or Core.\n\nThe following cases are in scope:\n # Student account exists in Core and NG DB",
        "comments": [
            "20/Nov/18 7:28 AM;aryzhakov;Ready for spec workshop;;;",
            "29/Nov/18 9:11 AM;aryzhakov;Wireframes are updated as per spec workshop. Ready for TA;;;",
            "05/Dec/18 8:00 AM;aryzhakov;Corrected wireframes.\n\nAdded BR#11 based on the discussion with Sergey;;;",
            "07/Dec/18 5:27 AM;aryzhakov;Corrected wireframes- added the case when no departments are present for the selected institution;;;",
            "13/Dec/18 12:17 PM;aziaev;dev test done XYZPLUS-course-admin-ui v1.63.3 2018-12-13 19:59:52 +0300 #17e664583f37358186e3eac356000b3b72b0d25f;;;",
            "14/Dec/18 4:59 AM;aryzhakov;Changed text label for Institution selection drop down on step 3 of the wizard;;;",
            "14/Dec/18 6:01 AM;aziaev;Text label is fixed;;;",
            "18/Dec/18 1:50 AM;aryzhakov;Wireframes are updated as per input on the demo session - see NG-4861 for details;;;",
            "18/Dec/18 2:28 AM;aziaev;Cinnamon Bread is updated\n*XYZPLUS-course-admin-ui v1.63.33 2018-12-18 10:05:58 +0300 #71f9f741c60c3896c7d48960696b0dab724a732d*\nFixed: texts according to PO feedback\nFixed: JWT user role field;;;"
        ]
    },
    {
        "Summary": "[TECH DEBT] [Security API] Protecting Course API methods by user roles",
        "Issue key": "NG-8945",
        "Description": "The work is consider as \"done\" by below successful criteria:\n\n1) Security API for Protecting Course API methods by user roles. \n\n2) Full regression testing with the existing automation scripts. ",
        "comments": [
            "11/Mar/20 3:24 PM;atyukavkin;Regression scope is the same as for NG-8946\n * User registered in ECore system but not registered in NextGen\n * User registered in both ECore and NextGen\n * Intercom\n * Update course access model to Adoption. (Onboarding / Create Draft Course / Convert to Current Course)\n{code:java}\n@PutMapping(value = \"/courses/{courseKey}/convertToAdoption\"{code}\n * Update or unpair LMS course (Silent pairing of LMS course with LTI links containing product ID, for instance Content Player launch. It should be first LTI launch in this course).\n{code:java}\n@PutMapping(path = \"/lmscourses/{lmsCourseId}/updateProduct\"{code}\n * Create course section enrollment. (Create Student Account / Enroll to existing Course section)\n{code:java}\n@PostMapping(path = \"/coursesections/{courseSectionId}/enroll\"{code}\n * Create new sub account or get existing one. (Course setup - Create new course)\n{code:java}\n@PostMapping(path = \"/{institutionId}/prepareSubAccountId\"{code}\n * Prepare Canvas sub-account id. (Course setup - Create new course)\n{code:java}\n@PostMapping(path = \"/{institutionId}/prepareCanvasSubAccountId\"{code}\n * Create LMS course. (LTI - provision LMS course)\n{code:java}\n@PostMapping(path = \"/institutions/{institutionId}/lmscourses\"{code}\n * Update user's claimed account and generate new activation passCode. (Claim account - Unfinished flow)\n{code:java}\n@PutMapping(value = \"/{userProfileId}/updateClaimedAccount\"{code}\n * Search user by user_profile.id. (Onboarding / Go to Shopping cart)\n{code:java}\n@GetMapping(path = \"/users/{userProfileKey}\"{code}\n * Update access policies. (Not used from UI, can be skipped)\n{code:java}\n@PutMapping(path = \"/coursesections/updateAccessPolicies\"{code}\n * Update access policies data for external course sections. (Not used from UI, can be skipped)\n{code:java}\n@PutMapping(path = \"/coursesections/lms/updateAccessPolicies\"{code}\n * Add course section to existing course. (Not used from UI, can be skipped)\n{code:java}\n@PostMapping(path = \"/institutions/{institutionId}/courses/{courseId}/coursesections\"{code}\n;;;",
            "12/Mar/20 12:18 PM;atyukavkin;Ready for testing in\nCST version 1.94.7\nSSO version 1.94.7;;;",
            "12/Mar/20 12:42 PM;jlu2;[~atyukavkin] Thank you for providing the detail.;;;",
            "18/Mar/20 6:33 AM;nmendis;[~atyukavkin]\n\n2. Update or unpair LMS course (Cinnamon Bread/ LMS Course / change ISBN) \n\n- did not have permission to edit ISBN when I logged in from super admin - akiselev / XYZ12345e \n\n!image-2020-03-18-16-01-10-772.png|width=173,height=88!\n\n \n\n ;;;",
            "18/Mar/20 7:20 AM;atyukavkin;Looks like you are trying to change ISBN for XYZ course not LMS. I updated this item in my comment, you will need to initiate first LTI launch in LMS course for Content Player to check this API change. Silent pairing will happen. It is not visible from UI. Content Player should be opened successfully.;;;",
            "18/Mar/20 7:27 AM;nmendis;[~atyukavkin] : Need details on below flows: \n\n4. Create new sub account or get existing one. (Course setup - Create new course)\n{code:java}\n@PostMapping(path = \"/{institutionId}/prepareSubAccountId\"{code}\n5. Prepare Canvas sub-account id. (Course setup - Create new course)\n{code:java}\n@PostMapping(path = \"/{institutionId}/prepareCanvasSubAccountId\"{code}\n*--Need a sub-account id and how to create a new one.*\n {color:#0747a6}AT: Open Course Setup Application. Create New Course [https://learning-qa.XYZ.com/abccst/index.html]{color}\n\n{color:#00875a}NM : --Need an existing sub-account id and how to create a new sub account.{color}\n\n{color:#00875a}NM: Per confirmation from Andrey generating a cartridge from CST manually, will cover this flow as well. {color}\n  \n\n7. Update user's claimed account and generate new activation passCode. (Claim account - Unfinished flow)\n{code:java}\n@PutMapping(value = \"/{userProfileId}/updateClaimedAccount\"{code}\n*--Need to know the user flow on how to execute this*\n\nSearch user by user_profile.id. (Onboarding / Go to Shopping cart)\n{code:java}\n@GetMapping(path = \"/users/{userProfileKey}\"{code}\n*--Need to know the user flow on how to execute this*\n {color:#0747a6}AT: Create new Student account / Proceed to Shopping Cart page / Select any option{color}\n {color:#00875a}NM: This is verified now. Thanks{color}\n\n ;;;",
            "19/Mar/20 5:01 PM;jlu2;Per confirmation with [~atyukavkin], one more service is needed: abc-auth-service 1.94.6;;;",
            "20/Mar/20 1:16 AM;vsaranga;[~jlu2] hopes this is not due to a new change. Because we have already in the latter part of the testing. ;;;",
            "20/Mar/20 6:27 AM;nmendis;*Tested on:* 03/20/2020\n*Status:*\nVerified changes and did a regression test using automated test suite. \nAllure report : [http://devops.XYZ.com/jenkins/job/NG/job/nightly-rerun/139/allure/]\nAutomation-rerun failures were checked manually. Due to reported issues in Core and SC integration some failures could not be checked. \n\n*Versions:*\nLTI:\n{  \"Component name\": \"abc-lti\",  \"Component version\": \"1.94.11.ng9291.2\",  \"Build timestamp\": \"20200319-0534\",  \"Git commit hash\": \"982a3d7b617ba31f39d795837f1e2b8780ef731b\"}\nCST:\n{ \"Component name\": \"abc-course-setup-app\", \"Component version\": \"1.94.18\", \"Build timestamp\": \" 20200319-1048\", \"Git commit hash\": \"50956996\"}\n\nAuth-service:\n{\"Component name\": \"abc-auth-service\",\"Component version\": \"1.94.6\",\"Build timestamp\": \" 20200311-1541\",\"Git commit hash\": \"9ccf85d6\"};;;",
            "20/Mar/20 8:12 AM;atyukavkin;Hi [~vsaranga], the abc-auth-service 1.94.6 was in QA since March 11. I just not mentioned it previously.;;;"
        ]
    },
    {
        "Summary": "XYZ Course Resources - Instructor Header ",
        "Issue key": "LMS-9549",
        "Description": "Including initial application setup work.\n\nAs an Instructor launching my course\n I want to view high level details about my course.\n - Product image \n - Course name \n\nTechnical Tasks:\n * LTI endpoint to launch XYZ Course Resources\n * Create common UI components for layout, typography, themes, loading states for components, links (with image)\n * Responsive design\n * Setup application container + core logic (ie reading JWT for user role)\n * Setup deployment jobs\n * Show course info (include loading placeholder state)\n\nThis story is for development work only. QA tracked in separate story.",
        "comments": [
            "27/Jan/20 10:25 AM;jpeterson;Final design link has been added to the Wireframes Section;;;",
            "28/Jan/20 11:47 AM;rdannelly;Hi [~jlu2], I've reviewed the AC/BR and added comments in red.  Please review the changes/open questions. Thank you!;;;",
            "28/Jan/20 11:48 AM;rdannelly;[~jchai] and [~sconnelly3], can you please review the open red item I added at the end of the Acceptance Criteria? Are we currently considering what will happen when an instructor changes their course name through either one of the XYZ instructor tools for standalone courses or through the LMS course title functionality?;;;",
            "28/Jan/20 12:27 PM;jchai;{quote}{color:#ff0000}OPEN QUESTION: Do we need to add AC to support when an instructor changes the course name?{color}\n * {color:#ff0000}In standalone courses, instructors can change the name of their course in the Instructor Admin Tool (from either directly within their course in the settings section or through the course tile on the My Course List Page). We should be able to reflect those changes to the name.{color}\n * {color:#ff0000}What about if an instructor changes the course name directly through the LMS (applicable for either standalone courses/integrated courses)? Will the Course Dashboard header update with the updated course name? {color}{quote}\n\nDepends on where this information comes from (either through an API call or through course JSON). Probably need to ask Sergey or Yury about it. If whatever API/JSON the Course Dashboard relies on has that updated title, then the updated title will show upon page refresh.;;;",
            "28/Jan/20 12:42 PM;jlu2;[~rdannelly], I have updated the AC with 1, 3 and 4 and Business Rules 1) and 3) . Depending on the discussion with Proton team, if it is part of the returned API, we shall be able to include.;;;",
            "28/Jan/20 4:16 PM;rdannelly;Thank you [~jlu2] and [~jchai]. I've made a few following changes to the AC based on our previous discussions. \n * If a standalone course's name is updated through either the *Cinnamon Bread* or the *Instructor Admin Tool,* the updated course name should be reflected on the Course Dashboard when the user refreshes their window.\n ** [~smorozov], [~azagnityko] and [~ystartsev], can one of you please share the information that the Pride team needs to make sure that this update occurs? \n * If a standalone course's name is updated through Canvas's native changing course title settings, then the new name will not be reflected on the Course Dashboard. This matches the behavior in the Cinnamon Bread and the Instructor Admin Tool\n * If an integrated course's name is updated through the LMS's native course title settings, then the new name will not be reflected on the Course Dashboard. This matches the behavior in the Cinnamon Bread and the Instructor Admin Tool.\n\nHi [~julee.peterson], \n\nKnowing the above, do you still believe there is value to showing the course name in the header of the course dashboard? There will be instances in which the course dashboard name will not match the current course's name, if the name is updated in one of the bottom two bullets listed above.\n\nWe could entirely remove the course name from the header and just call that section 'Course Dashboard' without a specific course name. What are your thoughts?;;;",
            "07/Feb/20 5:57 PM;jchai;Closing dev story. Finished coding using simulated API call. Verified on on [DEV env|https://XYZ2.beta.instructure.com/courses/40097] and [QA env (direct launch to UI app)|https://learning-qa.XYZ.com/ng-course-dashboard/index.html#/].\n\nBuild #: #28 nwp-course-dashboard-0.1.4 (cddea)\nDeployed to DEV and QA env already.\n;;;",
            "10/Feb/20 7:32 AM;rdannelly;Hi [~jlu2] and [~jchai], do we have credentials for me to show the progress on the header in the demo this morning? Thanks!;;;",
            "10/Feb/20 7:40 AM;jlu2;[~rdannelly], you can access [https://XYZ2.beta.instructure.com/courses/40097] (DEV env) and find the XYZPLUS Course Dashboard with [test@XYZ.com|mailto:test@XYZ.com] / XYZ123 for demo. The cover image would not be shown on the DEV for environmental issue. Be aware that we do not have any way to create a new course for course dashboard yet. ;;;",
            "10/Feb/20 7:50 AM;rdannelly;Hi [~jlu2], I'm not seeing the Course Dashboard in this course. Can you check?;;;",
            "10/Feb/20 7:54 AM;jlu2;[~rdannelly] It is above the setting as below. It is not the expected location...\n\n!image-2020-02-10-07-53-24-521.png|width=474,height=267!;;;",
            "10/Feb/20 7:57 AM;rdannelly;Thank you [~jlu2]....I think I was looking at the course with different credentials. I now see it.;;;",
            "18/Feb/20 3:53 PM;jhansen;[~jchai] [~rdannelly]\nThe only thing I'm noticing here is that the button should have a 36px height rather than 32px. Other than that, everything is looking solid.;;;",
            "18/Feb/20 4:27 PM;jchai;[~jacob.hansen] Which button (and is it under mobile, tablet, desktop experience) are you referring to?;;;",
            "18/Feb/20 4:43 PM;jhansen;[~jchai] Oh sorry—desktop Options button, and any other buttons we're using.;;;",
            "18/Feb/20 4:56 PM;jchai;I see 32px for Options button height (see screenshot below). What operating system and browser are you using?\n\n!button-height-QA.png|thumbnail! ;;;",
            "18/Feb/20 5:02 PM;jhansen;[~jchai]\n\n!Screen Shot 2020-02-18 at 4.59.17 PM.png|thumbnail! \n\nRight, we've been using buttons with a 36px height in our designs. If this is something we need to reconsider let me know, but we chose 36px to allow for more hit space.;;;",
            "18/Feb/20 5:39 PM;jchai;Oh sorry I misunderstood. You're saying it SHOULD be 36px. The button isn't technically part of this story. It was just implemented very roughly along with the mobile eTextbook button. We should save verification of it to that later story for Options button (LMS-9588).;;;"
        ]
    },
    {
        "Summary": "XYZ Course Resource doesn't work - sporadic issue",
        "Issue key": "NGPROD-1356",
        "Description": "The \"XYZ Course Resource\" doesn't appear - please refer to the screenhots atached. The issue is sporadic and reported by several users in serveral courses",
        "comments": [
            "08/Jul/20 3:13 PM;jlu2;[~vsundaramu], Could you please look into the production log if we have a lot of this type of errors on production? Because we cannot reproduce the issue but we would want to know how critical issue is in reality.\n\nFYI [~rvirginia], [~rdannelly]\n\n ;;;",
            "08/Jul/20 3:33 PM;atyukavkin;There are no logs for such issues. It is happening in user's browser.;;;",
            "08/Jul/20 3:34 PM;sconnelly3;If error cannot be reproduced, can this issue be closed?;;;",
            "08/Jul/20 3:39 PM;atyukavkin;No. It is sporadic issue. We need to understand what is a cause of this. It was replicated by many users. It could be Cookie issue or something else. Like you need to login to XYZ Admin portal first and after that to Next Gen course;;;",
            "08/Jul/20 3:41 PM;rdannelly; I just reproduced it. It seems to be a caching issue, triggered by something. Only once I go into an incognito window or clear my cache does the page load again [~sconnelly3] and [~atyukavkin]. This one should not be viewed as a blocker. This seems to be the same caching issues that XYZ employees run into when going back and forth between our different tools/environments. ;;;",
            "08/Jul/20 4:03 PM;jlu2;Per meeting with [~rdannelly] and [~rvirginia], the issue seems happening when internal users login and logout in different products or different tools or different environments. \n\nSince there is no consistent way to re-produce the issue, we will close the issue for now. If it continues reporting by the users, we will check in the issue again.\n\nFYI [~dlederer], [~mmarler], [~osolovyo];;;",
            "09/Jul/20 12:42 PM;nkochmarev;[~sconnelly3] We were able to reproduce the issue on QA, but the issue was with course data. UI hangs when it gets any 400's group of HTTP errors. In our case, it was 403. (renamePracticeQuestions function runs even in case of 400 errors because it is not error for axios but valid response). Strange thing that we get 403 in response from cloud front when the course missed.;;;",
            "09/Jul/20 12:45 PM;jlu2;[~nkochmarev], if you have persistent way to re-produce the issue, can you share the steps in the lower environments?\n\nThank you!\n\n ;;;",
            "09/Jul/20 12:56 PM;nkochmarev;[~jlu2]\n\n[https://XYZ2.test.instructure.com/login/canvas]\n\nCourse :  [Test 5-13|https://XYZ2.test.instructure.com/courses/15503]\n\nBut this is known broken course;;;"
        ]
    },
    {
        "Summary": "Change unique constraint for abc institution table",
        "Issue key": "NG-6542",
        "Description": "We discovered that schools from Malaysia that are listed in CORE with \"valid\" FICE's have the same FICE as schools from Canada. This prevents us from entering these records into the abc institution table since we have a constraint for uniqueness on FICE code. What we should have is a constraint of FICE+Country Code so two schools from different countries can use the same FICE Code. ",
        "comments": [
            "21/May/19 4:24 PM;dlederer;[~rdannelly] - we need to understand the feasibility of doing this as without it we are blocked for adding more schools into the CST to support EMEA schools. 3 of the 6 schools requested thus far (all from Malaysia) are not able to be added. If this is not feasible, we will have to come up with an alternative approach to supporting these schools. ;;;",
            "22/May/19 4:26 AM;azagnityko;Hi, [~dlederer], [~rdannelly]. I've made some analysis of this issue, and it seems to be totally feasible and shouldn't take a lot of time.;;;",
            "23/May/19 11:18 AM;rdannelly;Thank you [~azagnityko]. \n\n[~mlepyoshki], does the Soyuz team have capacity to take this in in the current sprint 75 or should we consider this work for sprint 76?;;;",
            "24/May/19 4:33 AM;mlepyoshki;Hi [~rdannelly],\n\nArtem is going to take this ticket in Sprint 75.;;;",
            "24/May/19 7:27 AM;dlederer;Great news!  Thank you everyone. ;;;",
            "24/May/19 7:56 AM;rdannelly;Thank you [~mlepyoshki] and [~azagnityko]!;;;",
            "24/May/19 9:28 AM;azagnityko;Repository: XYZPLUS-course-setup. Branch: feature/NG-6542. Revision: 7cc0d578. Replace unique constraint on institution table. Version: 1.75.9.;;;",
            "30/May/19 9:48 AM;daladinski;Tested with following data on QA\nCOLLEGE OF THE NORTH ATLANTIC - RIDGE ROAD / A00007001 / 124 / CANADA\nUSM PENANG / A00007001 / 458 / MALAYSIA\n\nCST work fine (creating courses and retrieving departments)\nExport Cartridge works fine\nSearches in Cinnamon Bread work fine\nCreating LTI consumers manually through Cinnamon Bread works fine\nContent launch (standalone and 3rd party LMS) works fine\n\n;;;"
        ]
    },
    {
        "Summary": "[ENABLER] Complete moving LTI Consumers functionality from CST to CAP UI",
        "Issue key": "NG-5584",
        "Description": "",
        "comments": [
            "27/Mar/19 4:53 AM;daladinski;further testing is stopped till NG-5582 To adjust LTI Consumers page in Cinnamon Bread  is implemented;;;",
            "04/Apr/19 11:39 AM;daladinski;Confirmed.;;;"
        ]
    },
    {
        "Summary": "Secure DELETE /abc/api/v1/enrollments API",
        "Issue key": "NG-13270",
        "Description": "Proposal to improve the existing logic:\n~ validate the user (requestor) has an instructor enrolment in the particular course.\n\nBusiness rules:\n1.1. The functionality should be available to users registered in the course with the instructor role.\n1.2 Error message for the case if the user has no instructor enrolment in the course: \"You don't have permission to perform this action. You must be enrolled as an instructor in this course.\"",
        "comments": [
            "08/Jun/21 8:50 AM;azagnityko;API path DELETE /v1/enrollments was changed to DELETE /v1/secure/enrollments;;;",
            "10/Jun/21 2:50 AM;azagnityko;This API is part of the \"Instructor Admin Portal\" logic, since instructors should be able to remove enrollments from the course.;;;",
            "09/Sep/21 5:14 AM;abondar;tasks in the scope:\n~ redesign delete student API contract\n~ adjust UI implementation \n~~ add the new error message\n~ adjust the existing e2e tests;;;",
            "15/Sep/21 3:31 AM;smorozov;The scope of this task includes creating new API to be used from IAT to remove student:\n\nAPI path\nDELETE /v1/enrollments/sections/\\{sectionKey}/students/\\{userProfileKey}\n\nValidation logic on the backend should check:\n * requestor is enrolled as instructor in at least one section in the course (HTTP status 400 is returned if validation fails)\n * user with provided userProfileKey is enrolled as student in the given section (HTTP status 404 is returned if validation fails);;;",
            "21/Sep/21 11:36 AM;azagnityko;API\n{code:java}\nDELETE /v1/enrollments/sections/{sectionKey}/students/{userProfileKey}{code}\nwas implemented;;;"
        ]
    },
    {
        "Summary": "Timed Assignment - Accommodations - Anonymous User (student) not listed",
        "Issue key": "NGPROD-1147",
        "Description": "*SFDC# 05572684*\n\n \n\nSchool: University of Wisconsin-Madison\n Instructor: Paul Kimmel\n Instructor email: n/a (send replies only to me, [test@XYZ.com|mailto:test@XYZ.com]\n Class URL (abc): NWP Import\n\nIssue: Paul has a Canvas-integrated NWP course. He is using accommodations for a timed exam he has coming up, but one of his students for whom he needs to make those accommodations appears to have registered as anonymous in NWP and is not showing in the accommodations list. Can anything be done to allow him to provide accommodations for her?\n\nThanks\n Dan\n\n \n\n*Student:*\n Sonia Mehra\n [skmehra@wisc.edu|mailto:skmehra@wisc.edu]\nh4. Institution:\n\nInstitution name:UNIVERSITY OF WISCONSIN MADISON\n FICE:A00389501\nh4. Product:\n\nProduct name:Weygandt, Managerial Accounting, 8e\n Product UUID:23393f6f-5cc5-4752-bd83-29c8e132f83d\n Product ISBN:EPROF18124\n\n ",
        "comments": [
            "25/Mar/20 3:34 AM;osolovyo;hi [~abondar] - could you please take a look and help to move it forward?\nIt it possible to register the pointed student in NWP so she would be shown in Student List for Timed Assignment Accommodations with her real name (not as anonymous)?;;;",
            "25/Mar/20 5:14 AM;abondar;[~osolovyo] It seems there is no enough data to reproduce the issue. \n There are six LMS course sections associated with UNIVERSITY OF WISCONSIN MADISON institution in our database:\n [https://learning.XYZ.com/abcadmin/index.html#/courseSectionList/lmsSection/7623]\n [https://learning.XYZ.com/abcadmin/index.html#/courseSectionList/lmsSection/7622]\n [https://learning.XYZ.com/abcadmin/index.html#/courseSectionList/lmsSection/5190]\n [https://learning.XYZ.com/abcadmin/index.html#/courseSectionList/lmsSection/5173]\n [https://learning.XYZ.com/abcadmin/index.html#/courseSectionList/lmsSection/5185]\n [https://learning.XYZ.com/abcadmin/index.html#/courseSectionList/lmsSection/5184]\n There are three anonymous students found in these sections:\n tlcii@uwm.edu - [https://learning.XYZ.com/abcadmin/index.html#/userList/lmsUser/86107]\n angelama@uwm.edu - [https://learning.XYZ.com/abcadmin/index.html#/courseSectionList/lmsSection/5185]\n lspitzer@uwm.edu - [https://learning.XYZ.com/abcadmin/index.html#/courseSectionList/lmsSection/5173]\n But none of them is mucched to the requested user: Sonia Mehra\n\nAt the same time we can find the requested user [(skmehra@wisc.edu|mailto:skmehra@wisc.edu]) in our database, but there is no any enrolmets to class section in this case:\n[https://learning.XYZ.com/abcadmin/index.html#/userList/XYZUser/429847]\n\nSo we definetelly need more information to proceed with the ticket...;;;",
            "25/Mar/20 5:33 AM;osolovyo;hi [~mshirley] - it looks like the issue is reported from non-XYZ Canvas. So we cannot reproduce it when acting as a user.\n\nIs it possible to provide a link to the course/assignment and credentials for instructor's account so we could reproduce and investigate the issue?;;;",
            "25/Mar/20 9:30 AM;mshirley;,[~dknott] can you obtain the information from the instructor that [~osolovyo] is requesting?;;;",
            "25/Mar/20 10:22 AM;lfavors;[~mshirley], \n\nLets recreate the issue using https://XYZ.instructure.com/login/canvas. this issue should not be specific to one user.;;;",
            "25/Mar/20 4:24 PM;mshirley;[~osolovyo] [~dknott] is working with the instructor to gather this information.\n\n \n\nMeanwhile we created a test course and student, and replicated the issue.\n\nTest Timed Assignment:\n\n[https://XYZ.instructure.com/courses/2518663/assignments/26193777]\n\nLogin ID: mjshirley79\n\nAnonymous\n\n  !Untitled.png!;;;",
            "26/Mar/20 8:10 PM;mshirley;[~osolovyo] further reports have come in that this issue may not be limited to Autonomous users.\n\n \n\nSFDC# 05583465 \n\n[https://learn.XYZPLUS.com/courses/42868/assignments/4784331?module_item_id=14870284] \n\nInstructor: Changhee Lee\n\nInstructor Email: [clee6@ramapo.edu|mailto:clee6@ramapo.edu]\n\nStudents tested;\n # \n|[Emily Alcasid |https://learn.XYZPLUS.com/courses/42868/users/551223]|[ealcasid@ramapo.edu|mailto:ealcasid@ramapo.edu]|\n\n # \n|[Greg Engemann|https://learn.XYZPLUS.com/courses/42868/users/549748]|[gengeman@ramapo.edu|mailto:gengeman@ramapo.edu] |\n\nAttached video of screen share from the instructors side. Issue replicated for both students.\n\nTested local in Firefox, Chrome, both with cache & coolies cleared and incognito window.\n\n \n\nI have suspension that this may be server side response / database lookup issue\n\n \n\nOther agents tested with other standalone courses earlier today without issue.\n\n \n\nI hate to suggest, but this may be a more urgent issue to resolve given how randomly the function works, and also does not.\n\n \n\n[~jwright] confirmed having the same issue with the course noted in this comment.\n\n ;;;",
            "27/Mar/20 1:42 AM;dstepkin;[~mshirley] [~jwright] [~lfavors]\nfor this particular canvas course: https://learn.XYZPLUS.com/courses/42868\ni found that abc data and Canvas data *are out of sync*. at least for a \"published / unpublished\" parameter. in our database course listed as PUBLISHED but in canvas it is UNPUBLISHED instead. i didn't check that rigorously for other params, but it looks like that param alone might cause potential issues like that.\n\nso probably unpublishing the course and publishing it back to keep data in sync using one of our tools (*Cinnamon Bread* or *Instructor Admin Tool*) might solve this particular issue.;;;",
            "01/Apr/20 12:20 PM;mshirley;[~dstepkin] \n\nFrom the Course Admin (Canvas) - *_The system is unable to unpublish your course because it contains graded submissions._*\n\nFrom CAP - *_Error. Cannot unpublish the course_*;;;",
            "01/Apr/20 1:08 PM;rdannelly;I'm closing this ticket. Right now, this is expected behavior in the system. The system does not support anonymous users in this capacity. I have created a new feature ticket for us to better support our anonymous users, including this used case. I've linked the new feature ticket to this ticket for reference.;;;",
            "01/Apr/20 1:20 PM;mshirley;[~rdannelly] I understand that you are confirming the functionality was not designed to support accommodation of anonymous users.\n\n*Is there any possible work* *around?* The instructor has been waiting for a response. The student likely completed other assignments in the instructors course. The instructor is also an Author of this book... I would hate to exacerbate the instructors frustrations. - What would you suggest at this time? *SFDC# 05572684***\n\nStill waiting for appropriate steps to resolve this issue on, [https://learn.XYZPLUS.com/courses/42868], where the user is not anonymous. Previously provided steps did not resolve the issue. Do I need to create another JIRA? *SFDC# 05583465*\n\n ;;;",
            "02/Apr/20 2:36 PM;rdannelly;Hi [~mshirley], I'm looping in [~snorman] as she can detail if there are any current workarounds we can give this student in WAS.\n\nYou can also tell the instructor/author that we're looking to add in a functionality to support a XYZ employee ending a student's anonymous state and have them claim an account (if a student asks for this) through our CAP admin tool. This will then allow these students to complete the timed assignment.  This ticket is NG-9479.\n\nThis solution will not be in place for another several months though, so if you need a more urgent workaround, please connect with Stephanie.;;;",
            "13/Apr/20 9:19 PM;mshirley;[~rdannelly] another instance of this has been reported by [~lwenger]\n\n[https://learn.XYZPLUS.com/courses/43080] \n\nBoth Lanie and I have tested with l large number of students in the class to add them to accommodations. It is not working in any browser, 9:pm EST 4/13/2020\n\nI do not believe that all students registered anonymous, if any did how can one tell from CAP?\n\n*SFDC# 05633368* ;;;",
            "14/Apr/20 10:19 AM;lfavors;[~mshirley],,\n\nThere is no work around to add accommodations for a user who is listed as anonymous.  The functionality to change a students decision to transition from anonymous is  slotted in a future peace of functionality.  With your additional comment referencing SFDC# 05633368 \n, are you addressing the same issue or are you identifying a new issue?\n\nIf a new issue, please open a new Jira. If the same issue please stop updating this cancelled Jira.\n\nFYI [~tsummers][~sflanigan]\n;;;"
        ]
    },
    {
        "Summary": "XYZ NWP users created as student account need to be Instructor",
        "Issue key": "NGPROD-1426",
        "Description": "XYZ NWP users created as student account need to be Instructor\n\test@XYZ.com",
        "comments": [
            "04/Aug/20 4:23 AM;osolovyo;hi [~ewinklem] - could you please take a look and help to resolve the issue with user accounts/roles?;;;",
            "04/Aug/20 1:06 PM;ewinklem;[~osolovyo]\n \nWe have no means from our end to affect users who were created as students to enable them to become instructors.\n \n[~lfavors]\ndidn't there used to be a long-standing NGPROD ticket for the engineers to make the necessary change for that?;;;",
            "04/Aug/20 1:11 PM;osolovyo;hi [~daladinski] - could you please move this forward with dev team (Proton team)?\n;;;",
            "05/Aug/20 6:20 AM;ystartsev;Hi [~osolovyo], [~lfavors], [~ewinklem].\n We have a couple workarounds to do this, I will try to find the description or create a new.;;;",
            "05/Aug/20 8:37 AM;ystartsev;I have found the similar ticket: https://jira.XYZ.com/browse/NGPROD-941\n\n[~lfavors] could you please try to use some of the following workarounds?\n\nthere are at least 3 known ways on how to do so. and in any of these cases (if i remember correctly) you need to specify user Institution and Department (needed for CORE system):\n # create a course for that user using *Course Setup Tool*\n # enroll a user as an instructor to any course section using *Cinnamon Bread*\n # enroll a user as an instructor to any existing course section using *Instructor Admin Tool* (not a native XYZ Canvas, but IAT);;;",
            "14/Aug/20 3:55 AM;lfavors;I was able to resolve this issue manually [~ewinklem], the longstanding issue is for an E4 based issue.\n\nThank you all.;;;"
        ]
    },
    {
        "Summary": "Report Request - Need to know what users' accounts are going to be expired before June 1st",
        "Issue key": "NGPROD-266",
        "Description": "Please create a User and Subscription report with the following information:\n\nUser profile ID\n\nFirst Name\n\nLast Name\n\nEmail Address\n\nRole\n\nInstitution\n\nCourse Section Code \n\nCreation Date\n\nLicense ID\n\nLicense type\n\nLicense model\n\nProduct ID\n\nStart date\n\nEnd date\n\n ",
        "comments": [
            "25/Jan/19 2:34 PM;rvirginia;[~vsundaramu] FYI. Maybe Aryeh could help with this?;;;",
            "31/Jan/19 1:08 PM;jlu2;Discussed this request with [~rdannelly], she will talk to [~dpetrucci] if this can be a future requirement for the team to proceed. ;;;",
            "13/Feb/19 10:54 AM;rdannelly;Hi [~dpetrucci], thank you for bringing this up. We are currently in the process of planning out our jobs to be done for budgeting purposes for FY20.  One of the jobs to be done is adding in the capability within the Cinnamon Bread to query the data to generate reports.  We still have yet to determine when the teams will be working on this, but it's high on our radar of importance for the coming year.  Once I have more information and I start the preliminary work to determine everyone's needs in reporting from the Cinnamon Bread, it would be great if you and I could connect so that I gain a better understanding of your team's reporting needs (the details that you provided in this ticket is a great start!).;;;",
            "13/Feb/19 11:20 AM;dpetrucci;[~rdannelly], \n\nThis was a request for a single report with a specific need.  We need to identify how many customer accounts may be expiring this semester.  Is there any way of getting a report to me, and then separately creating functionality that provides similar reporting in the future?\n\nD-;;;",
            "14/Feb/19 12:35 PM;rdannelly;Hi [~dpetrucci], when do you need this information by? ;;;",
            "14/Feb/19 2:08 PM;dpetrucci;[~rdannelly]\n\nLast week would have been optimal.  :)  Right now we're working on borrowed time.  Hoping to identify the customers who are going to expire before they do.  Right now, any customers who registered for a 1 term course last semester and are registered for another course this semester will be contacting us any minute to have their access extended.  We're hoping to figure out how big that problem could be before we let all of our seasonal support go.  (which is in the next week);;;",
            "28/Feb/19 3:55 PM;dpetrucci;[~rdannelly] any update on getting this data?  we had 10 customers from 1 school contact us  this week about their accounts expiring.  (it was a mess for the instructor)  If we had this data in advance, it could have been handled in advance. ;;;",
            "04/Mar/19 3:22 PM;jlu2;[~mlepyoshki] please share the issue with the team and provide some estimation with [~rdannelly] so she can prioritize the request with some idea about how much effort it would be by the team.;;;",
            "15/Mar/19 4:47 PM;jlu2;[~rdannelly] let us review this in our triage meeting.;;;",
            "29/May/19 1:12 PM;jlu2;Per meeting with [~rdannelly], it was decided to defer.;;;"
        ]
    },
    {
        "Summary": "[NGAI] Add 'Hide sections' functionality into CAP to make sections non-discoverable - NG Admin",
        "Issue key": "NG-5424",
        "Description": "Within the CAP, provide users the ability to make course sections non-discoverable in the course finder so that students cannot register.  This new functionality will allow admin users to override the automatic provisioning for class tests.\n\nAdd a toggle/check box on the course section page within CAP in a new row titled \"Show/Hide in the course finder\". \n\nWhen new course sections are created, the toggle/check box should start off as 'show' so that students can find the course section. All existing course sections in the CAP will be set up with the status set to 'show'.\n\nIf the toggle/check box is changed to 'hide', the course section should be changed to not discoverable in the course finder during student registration.  Students will not be able to find the course section when searching by either course ID, instructor, institution, or course section name.\n\nWhen the toggle/check box is switched back to \"show\", students will again be able to find the course section during the registration flow.\n\n ",
        "comments": [
            "01/Mar/19 9:31 AM;rdannelly;Hi [~aryzhakov], I'm adding a new ticket to sprint 70 for us to discuss today on the call.  In looking at the board, we have some capacity to take on additional stories is this is one that is very critical for our product operation's team, technical support team, and our customer success team. This ticket was originally planned on the roadmap for sprint 78, but I would like us to potentially work on it in sprint 70. FYI [~ewinklem] and [~mlepyoshki];;;",
            "01/Mar/19 9:44 AM;ewinklem;There is already a True/False statement in the database for each course for \"IsDiscoverable\"...the idea here is to make changing that a function in the CAP.;;;",
            "01/Mar/19 9:49 AM;aryzhakov;[~rdannelly] Hi Ryann, some questions related to this functionality. Can you please take a look? \n # Should it be hidden for instructors in course finder also?\n # Should we hide the section for the users already enrolled into it (course finder, dashboard, IAT, etc)?\n # Should it be hidden in IAT?\n # What about native Canvas interface? (not sure if it is possible to hide this sections from Native interface);;;",
            "01/Mar/19 4:54 PM;rdannelly;I wanted to bring up a few follow up questions from our grooming meeting today. \n\nFrom my understanding, there seems to be some debate as to whether or not we need this ticket if we are working on adding in the functionality to delete course sections within the instructor admin tool. We are not currently planning on working on deleting course sections within the Cinnamon Bread, though. We are working on showing that course sections have been deleted in the Cinnamon Bread.  We are not doing any hard deleting in the Cinnamon Bread.\n\nA course section that has been deleted in the instructor admin tool will appear in the course finder, but students will receive a message that indicates that the course section has been deleted and that they should contact their instructor (similar to the messaging for unpublished courses).  Deleted courses are not removed from the WP dashboard or the course finder flows.\n\n[~ewinklem], based on that information, do you think that we still need to add this functionality in to address deleted course sections?  There are other used cases, though, in which we should include this functionality into the Cinnamon Bread.  We don't want to have to ask Vasanth to run a script to change information in the system.\n\nThoughts? [~aryzhakov] and [~abondar]\n\n ;;;",
            "04/Mar/19 6:51 AM;aryzhakov;Hi [~rdannelly] , [~ewinklem],\n\nOne correction to the above message - the deleted sections won't be shown on the WP dashboard. ;;;",
            "05/Mar/19 10:22 AM;rdannelly;Hi [~aryzhakov], I connected with [~ewinklem] and this toggle to make courses discoverable/non-discoverable is still needed to fit the needs of the various edge cases in which we don't want course sections to be discovereable.  [~vsundaramu] (I believe) was a part of setting up the existing True/False statement in the database for each course section. Within the database there is existing \"IsDiscoverable\" logic that we can use to add in the functionality to the Cinnamon Bread. \n \n \n ;;;",
            "06/Mar/19 3:57 AM;aryzhakov;Hi [~rdannelly], \n\nOk. Thank you for confirmation.\n\nI have some questions/assumptions to clarify. Can you please take a look and share your thoughts? \n # I propose to hide only the sections that have no active enrollments. Is it fine? If the section has someone enrolled into it - the admin has to remove all the enrollments prior to hiding the section.\n # It shouldn't be allowed to enroll someone into hidden section. Is this fine?\n # It'll be hidden for instructors/students in course finder (even when searching by sections code)\n # It'll be hidden in IAT\n # It won't be hidden in native Canvas since we don't have mechanism to hide it there\n # It'll be possible to hide the section related to unpublished course as long as it has no enrollments\n # Currently we are disabling Edit mode for deleted sections. Should we have an ability to hide the 'deleted' course sections? Is it needed?\n # Is it Ok to follow the attached mock up?\n\n \n\n ;;;",
            "06/Mar/19 3:57 PM;rdannelly;Hi [~aryzhakov], please view my replies to your questions below:\n # I propose to hide only the sections that have no active enrollments. Is it fine? If the section has someone enrolled into it - the admin has to remove all the enrollments prior to hiding the section. {color:#FF0000}RD: agreed. Only hide sections that have no active enrollment. An admin must first remove all enrollments in a course section before hiding the section{color}\n # It shouldn't be allowed to enroll someone into hidden section. Is this fine? {color:#FF0000}RD: Agreed. This is fine.{color}\n # It'll be hidden for instructors/students in course finder (even when searching by sections code) {color:#FF0000}RD: Agreed.{color}\n # It'll be hidden in IAT {color:#FF0000}RD: Agreed.{color}\n # It won't be hidden in native Canvas since we don't have mechanism to hide it there {color:#FF0000}RD: Agreed.{color}\n # It'll be possible to hide the section related to unpublished course as long as it has no enrollments {color:#FF0000}RD: Agreed.{color}\n # Currently we are disabling Edit mode for deleted sections. Should we have an ability to hide the 'deleted' course sections? Is it needed? {color:#FF0000}RD: This is not needed. We do not need an ability to hide the 'deleted' course sections because deleted course sections will NOT show up on the XYZ course finder or in the MyWP dashboard, correct?{color}\n # Is it Ok to follow the attached mock up? {color:#FF0000}RD: The attached mock ups look good to go!{color}\n\n ;;;",
            "07/Mar/19 7:47 AM;aryzhakov;Ready for spec workshop;;;",
            "11/Mar/19 8:48 AM;aryzhakov;Updated the name of the story since this is not a simple check box and impacts a large part of CAP.\n\nSpec workshop passed. Ready for TA;;;",
            "15/Mar/19 10:21 AM;aryzhakov;Updated - Admins should also have an ability to Hide/Unhide sections;;;",
            "26/Mar/19 10:32 AM;aryzhakov;Corrected the mock up - Hide option will be available for the sections with enrollments;;;",
            "29/Mar/19 3:29 AM;aryzhakov;AC 7 is corrected to match the desired behaviour;;;",
            "02/Apr/19 7:38 AM;aryzhakov;Added messages for success/failure indication during hide/unhide process;;;",
            "04/Apr/19 6:22 AM;akiselev;Testing is complete.;;;",
            "08/Apr/19 9:35 AM;rdannelly;I've completed my UAT testing.  Please view this story as complete. Thank you team! This one will make [~ewinklem] and his team's jobs much easier!;;;"
        ]
    },
    {
        "Summary": "[New Features Development Support] UAT ACCOUNTS Student Onboarding - Sprint 24",
        "Issue key": "NG-15181",
        "Description": "Hi [~abykova] \n\nCan you help create test courses/cases for the following on QA environment:\n # One student who is already registered and enrolled in a test institution + a section - provide login/pw\n # Two instructor accounts who are already registered - provide login/pw\n ## Two courses associated with one of the test accounts + sections/section IDs\n # CAP QA env login",
        "comments": [
            "29/Mar/22 11:37 AM;afoley;Hi [~abykova] \n\nCan you help create test courses/cases for the following on QA environment:\n # One student who is already registered and enrolled in a test institution + a section - provide login/pw\n # Two instructor accounts who are already registered - provide login/pw\n ## Two courses associated with one of the test accounts + sections/section IDs\n # CAP QA env login\n\ncc: [~jgupta] [~abondar] [~mcolner] [~ilundy] [~kdawson] [~lfishman] [~sdevi] ;;;",
            "29/Mar/22 11:39 AM;afoley;[~vsundaramu] for awareness if you need anything else;;;",
            "30/Mar/22 3:52 PM;ilundy;[~abykova] Please let me know the credentials for all 3 accounts (1 student, 2 instructor). Thanks!;;;",
            "01/Apr/22 11:51 AM;abykova;Hi [~ilundy] [~afoley] \n\nI created 2 courses, 2 instructors and 2 students(with license and without) on QA env.\n1.\ninstructor.1+bnb@2022-04-01.XYZ.qa / XYZ12345\ninstructor.2+kam@2022-04-01.XYZ.qa / XYZ12345\nstudent+tpl@2022-04-01.XYZ.qa / XYZ12345\nstudent+free.trial+lki@2022-04-01.XYZ.qa / XYZ12345\n2. \n    2.1 course: Course 1 for UAT testing\n          sections: B87180\n          enrolled users:\n              instructor.1+bnb@2022-04-01.XYZ.qa\n              student+tpl@2022-04-01.XYZ.qa enrolled to B87180 without any license\n              student+free.trial+lki@2022-04-01.XYZ.qa enrolled to B87180 with Free Trial License\n    2.2 course: Course 2 for UAT testing\n          sections: B87181\n          enrolled users: none\n3. this is our only user to login to CAP on QA env:\nwp-test-automation@XYZqa.com / XYZ@12345g;;;",
            "06/Apr/22 3:35 PM;ilundy;Hi [~abykova] : Can you generate a reg code in the QA environment? Thanks!;;;",
            "07/Apr/22 2:08 AM;abykova;Hi [~ilundy] feel free to use these reg codes for testing: \nWAD2-9K73-UI\nWADN-T44K-ZI;;;",
            "07/Apr/22 3:24 PM;ilundy;Hi [~kluciano] : Can you tell me if this email address in ALM Staging? Email: [instructor.1+bnb@2022-04-01.XYZ.qa|mailto:instructor.1+bnb@2022-04-01.XYZ.qa]\n\n ;;;",
            "07/Apr/22 3:40 PM;ilundy;Hi [~abykova] : Can you tell me which courses the reg codes you created are associated with (WAD2-9K73-UI and WADN-T44K-ZI)?;;;",
            "07/Apr/22 3:42 PM;kluciano;[~ilundy] - It exists in ALM QA but not in ALM PPD (STAG). My understanding was that the environment you're using for your testing is connected to our STAG. [~jgupta] - is that correct?;;;",
            "08/Apr/22 2:44 AM;abykova;Hi [~ilundy] reg codes can be used for any course/product;;;",
            "08/Apr/22 1:52 PM;ilundy;Hi [~jgupta]  : Please confirm that the onboarding app is pointing to ALM staging environment. Thanks!;;;",
            "10/Apr/22 6:55 PM;ilundy;Hi [~abykova] : Can you create several more courses and reg codes. I need to test the reg codes scenario several times, and I also need to enroll in multiple courses to test soft-entitlement. Thanks so much for your help!;;;",
            "15/Apr/22 9:06 AM;abykova;Hi [~ilundy]\n1. How many courses for testing reg codes do you need? Which ones, multi-semester or single-semester? How many reg codes?\n2. Could you please provide more details about the courses and users for \"soft-entitlement\" testing? How many courses do you need, how many students. Do you need courses with an institution license, sections with open access, etc.? It would be much easier if you provided test scenarios for testing this functionality with a detailed description of the initial conditions (courses, type of access to the course, number of students etc.);;;",
            "18/Apr/22 5:37 PM;ilundy;Hi [~abykova] ,\n\nOkay, I will send a list of courses I need created. In the meantime, can you confirm that these are the course titles for the 2 courses you created?\n * Course 1 for UAT testing\n * Course 2 for UAT testing;;;",
            "19/Apr/22 1:30 AM;abykova;Hi [~ilundy] I confirm that courses \"Course 1 for UAT testing\" and \"Course 2 for UAT testing\" were created for UAT testing, as Andrea asked in comment above.;;;",
            "20/Apr/22 4:22 PM;ilundy;Hi Anna,\n\nCan you create the following courses? Can you also use the course names below?\n * 1 course with an institutional license where the course is active and the institutional license is active\n ** Name: Institutional License\n * I need 2 courses setup for a non-XYZ LMS\n ** 1 course that has multi and single term access purchase options\n *** Name: non-XYZ LMS Single/Multi\n ** 1 course that has single term access purchase options\n *** Name: non-XYZ LMS Single\n * 2 courses that are single term only\n ** Name: Single Term\n * 1 course that has single and multi term access purchase options\n ** Name: Single/Multi Term\n\nPlease let me know if you have any questions. Thank you!;;;",
            "21/Apr/22 3:05 PM;ilundy;[~abykova] Are you sure the course *names* for the courses you created are \"Course 1 for UAT testing\" and \"Course 2 for UAT testing\"? Based on what's being displayed in the those are the *section* names. The *names* of the courses seem to be \"Section 1\" and \"Section A\". Is that correct? See screen shot called \"Course Name and Section Names\".\n\n ;;;",
            "22/Apr/22 1:57 AM;abykova;Hi [~ilundy],\nyes, of course, I am 100% sure that \"Course 1 for UAT testing\" and \"Course 2 for UAT testing\" are names of courses, not course sections. You can find course/sections information from Cinnamon Bread in screenshot \"course2_for_uat_testing_admin_view\". It seems that there is an issue in the display of course names and course sections on the Convergence Onboarding courses page. Could you please check this with your developers. Thanks.;;;",
            "25/Apr/22 7:43 AM;abykova;Hi [~ilundy] The courses you requested have been created.\nYou can find standalone courses on dashboard for standalone instructor: co.instructor.uat.1@XYZ.qa / XYZ12345\nYou can find LMS (non-XYZ) courses on [Canvas dashboard|https://XYZ2.test.instructure.com/login/canvas] for lms instructor: canvas.instructor.uat.1@XYZ.qa / XYZ12345;;;",
            "27/Apr/22 3:40 PM;ilundy;Hi [~abykova] :\n\nThank you so much! I've reviewed my test cases once more and I'm hoping you can create the following courses:\n * Course where all eCommerce options are disabled\n * Course where there are 10+ instructors\n * Course set up with CAD pricing with all purchase options turned on\n * Course with a custom ePROF associated with it\n\nCan you also:\n * Provide the name of a different course (none created so far), for a different school than that I'm using, that I don't have access to. \n * Be sure all purchase options are available for the courses that have been setup for the non-XYZ LMS.\n\nThanks again!;;;",
            "03/May/22 11:56 AM;ilundy;Hi [~abykova] : Can you tell me what school is associated with the courses you already created and what school is associated with the remaining courses that I've asked you to create? Thanks!;;;",
            "04/May/22 7:42 AM;abykova;Hi [~ilundy], you can find institution name for each course on Canvas course Settings page(attached picture Canvas_course_settings_page).;;;",
            "04/May/22 10:33 AM;abykova;Hi [~ilundy] as to your request:\n * [for TCS] Course with suppressed Shopping Cart\n * [for TCS] Course in Canadian institution\n * [for TCS] Course with 10+ instructors\n * what do you mean \"custom eprof\"?\n\nThis course \"[for TCS] Course with 10+ instructors\" has different institution than previous ones\n\nCreated LMS courses correspond to EPROF18523(single) and EPROF17811(multi).;;;",
            "04/May/22 12:29 PM;ilundy;Hi [~abykova],\n\nFor the courses the most recent courses you created (see below) I made a mistake with my request. Those courses need to be setup in Canvas, similar to most of the courses you've already created (see examples below). My apologies for this!\n\nMost Recent Courses Created that Need to be Setup in Canvas.\n * [for TCS] Course with suppressed Shopping Cart\n * [for TCS] Course in Canadian institution\n * [for TCS] Course with 10+ instructors\n\nExample of Canvas Courses\n * 2 courses that are single term only\n ** Name: Single Term\n * 1 course that has single and multi term access purchase options\n ** Name: Single/Multi Term\n\nAlso, by custom ePROF, I mean a custom course that has been setup by an institution and should not appear in the search results on XYZ.com. ;;;",
            "05/May/22 6:56 AM;abykova;Hi [~ilundy], I will create a ticket to create courses on your request in the next sprint.;;;",
            "13/May/22 5:59 AM;abykova;Hi [~ilundy] ,\nthe following LMS courses were created as to your request:\n\n\"[for TCS] LMS Course with 10+ Instructors\" https://XYZ2.test.instructure.com/courses/60772\n\"[for TCS][LMS] Course in Canadian Institution\" https://XYZ2.test.instructure.com/courses/60774\n\"[for TCS][LMS] Course with suppressed shopping cart\" https://XYZ2.test.instructure.com/courses/60829\n\nInstructor canvas.instructor.uat.1@XYZ.qa / XYZ12345 is enrolled to these courses.;;;",
            "16/May/22 6:13 PM;ilundy;Hi [~abykova] : Thank you so much for all your assistance! When you find the time, could you possibly create one more course: \n * Institutional license is expired, course is active\n * Name: Expired Institutional License, Course Active\n\nCan you also make the following change?\n * Make [for TCS] Single Term 2 display all 4 ecommerce options on the Purchase Options page.\n * Currently it's only displaying standalone access and WP+ Permanent eBook\n\nThanks again, for all your help!;;;",
            "17/May/22 7:10 AM;abykova;Hi [~ilundy]\n\nShould a new course \"Expired Institutional License, Course Active\" be a standalone or LMS?\n\nAs to \"[for TCS] Single Term 2\" course, I see 4 ecommerce options for student in abc(ecommerce_options.png). Could you pls check Convergence logic on ecommerce page with your developers.;;;",
            "18/May/22 6:11 PM;ilundy;Hi [~abykova] : Please create a standalone course. Thank you!;;;",
            "19/May/22 11:11 AM;abykova;Hi [~ilundy]  I created a course in institution with expired institutional license:\n\n\"[for TCS] Course in institution with expired license\" [https://XYZ2.test.instructure.com/courses/61115]\n\ninstructor co.instructor.uat.1@XYZ.qa / XYZ12345 is enrolled to this course;;;"
        ]
    },
    {
        "Summary": "E2E Testing for Trade Test Bank License Management CAP",
        "Issue key": "EPOI-1916",
        "Description": " * Feature testing (CAP)",
        "comments": [
            "08/Mar/24 11:47 AM;gherath;Hi [~smorozov] [~nkochmarev] below scenarios were identified while doing the verification. Can you please have a look?\n\n1. for some ISBNs it displays the '{color:#ff8b00}Bad Request'{color} in the creation wizard and API response returns {color:#ff8b00}\"{_}Request to PsdFindProduct API [https://psd-service.qa.tc.XYZ.host/api/v1/products] returned status=404 NOT_FOUND, message=404 Not Found: \"\\{\"timestamp\":\"2024-03-08T16:05:52.143Z\",\"error\":\"Not Found\",\"message\":\"A resource that matches the requested criteria wasn't found. Please check the given identifier and try again.\",\"status\":404,\"path\":\"api/products\"}\"{_}{color}, although the 'Create', button is enabled and clickable. \n\nISBNs: 9781119778950, 9781119778953\n\n!2024-03-08 21_21_02-abc Course admin — Mozilla Firefox.png|thumbnail!\n\nit should be:\n\n!expected result non test bank product.png|thumbnail!\n\n2. Product name is displayed in the second step of the license creation. but product details display as 'N/A' in the 3rd step.\n\n!2024-03-08 21_43_34-abc Course admin — Mozilla Firefox.png|thumbnail! !2024-03-08 21_46_33-abc Course admin — Mozilla Firefox.png|thumbnail!\n\nit should be:\n\n!figma product details.png|thumbnail!\n\n3. if a license created from the CAP UI, Admin email is displayed under the \"{*}Last modified admin{*}\" and created date in '{*}Last modified date{*}' field.\n\nit should be N/A for license creation\n\n4. If a test bank license is created by redemption API, user email passed from the API is displays in \"{*}Last modified admin{*}\" and the created date in '{*}Last modified date{*}'. (hope this information will be taken from the JWT as this API is not exposed to the end user)\n\nit should be N/A for license creation. \n\n!license from redemption API.png|thumbnail!\n\ncc: [~atyukavkin] [~azagnityko] [~cdantaka] \n\n ;;;",
            "14/Mar/24 6:05 AM;nkochmarev;[~gherath] Hi, error handling and product name issues were fixed in version #8\"3.13.54\" course-admin-portal-ui, currently depoyed on QA;;;",
            "15/Mar/24 3:11 AM;gherath;QA verified the fix for #1 and #2 in XYZPLUS-course-admin-ui, version: 3.13.54\n\n#1 For invalid ISBNs it displays the error message \" {*}Unable to find a product with ISBN XXXXXX{*}\" in the UI, and '{*}Create{*}' button is disabled.\n\n!error handling- verification.png|thumbnail!\n\n#2. Product name is displayed in the third step of the license creation (in summary).\n\n!Product name in summary -creation wizard-verification.png|thumbnail!;;;",
            "18/Mar/24 10:37 AM;gherath;Hi [~lfishman] Can you please review below scenario for creating Test bank licenses in CAP?\n * For XYZ Reader ISBN that is not existed in Test Bank,\nUI displays the error message \" {*}Unable to find a product with ISBN XXXXXX{*}\".  As per the Figma design, it should be \"{*}This ISBN is not for a Test Bank Title{*}\". \n\nXYZ Reader ISBNs: 9781119320890/ 9781119308843.\n\n!using XYZ Reader ISBNs.png|thumbnail!\n\n[https://learning-qa.XYZ.com/abcadmin/index.html#/userList/XYZUser/494779]\n\ncc: [~smorozov] ;;;",
            "18/Mar/24 10:59 AM;lfishman;[~gherath] If it can be changed to \"Unable to find a test bank product with ISBN\" instead of just \"Unable to find a product\" then it should be fine.;;;",
            "19/Mar/24 12:40 AM;gherath;[~smorozov] can we change the error message from\" {*}Unable to find a product with ISBN XXXXXX{*}\" to \"{*}This ISBN is not for a Test Bank Title{*}\" in the above scenario? ;;;",
            "19/Mar/24 2:44 AM;smorozov;[~gherath] , we use \"{*}Unable to find a product with ISBN XXXXXX{*}\" as it covers two possible scenarios:\n- when there is no any product with given ISBN in PSD\n\n- when TestBank product with given ISBN is missed in PSD\n\nAlso, the TestBank context should be clear for the admin user when creating TestBank license.\n\nFrom that, I think this does not look a critical issue.;;;",
            "25/Mar/24 9:22 AM;gherath;Testing will be continued in [EPOI-1943|https://jira.XYZ.com/browse/EPOI-1943] Thanks;;;"
        ]
    },
    {
        "Summary": "[NGIAT] Conclude abc Course - Instructor Admin Tool",
        "Issue key": "NG-85",
        "Description": "As a Standalone instructor\n\nI would like to conclude access to my abc course\n\nso that I can officially end the course\n\n \n\n~ Conclude abc Course\n\n~ Update Enrollments\n\n~ Grade Sync ",
        "comments": [
            "17/Oct/18 8:39 AM;abondar;[~gnayak], [~rvirginia]\nSome comments based on discussion with tech team today.\nHigh-level questions:\n~ What objects should be finished in the scope of the story: Course OR Course Section?\nIMy expectation: Course Sections (\"Class\" in WPE4 terms).\nSo the rewriting of the story is required.\n~ What are the expected results of “Conclude”(Finish) operation for Student and Instructor:\n~~ should be no longer available to the students (or part of the course grades)?\n~~ how the course section be accessible on Dashboard?\n~~ Do we need \"un-Conclude\" actions?\n\nThere is a list of functionality to be updated across the system:\n  - Dashboard – view finished\n  - Dashboard – access finished\n  - Course finder – “finished class sections” case \n  - Un-finish\n  - Cinnamon Bread – Support “Finished” status\n  - Cinnamon Bread – Implement “Finish” action \n\nFYI, [~rtangri], [~vsundaramu], [~acostello]\n \n\n\n\n \n\n ;;;",
            "04/Sep/19 4:44 AM;abondar;The feature is done.;;;"
        ]
    },
    {
        "Summary": "Teaching Assistant Canvas Role shows Claim Account Error in Integrated New XYZPLUS Courses",
        "Issue key": "NGPROD-1017",
        "Description": "SFDC # 05317867, 05312780\n\nCanvas integration users who have the Teacher Assistant role are receiving a 'Claim Account Error' message when attempting to access XYZPLUS content. This has been replicated internally and externally for the Teacher Assistant user role. Resetting the user's account password does not resolve the issue.\n\nSteps to reproduce:\n\n1. Assign the 'Teacher Assistant' role to a new user in Canvas.\n2. Log into Canvas as the new user.\n3. Access a Canvas XYZPLUS link.\n4. Create a new XYZPLUS user.\n5. Set the password for the new user.\n6. Attempt to log into the XYZPLUS link.\n7. Receive attached error message.",
        "comments": [
            "21/Jan/20 8:49 AM;sflanigan;[~chrcollier]\n\nI tested and was unable to duplicate. I created a new user in canvas set as a TA.  I was then able to successfully complete the WP registration and access WP resources. Could you please provide the account info for the users experiencing this issue. \n\nTest course: [https://XYZ.instructure.com/courses/2440729]\n\nAccount: [flanigantest1@dispostable.com|mailto:flanigantest1@dispostable.com]\n\nPW: XYZ123;;;",
            "21/Jan/20 10:58 AM;chrcollier;I attempted to replicate the issue, again, but was unable to do so with another new account.\n\nThis issue was reported for these users:\n\nsdolphin@umich.edu\nlvalente@umich.edu\nastis@umich.edu\nbuschme@umich.edu\ndnanua@umich.edu\njescalante@knights.ucf.edu;;;",
            "19/Feb/20 4:45 PM;lfavors;[~chrcollier],\n\nPlease give me an update on this issue/case;;;",
            "04/Mar/20 8:53 AM;abondar;sprint 94 as an option;;;",
            "25/Mar/20 7:55 AM;osolovyo;This ticket has not been updated in more than 15 days.\nHi [~dstepkin] - could you please take a look with Proton team and move it forward?;;;",
            "25/Mar/20 10:02 AM;dstepkin;the root cause of this issue is the following:\nin abc data model we have 2 user roles: STUDENT and INSTRUCTOR.\n\nwhen LMS user launches XYZ content request goes through our LTI layer. LTI layer is mapping all the roles (e.g. Teaching Assistant, Observer, Admin etc) into 2 roles we have. Teaching Assistant role mapping is INSTRUCTOR.\n\nIn order to claim LMS user with existing XYZ user, roles of LMS user and XYZ user should be the same, otherwise user will see claim account error (and this behavior is expected). So that is exactly what happening here. Most of the users listed above have XYZ account with STUDENT role (screenshot attached)\n\nthe only exception here is sdolphin@umich.edu who has 2 roles: both STUDENT and INSTRUCTOR. and based on records in another database table problem is most likely solved already. since i can see that there is a link between LMS user with INSTRUCTOR role and XYZ user with INSTRUCTOR role.;;;",
            "25/Mar/20 10:26 AM;dstepkin;potential solution (quick fix) might be to add INSTRUCTOR role to all the XYZ users with STUDENT role listed above and then try to proceed with claim account flow.\n\nThis could be done in several different ways:\n* Create a course for this user via Course Setup Tool (it will automatically add INSTRUCTOR role to existing user)\n* Enroll existing student as instructor into XYZ course section (it could be done both in Cinnamon Bread and Instructor Admin Tool)\n* add that role directly by calling appropriate abc API with correct payload\n\nMost likely Cinnamon Bread is a way to go here since it is the safest options from these listed above. But in any case Department have to be selected in order to create PROFESSOR record in CORE system.\n\nBut worth mentioning that this approach has some side effects. And that dual-role users were considered as an edge case and we didn't pay that much attention to it during our development / testing process. Basic flows were tested but it was overall it was not tested as rigorously as regular single-role students or instructors.\n\nBut it is kind of *a gray area* in terms of *potential side effects*.\n\nIf you need any development in this area - [~rdannelly] is a proper person to contact.\n\nfyi [~chrcollier] [~sflanigan] [~lfavors] [~abondar] [~osolovyo];;;",
            "25/Mar/20 3:25 PM;rdannelly;Thank you for your assessment [~dstepkin]!\n\nHi [~lfavors], [~chrcollier], and [~sflanigan],\n\nPlease proceed with enrolling these users as instructors into XYZ course sections via the Cinnamon Bread.\n\nWe are not going to go the route of any development work to solve for this as we have a workaround solution in place through CAP and a larger epic in the backlog for supporting various additional roles like TAs down the line.;;;",
            "06/May/20 11:48 AM;abondar;Hi [~lfavors]\nCould you please confirm the expectation and let us know if the issue is still actual?\n;;;",
            "13/May/20 12:00 PM;osolovyo;Cancelling the ticket due to the resolution:\n_We are not going to go the route of any development work to solve for this as we have a workaround solution in place through CAP and a larger epic in the backlog for supporting various additional roles like TAs down the line._;;;"
        ]
    },
    {
        "Summary": "RDT chapters, sections are not loading for newly created product",
        "Issue key": "NG-10579",
        "Description": "+Steps to recreate+\n * Login to BB : 12082020_ins1@mailinator.com/XYZ123 \n * Go to Course:[https://XYZ-test.blackboard.com/ultra/courses/_686_1/cl/outline]\n * Open RDT\n\n+Expected outcome+\n * Should load chapters and sections\n\n+Actual outcome+\n * Didn't load\n\n+Note+\n*Product:* STEADY_Master_Course_e2e_testing (Seems to be a new product)",
        "comments": [
            "12/Aug/20 2:12 AM;vsaranga;Not a BB issue, can reproduce in standalone for the same product\n\n[https://XYZ2.test.instructure.com/courses/22418]\n\n[test@XYZ.com/ XYZ123|mailto:test@XYZ.com]\n\nFYI [~atyukavkin];;;",
            "12/Aug/20 8:27 AM;atyukavkin;Hi Vimukthi,\nDo you know how this product was created? I've just re-uploaded master json via Cinnamon Bread and now RDT is working as usual.\nThanks,\nAndrey T\n\n ;;;",
            "12/Aug/20 9:50 AM;vsaranga;[~atyukavkin] no clue. I think we can get some info from the proton team. If you can remember, RDT chapters loading after reuploading occurred once when we test that particular ticket too. \n\nFYI [~jlu2];;;",
            "13/Aug/20 12:21 AM;vsaranga;[~dstepkin] [~abykova] hopes product STEADY_Master_Course_e2e_testing was created by you. would it be able to answer the query by [~atyukavkin] regarding the product creation?\n\nFYI [~jlu2];;;",
            "13/Aug/20 9:48 AM;jlu2;[~vsaranga], I would not spend time for the product that is not proved to be working in any way.  We shall continue working on the product that we know it is working\n\nIf [~dstepkin], [~abykova] can explain why they create this separated product for testing, that would be great. If not, we can close the ticket by the end of sprint and make notes, not to test this product.;;;",
            "13/Aug/20 11:36 AM;vsaranga;This is nothing about the particular product. My concern was on RDT for a newly created product. As this is a newly created product, and RDT chapters and sections are not loading now this can be a bug on that feature as well. (as it should load chapters and sections for a newly created product without any backend update)\n\nFYI [~jlu2] [~atyukavkin] [~nmendis];;;",
            "17/Aug/20 6:26 AM;jlu2; \n\n[~atyukavkin], my understanding is that RDT in the course created by new master json production would be updated automatically and it would require additional step by script which you provided to content team for the course created by product json. Could you please review [~vsaranga]'s concern and provide clarification?;;;",
            "24/Aug/20 7:33 AM;atyukavkin;Hi [~jlu2], your understanding is correct.\nThanks,\nAndrey T;;;",
            "25/Aug/20 12:29 PM;atyukavkin;[~vsaranga] I checked this master course in Cinnamon Bread. It was created on 2020-06-25 3:47 AM . It is before implementation automatic update. Manual update for this case is required.\nThanks,\nAndrey T;;;",
            "25/Aug/20 11:27 PM;vsaranga;Closing the bug;;;"
        ]
    },
    {
        "Summary": "E4 - Review Intelligent Tutoring Problems not counting toward grade",
        "Issue key": "NGPROD-1194",
        "Description": "SFDC: 05637759\n\n \n\nDomain: [https://edugen.XYZPLUS.com/edugen/domain/dmn114685/]\n\nStudent: Taylor Simard (186988@MOODLE.yvybjGvXpR)\n\nCHEM1006A Winter 2020:CHEM1006A [10808] Elementary Chemistry II (LEC) Winter 2020\n\nwww.XYZPLUS.com/class/744198\n\n \n\nSee screenshots from 4 different assignments.  Taylor has gotten each part of the Review Intelligent Tutoring Problem correct, but her total score on the assignment shows as a zero.  This is occurring across multiple assignments for this student.  And presumably other students in the class.",
        "comments": [
            "15/Apr/20 7:38 AM;sflanigan;[~cweeks] Please add the names and assignment ids for the affected assignments.\n\n ;;;",
            "15/Apr/20 9:38 AM;cweeks;Affected assignments are:\n\n \n\nASGN8 CHEM1006 Chapter 8 Assignment\n\nASGN9 CHEM 1006 Chapter 9 Assignment\n\nCH13ASGN CHEM 1006 Chapter 13 Assignment\n\nCH15ASGN CHEM 1006 Chapter 15 Assignment\n\nCH16ASGN CHEM 1006 Chapter 16 Assignment\n\nASGN3 CHEM 1006 Chapter 3 Assignment\n\nCH12ASGN CHEM 1006 Chapter 12 Assignment;;;",
            "15/Apr/20 10:52 AM;osolovyo;Hi [~dkukhtik] - could you please review with E4 team and move it forward?;;;",
            "15/Apr/20 11:46 AM;rdannelly;Hi [~osolovyo], \n\nRight now the WPe4 team is focused on getting up to speed with the Cinnamon Bread epic that they are taking on this increment.  Due to that, we are not having the team take on bugs for WPe4 unless the work is deemed absolutely critical from [~lfavors]. Right now, I'm going to leave this ticket in the backlog.\n\nRyann;;;",
            "28/Apr/20 12:43 PM;rdannelly;I'm moving this ticket to the deferred status. The WPe4 team has been re-allocated to focus on a critical NWP project for the next three months.;;;"
        ]
    },
    {
        "Summary": "As a XYZ Canvas student I want to find my spring 2019 course section so that I can register",
        "Issue key": "NG-4972",
        "Description": "h1. Narrative\n\nXYZ Canvas students use the NG course finder to locate their course section and register. Most students enter a specific course code provided by their instructor, which takes them directly to their section, but many students do not know the code. These students need to browse the course finder to locate their section.\n\nStudents can browse by course name, instructor name, or see all sections at the school. The lists should only show active sections that are still open for registration; sections no longer open for registration should not be available in the course finder. \nh1. Approach\n * Each NG course section object should include a new binary attribute to signal discoverability to the NG course finder; see NG-4962.\n\nh1. Acceptance Criteria\n * A NG Admin can easily modify the discoverability attribute for one or many sections.\n * Discoverable course sections display in the NG course finder and are available for registration, BAU.\n * Non-discoverable course sections are hidden in the NG course finder and not available for students to register.\n\nh1. Out of scope\n * Filtering non-discoverable sections in the course code search UI.\n * Add discoverability toggle to the CAP.\n * Add discoverability toggle to the IAT.\n * Automated triggers to modify section discoverability:\n ** discoverable if published, active\n ** non-discoverable if unpublished, concluded or section end date in the past",
        "comments": [
            "09/Jan/19 11:05 AM;rvirginia;Hi [~daladinski], let me know if this works as a user story. Thanks, Rich;;;",
            "10/Jan/19 7:36 AM;akiselev;I've tested the task on QA. \nCourse_id=6885\nCourse sections codes:\nA91230\nA91231\nA91232\n\n1) After trying to find Course Section with the attribute is_discoverable=false via Find Course by ID message \"Course ID doesn't exist\" is displayed\n2) After trying to find Course Section with the attribute is_discoverable=false via Find Course by Name course section name isn't displayed in search results\n3) After trying to find Course Section with the attribute is_discoverable=false via Find Course by Instructor Name list of course sections related to the instructor is empty\n4) After trying to find Course Section with the attribute is_discoverable=false via Find Course by School Name list of course sections related to the school is empty\n\nPlease note that there are no changes in Cinnamon Bread. Via Cinnamon Bread we are still able to find course sections and enroll users.;;;"
        ]
    },
    {
        "Summary": "[NGPROD-227] Backend task. Adjust CourseSectionSearch API to take into account course section attribute 'isDiscoverable'",
        "Issue key": "NG-4952",
        "Description": "As per proposed solution described in in NGPROD-227:\n\n1. The Course Section data model should be updated with a new attribute 'is_discoverable'.\n\n2. All methods related to the CourseSectionSearch API should be adjusted to take into account the course section attribute 'isDiscoverable'.",
        "comments": [
            "10/Jan/19 12:19 AM;ystartsev;was implemented in develop/c82c654 version 1.65.1\n\n[~smorozov] please review.;;;",
            "10/Jan/19 7:05 AM;smorozov;The CST build with required hot/fix patch changed is deployed in QA.\nPlease use Vasanth's comment in NGPROD-227 concerning API changes as a reference for acceptance testing.;;;",
            "10/Jan/19 7:34 AM;akiselev;I've tested the task on QA. \nCourse_id=6885\nCourse sections codes:\nA91230\nA91231\nA91232\n\n1) After trying to find Course Section with the attribute is_discoverable=false via Find Course by ID message \"Course ID doesn't exist\" is displayed\n2) After trying to find Course Section with the attribute is_discoverable=false via Find Course by Name course section name isn't displayed in search results\n3) After trying to find Course Section with the attribute is_discoverable=false via Find Course by Instructor Name list of course sections related to the instructor is empty\n4) After trying to find Course Section with the attribute is_discoverable=false via Find Course by School Name list of course sections related to the school is empty\n\nPlease note that there are no changes in Cinnamon Bread. Via Cinnamon Bread we are still able to find course sections and enroll users.\n;;;"
        ]
    },
    {
        "Summary": "[TECH DEBT] CAP UI OSS list",
        "Issue key": "NG-5993",
        "Description": "Create OSS list file with type of licenses\n\nNOTICE.md !!!\n\nupdate docs!\n\nSend link to repo to the Benjamin or [test@XYZ.com|mailto:test@XYZ.com]\n\n [https://github.com/XYZ/open-source-party]\n\nmore info: [https://XYZ.sharepoint.com/:p:/r/teams/OpenSourceSoftware/_layouts/15/Doc.aspx?sourcedoc=%7B88de6dac-48a8-4a88-b6f2-8117fa3438eb%7D&action=default&uid=%7B88DE6DAC-48A8-4A88-B6F2-8117FA3438EB%7D&ListItemId=2&ListId=%7BB8D70818-5CCF-4F34-918E-791287B1C7A0%7D&odsp=1&env=prod]\n\n \n\nlist of permissive licenses:\n * BSD\n * MIT\n * Apache\n * Creative Commons family\n\n \n\nList of projects required to add OSS notice file:\n * abcadmin\n * ngprodpair\n * abccst\n\n Steps to finish:\n # remove restrictive licenses and keep only permissive\n # -Create notice files-\n # get approval from manager\n # report to oss party",
        "comments": [
            "21/May/19 3:20 AM;aziaev;OSS lists were created:\n\nCourse Setup Tool UI: [https://github.com/XYZ/XYZPLUS-course-setup-tool-ui/blob/feature/NG-5993/NOTICE.md]\n\nCinnamon Bread UI: [https://github.com/XYZ/XYZPLUS-course-admin-ui/blob/feature/NG-5993/NOTICE.md]\n\nProduct Pairing Tool UI: [https://github.com/XYZ/XYZPLUS-product-pairing-ui/blob/feature/NG-5993/NOTICE.md];;;"
        ]
    },
    {
        "Summary": "No resources are in Resource Discovery Tool for reading assignments ",
        "Issue key": "NGPROD-1357",
        "Description": "No resources appeared under the filters - please refer to the screenshots attached. Reproduced in all the courses",
        "comments": [
            "08/Jul/20 3:27 PM;jlu2;[~atyukavkin], I am wondering this issue is caused by the task that we have been working in sprint 101 at https://jira.XYZ.com/browse/NG-9996. Because I can re-produce in some products but not the others.\n\nFor instance, I can re-produce the issue at [https://learn.XYZPLUS.com/courses/51995] but not in this [https://learn.XYZPLUS.com/courses/52034.] ;;;",
            "08/Jul/20 3:34 PM;atyukavkin;[~okalitsev] Auto update RDT resources are planned for 101 release. At this moment we need to trigger it manually. Please let me know if I need to do it now and for which products.;;;",
            "08/Jul/20 3:41 PM;okalitsev;Thank you [~atyukavkin]. Just linked both tickets. I have no information on how critical this functionality for redesign launch. ;;;",
            "08/Jul/20 3:59 PM;jlu2;[~atyukavkin], we have 2 options, after talking to [~rvirginia] and [~rdannelly]\n\n1) Provide a patch to include known task: NG-9996 originally planned in release 101, and push to production.\n\n2) Manually fix the products that currently have problems. The list of products can be found at [https://XYZ-my.sharepoint.com/:x:/r/personal/rdannelly_XYZ_com/_layouts/15/guestaccess.aspx?e=fPXcg1&CID=2183CBF1-4025-422B-9D6A-DE1312B21001&wdLOR=c0F258647-80A7-49B9-960A-3B82C27D961E&share=Ef0ogO1rOVJDowPZ1d9HHFIBngcKCaRVGWiKeC5RQB562A] I do not know what products have issues. I am also not sure how much time for you to do the manual update.\n\nLet us know which option makes more sense to us.\n\nFYI [~dlederer], [~mmarler], [~osolovyo]\n\n ;;;",
            "08/Jul/20 4:22 PM;atyukavkin;If I have list of product Ids then I can automate 'manual' trigger. Even after patch release we will need to do manual trigger OR manually upload Master course one more time to trigger update.\n\nIf we deploy patch then we will need to do this manual part only for previously uploaded Master courses.;;;",
            "08/Jul/20 5:16 PM;jlu2;[~okalitsev], can you provide the list of product Ids to [~atyukavkin] so we can resolve the issue quickly without depending on the patch.;;;",
            "09/Jul/20 3:14 AM;okalitsev;[~jlu2], [~atyukavkin]. Sorry, what kind of list do you mean? The courses which are already in prod? Such a list doesn't make sense as it will be out of date in an hour as we continue uploading the courses.;;;",
            "09/Jul/20 3:16 AM;okalitsev;The only up to date list of courses along with their UUID is here *[https://learning.XYZ.com/abcadmin/index.html#/masterCourseList]*;;;",
            "10/Jul/20 6:41 AM;atyukavkin;If there is no objections I will update RDT resources every Friday until Sprint 101 go to PROD with auto update feature.\nThanks,\nAndrey T;;;",
            "10/Jul/20 7:15 AM;jlu2;I added the task at https://jira.XYZ.com/browse/NG-10288 in sprint 102 for support the above task.;;;",
            "10/Jul/20 11:38 AM;atyukavkin;101 Master courses have been updated as of Friday, July 7, 2020;;;",
            "10/Jul/20 2:32 PM;atyukavkin;The update has been reverted. Due to production issue NGPROD-1373.;;;",
            "23/Jul/20 2:59 PM;jlu2;[~okalitsev], the issue shall have been resolved in the release 101. Let me know if you any other issue.;;;",
            "24/Jul/20 4:59 AM;okalitsev;Hi Jenny,\n\nUnfortunately, we continue receiving numerious complains via e-mails and Jira about RDT still not working in any newly deployed course\n\nFor example, please refer to the snap2118.png attached here, it is from the https://learn.XYZPLUS.com/courses/53675/pages, but reproduced on other courses as well.;;;",
            "24/Jul/20 7:53 AM;jlu2;[~okalitsev], I just checked this course and RDT is loaded for me at :\n\n!image-2020-07-24-07-49-42-182.png|width=341,height=192!\n\n \n\nI am not so sure if you mixed another known issue with RDT: https://jira.XYZ.com/browse/LMS-11272.\n\nCould you please check the complains are from our internal users who open RDT and WPDC, CAP or CST in the same browsers?\n\nThank you!;;;",
            "24/Jul/20 8:35 AM;atyukavkin;Two products were missing in initial update RDT procedure:\n{code}'9f4a696b-6fc8-4549-837a-f669f19a6643',\n'1811d07f-41b2-40a9-98c5-b563260cd4a4'{code}\nCourses for these products are:\n{code}Sanderson, Real World Psychology, 2e - QA Reference\nSanderson, Real World Psychology, 2e - QA Reference\nSanderson, Real World Psychology, 2e - QA Reference\nOpenStax, Psychology - QA Reference\nOpenStax, Psychology - QA Reference\nSanderson, Real World Psychology, 2e - QA Reference\nSanderson, Real World Psychology, 2e - QA Reference{code}\n\nProducts were updated.\n\n[~okalitsev] Please let me know if you have any other examples of empty list of resources for RDT;;;",
            "27/Jul/20 6:41 AM;okalitsev;Hi Jenny,\n\nThis ticket is not about fixing subsequences in each particular course, this ticket is about fixing the reason, i.e. finalize RDT functionality not completed originally. New tickets appear every day and this process will continue while the reason of the issue remains unfixed.\n\nThe issue is: *Resource Assignment tool doesn't work in ANY new courses or returns old values in case of JSON update*\n\n \n\nExpected behavior:\n # RDT automatically starts working as soon as the course is deployed (without manual workarounds and extra post-deployment script run separately)\n # Any JSON updates in terms of media (resources added / deleted / modified) is automatically reflected in RDT filters;;;",
            "27/Jul/20 7:45 AM;atyukavkin;Hi Oleg,\n\nAs you know, automated update procedure for RDT resources related to old product json does not exist. It was true for new master json as well. At this moment, I cannot replicate your issue. Can you provide an example of that behavior so I can replicate and investigate?\n\n[~vsaranga], [~nmendis]\n\nThanks,\nAndrey T\n\n \n\n ;;;",
            "27/Jul/20 8:00 AM;okalitsev;Hi Andrey\n\nExample of what? As you are aware, RDT doesn't work in any new course deployed. Every time when we provide examples, you fix this particular course(s) only. This ticket is to fix the reason, i.e. make EDT working by default in ANY new course.\n\nOne of the latest examples is [https://learn.XYZPLUS.com/courses/53995]\n\nRegards,\n\nOleg;;;",
            "27/Jul/20 9:36 AM;atyukavkin;Hi Oleg,\n\nCan you explain what exactly is not working in this course? \n !PROD_RDT_07-27-2020.png|thumbnail! \nPlease note that RDT update is not happening in a second. You need to wait up to 5-10 minutes after Master course upload in Cinnamon Bread.\n\nThanks,\nAndrey T;;;",
            "27/Jul/20 11:08 AM;okalitsev;Hi Andrey,\n\nThank you, that's great news! Just to be absolutely sure, could you please confirm that\n # RDT appears in the course automatically in ~10 minutes after the course deployed\n # If say a number of resources changed, RDT is updated automatically as well?\n\nRegards,\n\nOleg;;;",
            "27/Jul/20 11:18 AM;atyukavkin;Hi Oleg,\nYes, I confirm. That was our intention. But I understand that there are could be bugs or issues. Please let me know if you notice RDT issues even after 10 minutes.\nThanks,\nAndrey T;;;",
            "27/Jul/20 5:14 PM;jlu2;[~okalitsev], I just sent you email for a proposed solution which might help to reduce this type of issues. Please let me know if there is anything that we can help to do better. Thank you.\n\nFYI [~dkukhtik], [~nakorobkin];;;",
            "28/Jul/20 7:56 AM;okalitsev;Closing the ticket as the issue is solved for new UX, and will be worked around in NWP courses. Content production team expects to have a possibility to run a special script over each NWP course in case of JSON deployment/update.;;;",
            "03/Aug/20 8:54 AM;jlu2;Thank you so much, [~okalitsev](y), for confirmation! ;;;"
        ]
    },
    {
        "Summary": "[NGAI] [F6] Exclude comma and semi colon from restricted characters- NG Admin ",
        "Issue key": "NG-4275",
        "Description": "This story is about excluding comma and semi colon from the restricted characters for the following:\n # Course section names\n # User first and last names\n\nAlert message should be also be modified to: 'Double-byte charset and Latin Extended-A symbols are not allowed'",
        "comments": [
            "02/Oct/18 8:33 AM;aryzhakov;Ready for spec workshop;;;",
            "03/Oct/18 6:05 AM;aryzhakov;Estimations: approximately 3 points;;;",
            "05/Oct/18 3:40 AM;aryzhakov;Ready for TA;;;",
            "19/Nov/18 8:03 AM;kmaslov;The end-to-end test in Dev environment performed.\nEverything work as expected according business rules and acceptance criteria.\n\nInterface components version :\n\nCinnamon Bread UI  1.62.1\n\n ;;;",
            "20/Nov/18 4:20 AM;anovikov;Testing complete on XYZPLUS-course-admin-ui v1.62.1;;;"
        ]
    },
    {
        "Summary": "NWP Instructor accidentally created a student Account",
        "Issue key": "NGPROD-1283",
        "Description": "NWP Instructor accidentally created a student Account, please have account removed or changed to instructor.\n\nKatherine Thomas kthomas@dom.edu\n\nStudent info:\nID:\n\n793463\nLogin name:\n\nkthomas@dom.edu\nXYZ Canvas user ID:\n\n605953\nLast login date:\n\n2020-05-13\nTerm of services accepted:\n\nYes\nTerms of service acceptance date:\n\n2020-05-13\nActivated:\n\nYes\n\n",
        "comments": [
            "28/May/20 6:26 AM;osolovyo;hi [~spetushins] - could you please move this operational request forward with Proton team?;;;",
            "28/May/20 10:46 AM;dstepkin;Hi [~lfavors] unfortunately we don't have an ability to remove user accounts since we have a dependency on CORE system. Also there is no way to change STUDENT role to INSTRUCTOR because of the same reason - CORE system.\n\nBut there is a workaround - add an additional INSTRUCTOR role.\nthere are at least 3 known ways on how to do so. and in any of these cases (if i remember correctly) you need to specify user Institution and Department (needed for CORE system):\n# create a course for that user using *Course Setup Tool*\n# enroll a user as an instructor to any course section using *Cinnamon Bread*\n# enroll a user as an instructor to any existing course section using *Instructor Admin Tool* (not a native XYZ Canvas, but IAT);;;",
            "23/Jun/20 12:22 PM;osolovyo;Hi [~lfavors] - do you have any updates on this?\nIf you are OK with the proposed workaround, then Proton developers could help with implementation.;;;",
            "25/Jun/20 6:07 PM;lfavors;@oleg, I have taken care of this issue . no additional assistance needed.\n\n;;;"
        ]
    },
    {
        "Summary": "Announcements - WAS - View Announcement",
        "Issue key": "LMS-7485",
        "Description": "As abc user I would like to have access to the system notification provided by XYZ team in the context of XYZ Assessment Service (WAS).\n\nThe functionality in the scope of this story:\n~ display announcements;\n~ minimize/maximize announcement panel;\n~ dismiss announcement.",
        "comments": [
            "12/Apr/19 9:14 AM;abondar;[~osolovyo] Based on the business request the WAS component story for Announcement Player is created.\nPlease review and let me know if any changes required.\n\nfyi [~rdannelly];;;",
            "21/May/19 7:42 AM;agomenyuk;Hi [~osolovyo], [~vganopa], [~mbobylkin]\n\ncould you please clarify if this panel should be displayed\n1) in the gradebook view of the assessment player,\n2) on the assessment discovery, question picker, etc pages\n3) on the assessment preview/tryout pages.\n\nThanks,\nAlexandra\n\nfyi [~rdannelly], [~snorman];;;",
            "21/May/19 7:49 AM;rdannelly;Hi [~agomenyuk], the panel should be displayed:\n # in the gradebook view of the assessment player\n # on the assessment preview/tryout page\n # on all WAS assignments (both instructor and student view)\n\nThe only place the panel should not be displayed is:\n # on the assessment discovery, question picker, etc pages\n\nPlease let me know if you have any additional questions.;;;",
            "22/May/19 9:32 AM;rmakarov;[~agomenyuk]\n\nReady in feature_KOR branch;;;",
            "31/May/19 4:52 AM;mgritsuk;Hi [~snorman] and [~julee.peterson],\nYou can see announcements on the QA environment in any assessments.\nCourse \"WAS Demo Course\": https://XYZ2.test.instructure.com/courses/15729\nInstructor: demo_qa@dispostable.com / XYZ123\nStudent: demo_qa_st@dispostable.com / XYZ123\n;;;",
            "02/Jun/19 2:48 PM;snorman;[~rdannelly] Please take a look and confirm this is Done. ;;;",
            "03/Jun/19 3:16 PM;rdannelly; The credentials are currently not working. [~snorman] is emailing the group so that we can get new credentials.;;;",
            "04/Jun/19 5:22 AM;daladinski;[~rdannelly] [~snorman]\nAuthentication mechanism got broken on QA yesterday (after deployment) and was restored only today. Login to Onboarding and Cinnamon Bread didn't work. Credentials work now.;;;",
            "04/Jun/19 11:01 AM;rdannelly;Thank you for your help.  [~snorman], [~daladinski] , and [~mgritsuk], I was able to successfully UAT for the student account. The announcements look great there–we are good to proceed.  However, I could not find any assignment in the instructor account with an active announcement. Can you please direct me to an announcement in the instructor account? Thank you!;;;",
            "04/Jun/19 11:21 AM;mgritsuk;[~rdannelly], someone dismissed instructor announcements on this account but I added new 3 announcements for instructor and you can see it on QA using instructor account. Now announcements must be in each assignments related to \"WAS Demo Course\".\nCourse \"WAS Demo Course\": https://XYZ2.test.instructure.com/courses/15729\nInstructor: demo_qa@dispostable.com / XYZ123;;;",
            "04/Jun/19 3:28 PM;rdannelly;Thank you [~mgritsuk]. I've completed my UAT testing on this story.  Thank you for everyone's work on this story! ;;;",
            "04/Jun/19 6:16 PM;jpeterson;UX and UI look good as well. Thank you! ;;;"
        ]
    },
    {
        "Summary": "Canvas to Engage User Data Migration",
        "Issue key": "EB-229",
        "Description": "As a XYZNXT user in Engage, I need user data migrated over from the previous Canvas instance. I need grades, enrollments and activity grades.\n\nNXT has provided us with .csv files that contain grade exports for courses that have previously run on Canvas. We need to import these into Engage so that there are gradebook records for these student accounts in courses that will not be used for teaching but rather specifically for record keeping.",
        "comments": [
            "20/Jan/21 7:49 AM;cmisbach;Questions:\n * Will students listed in CSV files need access to the Engage portal, or is this just for XYZNXT admins?\n * Will any of the students listed ever take future courses in the Engage portal?\n * Are there going to be instances where grade items exist in the CSV files that no longer exist in the course backups that we are migrating into Engage?;;;",
            "20/Jan/21 7:53 AM;cmisbach;[https://www.umass.edu/it/support/moodle/import-student-data-moodle-gradebook]\n\nhttps://docs.moodle.org/310/en/Grade_import;;;",
            "20/Jan/21 3:42 PM;cmisbach;Here are examples XYZNXT provided us\n\nhttps://XYZ-my.sharepoint.com/:f:/p/cmisbach/EvJzwffPPNZFuL1hTfDnx2UB_Ac5BgDGHQKB3haZyA7WiA?e=HaGwlm;;;",
            "21/Jan/21 7:35 AM;cmisbach;* Will students listed in CSV files need access to the Engage portal, or is this just for XYZNXT admins?\n\nComment: No need to give access of engage platform as they have already completed their course. This would be majorly for admin purpose for analysis and reporting.\n * Will any of the students listed ever take future courses in the Engage portal?\n\nComment : May be as we are retargeting users to buy other courses .\n * Are there going to be instances where grade items exist in the CSV files that no longer exist in the course backups that we are migrating into Engage?\n\nComment : No, we need gradebook data of those courses which is available on canvas and after engage live we will enroll students on new platform .;;;",
            "22/Jan/21 12:45 AM;jbandara;[~cmisbach] [~ssiriwarda]  can we get a backup of these users in the csvs? without these users in the system, its not possible to import the grades. ;;;",
            "22/Jan/21 9:26 AM;cmisbach;[~jbandara] we may need to be creative with this problem.\n\nI checked with someone doing the content migration, and you cannot export users from Canvas for import into Moodle in any way other than CSV.\n\nHowever, you can import users and enroll them into a course via csv: [https://docs.moodle.org/38/en/Upload_users]\n\nWe need to provide them instructions on how to do this (both import the users into the portal/destination course via the Bulk Upload and then import the grades for those users) without sending out emails to those new accounts prompting them to log in.\n\nI'll confirm the number of courses they need to do this with.;;;",
            "25/Jan/21 12:36 AM;jbandara;ok [~cmisbach] i will have a look;;;",
            "25/Jan/21 7:11 AM;jbandara;[~cmisbach] don't we still need these user accounts in the system? the files you have shared only contain the grades of these students.\n\nFindings so far.\n * When uploading users it will send an email to each user notifying them to log into the system. we can avoid this email if we add the password as a column to the CSV file itself. \n * Then we need to remove the first row from the exported CSV file from the canvas. moodle looks for a student in each row. the existing first row contains the maximum marks. we don't need that I guess.\n * Then we need to map a unique column from both sides. i.e the CSV and moodle. In this case, it was SIS login ID from CSV and the email address from moodle.\n\n\n\nI am not sure this information helps or not. let me know if you have to add something to this.;;;",
            "27/Jan/21 12:22 PM;cmisbach;We'll use these findings to educate NXT on the process. Closing this out and will create other cards is other work is asked of us.;;;"
        ]
    },
    {
        "Summary": "(E4) - Canvas - Registration: Unexpected system error: WPE4_PROVISION_006",
        "Issue key": "NGPROD-1192",
        "Description": "*SFDC# 05627151*\n\n \n\nStudent is attempting to register for course WPE4 / Canvas integration.\n\nWhen clicking a link, she has been prompted to register, and gets error #1 below.\n\nWhen trying again, she gets error #2 below.\n\n \n\n*Multiple errors;*\n # Registration for this XYZPLUS course failed.\n ** Please provide your account number for faster service. Account#.0100662890000\n # Sorry!\n ** Unexpected system error. Try again or contact XYZPLUS Technical Support if needed.\n *** Exception Details\n **** WPE4_PROVISION_006\n **** 2020-04-14 13:52:27 -0400\n\n \n|usr9806612|[Amali, Mary|https://edugen.XYZPLUS.com/edugen/admin/users/user_edit.uni?id=usr9806612&list=users]|[bf03d51f78c67951d6f03f7e0d3e2522f9b8d6d5@CANVAS.sMYXcqDRxM|mailto:bf03d51f78c67951d6f03f7e0d3e2522f9b8d6d5@CANVAS.sMYXcqDRxM]|bf03d51f  |  |\n\n \n|*Lock, Statistics: Unlocking the Power of Data, 2e*|\n|*Student Login:*|[www.XYZPLUS.com/class/762389|https://edugen.XYZPLUS.com/edugen/class/cls762389]  (Domain Login)|\n|*Master Course:*|CANVAS: CHANDLER GILBERT COM COL: Lock, Statistics: Unlocking the Power of Data, 2e|\n|*Instructor:*|Darren Marston ([Search Instructor|https://edugen.XYZPLUS.com/edugen/admin/users/users_list.uni?userlist=browse&searchmode=users&search=Darren+Marston&regtype=all&course=all&domain=all&Query=Do+Query])|\n|*Class/Section:*|MAT206 18663:CG 2020 SPRING-MAT206 18663|\n\n[~sflanigan] applied rollback code to user account. However, the second error listed above continued to display.\n\n ",
        "comments": [
            "16/Apr/20 8:55 AM;rdannelly;Hi [~mshirley], we have redirected the WPe4 team to work on a critical project for NWP's backend Cinnamon Bread tool for the next several months. Due to this reallocation of the team's resources, we're not able to take on WPe4 tickets right now unless the tickets are deemed absolutely critical blocker issues by [~lfavors], as any WPe4 tickets we take on will decrease the amount of the Cinnamon Bread project that the team will be able to complete. \n\nI'm going to assign this ticket to [~lfavors] for the assessment of criticality, and I'll move it in the WPe4 team's product backlog for now with the understanding that this isn't something they are going to be focusing on.;;;",
            "16/Apr/20 9:11 AM;sflanigan;[~rdannelly] This issue needs to be addressed. This is preventing a student from accessing XYZPLUS. This must be treated as critical.;;;",
            "16/Apr/20 10:05 AM;rdannelly;Hi [~vsundaramu] and [~atyukavkin], is this something that you two can take a look at?  According to [~lfavors], this may not require the WPe4 team to investigate and fix.;;;",
            "16/Apr/20 10:30 AM;sflanigan;[~dlederer] FYI;;;",
            "16/Apr/20 10:50 AM;atyukavkin;Hi [~rdannelly], the issue looks the same as SSM-3447 \n{code}\nCaused by: java.rmi.RemoteException: Invocation failed; nested exception is: javax.ejb.EJBException: Can't update student: ORA-00001: unique constraint (UNI.UNI_STUDENT_INDX) \n{code}\nNeed more investigation from XYZPLUS E4 code perspective. Do you want me to work on it?\nThanks,\nAndrey T\n\n[~smorozov] [~jlu2];;;",
            "16/Apr/20 10:54 AM;rdannelly;Hi [~atyukavkin], if you have the capacity to take a look at it right now, I would greatly appreciated it. I'm trying to keep the WPe4 team focused on transitioning over to the CAP project. Thank you!\n\nFYI [~sflanigan], [~lfavors], [~jlu2] and [~smorozov];;;",
            "19/Apr/20 6:23 PM;domelchenk;This is consequence of a known glitch in WPE4 that happens rarely (1–2 occurrences per semester). Namely the glitch is represented in the database by duplicated rows with identical (iduser, iddomain) combination in UNI_STUDENT table.\nThis was addressed by manually deleting the duplicated record from UNI_STUDENT table (row with id = 11252953).;;;",
            "19/Apr/20 6:25 PM;domelchenk;Hi [~mshirley], could you please verify whether this error is now resolved. Thanks;;;",
            "20/Apr/20 12:17 PM;mshirley;[~domelchenk] reaching out to the student now. Will follow up with you when the student responds.\n;;;",
            "23/Apr/20 11:33 AM;mshirley;[~domelchenk] ticket can be closed. Student failed to respond. Student has progress on all assignments currently available / past due;;;"
        ]
    },
    {
        "Summary": "CST: Rename Accounting Combo courses - Urgent",
        "Issue key": "PROD-179902",
        "Description": "",
        "comments": [
            "30/Aug/23 11:44 AM;nrepasky;Hi [~CDO_Content]:\n\nWe have an extremely urgent request to rename the Combo courses in the CST, to differentiate the titles from the parent courses. Instructors are selecting the incorrect courses causing pricing issues.\n\nWould it be possible to prioritize this request for delivery as soon as possible?\n\nOld (incorrect) name:\n * Farmer Cost Accounting 1e with Data and Analytics in Accounting\n * Savage Accounting Information Systems 1e with Data and Analytics in Accounting\n * Johnson Auditing 2e with Data and Analytics in Accounting\n * Kieso Intermediate Accounting 18e with Data and Analytics in Accounting\n * Johnson, Auditing, A Practical Approach with Data Analytics 2e - You Got This\n\nNew (correct) name:\n * Combo Course: Farmer, Cost Accounting 1e +  Dzuranin, Data and Analytics in Accounting 1e\n * Combo Course: Savage, AIS 1e +  Dzuranin, Data and Analytics in Accounting 1e\n * Combo Course: Johnson, Auditing 2e +  Dzuranin, Data and Analytics in Accounting 1e\n * Combo Course: Kieso, Intermediate Accounting 18e + Dzuranin, Data and Analytics in Accounting 1e\n * Combo Course: Johnson, Auditing 2e + Loos, You Got This!\n\nRequested date: 8/30-8/31\n\nThank you!;;;",
            "30/Aug/23 2:10 PM;okalitsev;Hi Nicole,\n\nThe point is that the name of the course visible in CST is set in the Cinnamon Bread (CAP) and it doesn't depend on the name of the product in WPDC or package. In view of this, update urgency, and the fact that these courses are under content updates now, I just renamed them directly in QAP as shown in the snap2477.png screenshot attached. \n\nRegards,\n\nOleg;;;",
            "30/Aug/23 2:41 PM;nrepasky;Thank you, [~okalitsev]! Would you be able to rename the Combo Business courses as well? This should be the complete list - no further titles will need to be updated.\n\nThe EPROF ISBNs should be left in the title for each.\n\nOld:\n\nBajtelsmit, Personal Finance, 2e - You Got This!\n\nBoone, Contemporary Business 19e - You Got This!\n\nBoone, Contemporary Business 4CE - You Got This!\n\nBoone, Contemporary Business 3CE  - You Got This!\n\nGrable, Introduction to Personal Finance, 2e - You Got This!\n\nSchermerhorn, Exploring Management 7e - You Got This!\n\nSchermerhorn, Management 15e - You Got This!\n\nSchermerhorn, Management, 5CE - You Got This!\n\nLoos, You Got This! 1e\n\n \n\n \n\nNew:\n\nCombo Course: Bajtelsmit, Personal Finance 2e + Loos, You Got This! 1e\n\nCombo Course: Boone, Contemporary Business 19e + Loos, You Got This! 1e\n\nCombo Course: Boone, Contemporary Business 4ce + Loos, You Got This! 1e\n\nCombo Course: Boone, Contemporary Business 3ce + Loos, You Got This! 1e\n\nCombo Course: Grable, Personal Finance 2e + Loos, You Got This! 1e\n\nCombo Course: Schermerhorn, Exploring Management 7e + Loos, You Got This! 1e\n\nCombo Course: Schermerhorn, Management 15e + Loos, You Got This! 1e\n\nCombo Course: Schermerhorn, Management, 5CE + Loos, You Got This! 1e\n\nCombo Course: Loos, You Got This! 1e\n\n \n\nThank you!\n\nNicole;;;",
            "31/Aug/23 9:00 AM;olyakimovi;Hi [~nrepasky],\n\nAll requested courses have been renamed in the CST in the same way as Oleg described earlier.\nI've found one more \"You Got This\" course:\n* Maginnis, Advice for a Successful Career in the Accounting Profession, 1e - You Got This\n\nShould it be also renamed in the same way?\n\nThank you,\nOlga;;;",
            "01/Sep/23 3:05 PM;nrepasky;Hi [~olyakimovi]:\n\nThank you for checking on this. Yes, please also rename Maginnis.\n\nThank you!;;;",
            "01/Sep/23 5:09 PM;olyakimovi;Hi Nicole,\n\nThis course has been renamed.\n\nRegards,\nOlga;;;",
            "07/Sep/23 1:56 PM;nrepasky;Thank you! I will close this ticket.;;;"
        ]
    },
    {
        "Summary": "Registration Loop: Student repeatedly prompted for code",
        "Issue key": "NGPROD-3045",
        "Description": "Student is unable to access any XYZPLUS material. The student purchased access but is still prompted to enter a reg code. The student was provided a new code but the issue persists.\n\nUser profile ID: 2526930\nFirst name: El Mahdi\nLast name: Igoud\nUser email: elm2112973@maricopa.edu\n\nProduct ID: bdbc7f2d-fd5b-47bd-a6ae-43efec2a2a7f\n\nExternal course ID: 43299\nIntegration Code: bf5432eb-6c3f-4361-91d0-f752265e8a80\nInstitution:\nInstitution name: CHANDLER GILBERT COM COL\nFICE: A02940201\nProduct:\nProduct name: Lock, Statistics, 3e\nProduct UUID: bdbc7f2d-fd5b-47bd-a6ae-43efec2a2a7f\nProduct ISBN: EPROF20500",
        "comments": [
            "24/Aug/22 8:42 AM;osolovyo;[~smorozov]  - can Protardis team take this task?\n\n ;;;",
            "25/Aug/22 8:20 AM;smorozov;[~sflanigan], for the moment I have not found any errors in the XYZPLUS logs that could explain the reason of the wrong behaviour.\n\n\nHowever, the three RegCode licenses that displayed in Cinnamon Bread (CAP) for this student have start and end date equal. This seems abnormal. The license details seem updated in CAP UI by you. Normally, there should be 1 year difference between license start and end date. Could you fix this?;;;",
            "25/Aug/22 8:45 AM;sflanigan;[~smorozov]  The additional reg codes were all provided by support after the fact trying to address the issue. I expired them manually to see if that would correct the issue. From what I saw in cap it look like the issue was resolved at that point but the student indicated they were still being prompted for a code. ;;;",
            "25/Aug/22 10:08 AM;smorozov;[~sflanigan] I see multiple students enrolled in the same course section together with the user [elm2112973@maricopa.edu.|mailto:elm2112973@maricopa.edu.] If no one else from this course section has no such problem, then something may happen on the client side for this user. If it is possible, the recording of the user steps related to launching XYZPLUS links may some how help us in the investigation.;;;",
            "26/Aug/22 8:52 AM;sflanigan;[~smorozov] I attached a screen recording. ;;;",
            "01/Sep/22 3:46 AM;smorozov;[~sflanigan] we still have not found the root cause of wrong behaviour. However, while checking LTI requests data captured in abc database, we noticed unusual pattern of the Course Resources launches that user performed on August 22. Two LTI requests came to abc at the same second. This happened two times, at 06:30:46 and at 06:30:48, UTC. Please see it in the attached screenshot of database view.\n\nCould you contact the user regarding possible reasons of such frequency?;;;",
            "07/Sep/22 4:58 AM;smorozov;[~sflanigan], I have verified the license check API response for this student and did not notice something wrong that could prevent accessing XYZPLUS content.\n\nAt the same time, I see several requests done by this student this week to launch XYZPLUS assessments. Could you ask student to confirm if the issue still persists or not?;;;",
            "07/Sep/22 7:18 AM;sflanigan;I reached out the student a week ago and have not received a reply. I think at this point we can close the ticket.;;;"
        ]
    },
    {
        "Summary": "Sad Man Shows Up When Opening Assignments ",
        "Issue key": "NGPROD-2752",
        "Description": "Multiple reports of sad man affecting internal stakeholders when they are attempting to demo in NWP.  CSM shared that they hear about this bug from students daily. \n\n \n\n*Report 1:*\n\nI was recently involved in a presentation for Sanderson: Real World Psychology with DLE Shannon Gillen, and RM Maria Guarascio.   My portion of the presentation was to present the Adaptive Assignments in the Sanderson course. \n\nWhile preparing for this presentation, I had the WP Sad Man show up a few times.  I checked in with my colleague, Rachel Coffey, who advised that is was a ‘clear cache’ issue, and that by doing clearing my cache, that should resolve it. It did, and I followed her recommendation to consistently clear my cache, and also close and open up WP.   I was especially mindful to do this right before the presentation.\n\nFor the presentation, because I had a very short amount of time, I’d created a Demo Assignment and started from there, and went into Edit Assignment to show how you would create an assignment, the points, the intention and the trading policies etc. I hit Save, and then clicked on (WAS) Student view because my next step was to go into the assignment.  When I did this, I got the WP Sad Man.  When I clicked on the TRY AGAIN button, it still not work.  I was in Chrome. \n\n \n\n*Report 2:*\n\nI’m getting sad man on all the AA I’ve tried in these courses:\n * Kimmel, Accounting, 7e: [https://learn.XYZPLUS.com/courses/97713]\n * Here’s the assignment for Chapter 1: [https://learn.XYZPLUS.com/courses/97713/assignments/8949822?module_item_id=24888272]\n\n * Kieso, Intermediate Accounting, 12e Canadian, Volume 1: [https://learn.XYZPLUS.com/courses/97295]\n * Chapter 1: [https://learn.XYZPLUS.com/courses/97295/assignments/8928600?module_item_id=24826796]\n\n \n\nI’m using Chrome (Version 97.0.4692.71) and have cleared my cache/cookies.",
        "comments": [
            "01/Feb/22 9:00 AM;snorman;Recreation Information with Rachel Coffey:\n\n[https://was.api.XYZ.com/was/ga/v1/assignment-settings/master-assessment/de0f8f62-cb3d-4a1c-8814-4f23939b1ceb/context/2e60cbe071128dcfa4665ce00851697eb4ffa3b1/resource/0cef7611d0d37470aad902818f03051d6bdcb1e0]\n\n \n\n[https://learn.XYZPLUS.com/courses/52373/assignments/7062930];;;",
            "01/Feb/22 9:01 AM;snorman;Recreation Information with Carolyn Wells:\n # [https://learning.XYZ.com/abc/api/v2/sections/findByCourseKey]\n # {courseType: \"XYZ\", courseKey: \"7dd035e9-2ff9-4020-918c-88b561824aae\"}\n ## courseKey: \"7dd035e9-2ff9-4020-918c-88b561824aae\"\n ## courseType: \"XYZ\"\n # [https://learn.XYZPLUS.com/courses/91722/assignments/9236234];;;",
            "01/Feb/22 9:05 AM;osolovyo;Video recording of issue recreation - https://XYZ-my.sharepoint.com/:v:/p/snorman/EX_JlK7MqqtPmo_K9GRhB4wBkJzkTTBIMf_0TgIlDgWNDw;;;",
            "01/Feb/22 12:58 PM;osolovyo;[~daladinski] [~vkarpunin] [~edmelkoyev] [~msyrgiy] [~aldubolazo] - could you please take a look and move forward?\n\nNote: the issue is pretty sensitive because it looks like re-incarnation of NGPROD-2504 (was fixed during Bug Blasting).;;;",
            "10/Feb/22 12:35 PM;dlederer;We have had multiple technical discussions on this. The specific use case that was demonstrated in the attached video has a root cause whereby the wily.com cookie is overloaded. This specific Sad Man occurrence is something that external customers would almost never see but is VERY common for internal customers and can easily be replicated especially if the user is also using CAP. \n\nThe IAM (Identity and Access Management) team at XYZ is exploring the possibility of increasing the XYZ.com cookie header size which would solve this particular issue and would significantly cut down on people having to clear cache and cookies to get WAS to load.\n\nNext step is with [~jesposito] to work with Cloudflare to see if this is possible. ;;;",
            "11/Feb/22 9:24 AM;dlederer;Request is with Cloudflare support to make the change. [~jesposito] will provide update once he hears back from the CF support team. ;;;",
            "17/Feb/22 10:33 AM;dlederer;I spoke with [~jesposito] yesterday. The XYZ cookie header limit is already set to 16K but we seem to be hitting a Cloudflare limit of 32K (NOT XYZ-specific). This is a CF change that is not easily changed. Next step is for John to reply to email thread with findings. Best approach would then be to fix the XYZ cookie header bloat by changing how XYZ Azure integration handles checking groups (i.e. instead of storing all memberships in the cookie/JWT, would need API to check against). ;;;",
            "24/Feb/22 8:43 AM;dlederer;After further investigation, CF settings should allow this large cookie header and that it is the AWS settings for S3 (where the UI app is hosted) that is truncating the cookie header leading to the issue.  According to our Cloud Architecture team there does not seem to be a way to increase the cookie header setting for S3 buckets in AWS. In order to address this, we will look to reduce the size of the cookie being passed to NWP from Azure. NWP team is meeting with the XYZ IAM/Azure team on 24-FEB to discuss next steps to see what they can do to mitigate. \n\nThanks.\n\nDavid \n\n ;;;",
            "24/Feb/22 11:22 AM;dlederer;Met with [~tzarb], [~nrajput] , [~anghosh] - they will make a change on their side to only pass the AD groups needed for NWP applications as documented here [https://confluence.XYZ.com/display/abcEN/HOWTO%3A+Gpostet+Accebss+to+NWP+tools+%28CAP%2C+CST%2C+WPDC%29+through+Azure+AD]\n\nPlan is to make the change in XYZqa so that we can test out in non-prod. This activity is planned for Friday 25-FEB and will be validated by [~smorozov]  and [~atyukavkin]. They will confirm that all works as expected and that the cookie size has in fact been reduced. Assuming we get this working, we can then discuss timeline and process of propagating to PROD - FYI [~osolovyo] \n\n ;;;",
            "25/Feb/22 3:05 AM;nrajput;Hi [~dlederer] [~smorozov],\n\nWe have now changed the following 11 XYZ Plus Non-PROD Applications in Azure AD QA to {+}include only the application assigned groups of which the user is a member, instead of all the groups the user is a member of{+}.\n\nI have tested the id token before and after changes for my user account with one of the below apps, “abc Admin Tool Dev”. Attached here are the snapshots of the decoded id tokens for your reference which show the difference in group claims. Kindly validate from your side & let us know in case of any queries. Thank you.\n\n \n\nabc Admin Tool Dev                 :              f7e942e1-143e-4e44-b9bb-805b524819c6\n\nabc Admin Tool QA                   :              a74a8f92-4f1b-47fb-8017-f6bd2925db53\n\nabc Admin Tool Perf                 :              7a5c7de0-b2e1-4f45-ae83-69af47fe9e6d\n\nabc Admin Tool Staging           :              2d0a972a-96a3-4ff9-9536-1cadd4fdda90\n\nCourse Setup Tool Dev                  :              5b8392e9-1094-4b2c-884a-07e9a8c02d3c\n\nCourse Setup Tool QA                    :              2e4054f6-4703-4ebb-b3e6-8b92b778a96e\n\nCourse Setup Tool PERF                :              f8789829-562b-493f-b403-d7d4ed1c31a0\n\nCourse Setup Tool STG                  :              d7702f40-5574-4b30-aca3-be77e5b0ef6e\n\nXYZ Plus Delivery Cache QA      :              67e6f44a-e8ce-4533-97ff-d387689b7aad\n\nXYZ Plus Delivery Cache Perf    :              20f21b94-464e-452c-9b17-7c04e89c299d\n\nXYZ Plus Delivery Cache Stag   :              76f0abc0-9ea4-481a-8185-fc05ffa8fb51\n\n \n\ncc : [~tzarb] [~anghosh]  [~tlim];;;",
            "25/Feb/22 8:32 AM;nrajput;Hi [~smorozov], We have connected & while testing found that the “Course Setup Tool” applications were initially configured to +not+ expect any group claims in the token. So, we have reverted the state for Course Setup Tool apps to the previous wherein no group claims are present in the id tokens.\n\nAll the above-mentioned XYZ Plus non-prod app access is working as expected now. So, going into production we would need this change only for the “abc Admin Tool” & “XYZ Plus Delivery Cache” PROD apps. Please confirm OR add/update in case required. Thank you.\n\ncc : [~tzarb] [~anghosh] [~tlim] ;;;",
            "25/Feb/22 8:39 AM;dlederer;Thank you [~nrajput] . Assigning the ticket to [~smorozov] .\n\nMeantime [~atyukavkin] can you comment  on the size of the cookie now? Before it was almost 4K, I am glad that functionally it is all working I would also like confirmation that the cookie size has been reduced.;;;",
            "25/Feb/22 8:51 AM;atyukavkin;Cookie size in my case now is 1k. [~domelchenk] Can you please check your Cookie size for DEV/QA environment?;;;",
            "28/Feb/22 5:42 AM;domelchenk;It appears my XYZqa account is not assigned to either of XYZPLUS related applications on DEV/QA.\n[~smorozov], could you please check the size of NG_O_IT cookie set on learning-qa.XYZ.com domain after you open abc CAP application e.g. on QA. Thanks;;;",
            "28/Feb/22 7:10 AM;smorozov;Hi [~nrajput], I have checked the current logic in abc SSO service and can confirm that “XYZ Plus Delivery Cache” also does not not expect any group claims in the token, so you need to do this change for the “abc Admin Tool” app only.\n;;;",
            "01/Mar/22 2:00 AM;smorozov;[~domelchenk], I have checked the  _NG_O_IT cookie size after opening abc CAP app in QA - it is 1K.;;;",
            "01/Mar/22 8:07 AM;dlederer;[~smorozov] - what is next step here. Can we make this change in PROD? \n\nFYI - [~osolovyo], [~atyukavkin]  ;;;",
            "03/Mar/22 8:54 AM;smorozov;[~dlederer], I think we can make this change in PROD.\n\nFYI - [~osolovyo], [~atyukavkin];;;",
            "03/Mar/22 8:57 AM;dlederer;[~nrajput] - please let us know via the ticket when would be a good time for your team to make the change in PROD and specifically let [~osolovyo] know. \n\nThank you!\n\nDavid;;;",
            "03/Mar/22 9:27 AM;nrajput;Thank you for the update [~smorozov] & [~domelchenk]. We will make the changes only in the \"abc Admin Tool\" in the Production.\n\nHi [~dlederer], We can do the Production changes at the best suitable time (Starting from tomorrow) preferred by the XYZ Plus team. Please let us know when should we do it. Thanks.\n\ncc: [~tzarb] [~anghosh] [~tlim] ;;;",
            "03/Mar/22 9:41 AM;dlederer;[~osolovyo] can we get this scheduled for 6:00 AM EST on Friday March 4th? ;;;",
            "03/Mar/22 9:54 AM;osolovyo;Production Release of Hot Fix for NGPROD-2752 is scheduled on 4-MAR-2022 at 6 am EST\nsee [https://confluence.XYZ.com/display/abcEN/Releahhse+2.20] \n\n[~nrajput] - the change can be done in the scope of [CHG0064463|https://XYZ.service-now.com/nav_to.do?uri=%2Fchange_request.do%3Fsys_id%3D96a7e54d1bd5895060880f65624bcb8a%26sysparm_stack%3D%26sysparm_view%3D]\nplease go ahead and let us know when it is ready for verification.;;;",
            "04/Mar/22 2:57 AM;nrajput;Thank you [~dlederer] & [~osolovyo] for the details.\n\nI will make this change in the Production \"abc Admin Tool\" application on 4-MAR-2022 at 6 am EST & confirm back once done.;;;",
            "04/Mar/22 6:06 AM;osolovyo;The change was done in the Production \"abc Admin Tool\" application by Narendra Rajput on 4-MAR-2022 at 6 am EST\n\nReady for Verification;;;",
            "04/Mar/22 8:59 AM;nrajput;Hi [~osolovyo] [~dlederer], Thank you. Yes, the change has been done. Please let us know if you have any further queries.\n\ncc: [~tzarb] [~tlim] [~anghosh] ;;;",
            "04/Mar/22 11:28 AM;osolovyo;I  checked the fix for https://jira.XYZ.com/browse/NGPROD-2752 with the following scenario:\n\nopen Cinnamon Bread [https://learning.XYZ.com/abcadmin/index.html] \n\nopen Course Setup Tool in the same browser window [https://learning.XYZ.com/abccst/index.html] \n\nopen Delivery Cache in the same browser window [https://learning.XYZ.com/admin/index.html] \n\nlog in WP as Instructor, e.g. [https://learn.XYZPLUS.com/courses/96394]\n\nopen any existing assignment, e.g. [https://learn.XYZPLUS.com/courses/96394/assignments/8899845]\n\ngot 4xx error with SadMan\n\n!image-2022-03-04-19-26-59-377.png|thumbnail!;;;",
            "04/Mar/22 11:35 AM;osolovyo;Screenshot with cookie size:\n!image-2022-03-04-19-35-34-123.png|thumbnail!;;;",
            "04/Mar/22 11:48 AM;osolovyo;Started working after deletion some cookies:\n!image-2022-03-04-19-48-38-827.png|thumbnail!;;;",
            "04/Mar/22 11:50 AM;osolovyo;The fix is working fine for the case CAP + NWP in one browser.\nBut we still observe the issue in case CAP + CST + DC + NWP in one browser window.\n\nRe-opening the issue.;;;",
            "04/Mar/22 11:51 AM;osolovyo;[~atyukavkin]  [~domelchenk] [~aldubolazo]  - could you please take a look at sanity testing results and proceed with designing the solution for fix?;;;",
            "15/Mar/22 9:24 AM;dlederer;As the use case for this ticket (working with/demoing WAS in one tab and having CAP open in another tab) seems to have been mitigated, I am curious to hear from [~racoffey] or anyone else if there is a difference - are you getting Sad Man less often when working with WAS? This will help determine urgency of addressing other cases where [~osolovyo] mentioned we continue to see issues. ;;;",
            "17/Mar/22 5:40 AM;osolovyo;Moving to READY FOR VERIFICATION\n\n[~racoffey]  [~cjwells]  - could you please verify?;;;",
            "18/Mar/22 10:01 AM;domelchenk;For me it is now possible to work with CAP and WAS tools in parallel in different tabs in the same browser. The size of _NG_O_IT cookie got reduced –\n !screenshot-1.png|thumbnail! \nThis was verified on PROD;;;",
            "18/Mar/22 10:03 AM;domelchenk;CAP + WPDC + CST + WAS combination also works Ok for me;;;",
            "31/Mar/22 4:06 AM;osolovyo;Moving to DONE since the ticket has been in READY FOR VERIFICATION more than 5 days;;;",
            "31/Mar/22 11:29 AM;racoffey;[~osolovyo] [~dlederer]  My apologies for the delay, I didn't see the notifications. I have not had any issues with Sad Man appearing, I've tried CAP + abc repeatedly with no issue. I have only been able to replicate after having 8+ abc courses with assignments open throughout the day without clearing cache but I expect that behaviour is very rare and don't expect it to happen often. From my perspective, I would say this is resolved however  [~cjwells] mentioned she had an issue earlier today and did not have multiple courses open. ;;;"
        ]
    },
    {
        "Summary": "[NGIAT] Instructor Admin Tool – Add Teacher Action – Adding Existing Instructor",
        "Issue key": "NG-4515",
        "Description": "As a XYZPLUS Standalone Canvas teacher using the IAT to add a teacher to my course\nI want to ensure that the existing WP instructor could be enrolled\nSo that I can enroll him correctly as a teacher into the respective course section",
        "comments": [
            "13/Feb/19 9:58 AM;abondar;[~rdannelly], \nPlease review the current version of the story including wireframes, ACs and BRs.\nLet me know if any questions/comments/changes from your side.\n\nfyi, [~ewinklem]\n\n_Note: There is a couple of dependent stories (NG-4518 and NG-4519) will use the current approach as a basis._;;;",
            "13/Feb/19 10:44 AM;ewinklem;Hi [~abondar],\n\nOne piece of feedback to consider. Although we use \"Instructor\" in the Cinnamon Bread, the native Canvas People page (which instructors will still be able to view) uses \"Teacher,\" as this role. \n\nI think we should consider mirroring that for the IAT.\n\nEd;;;",
            "13/Feb/19 10:48 AM;rdannelly;[~ewinklem], excellent point.  We'll want to make sure that all of the stories in the User Admin tab reflect 'Teacher' instead of 'Instructor,  [~abondar], can you please update the wording in the stories, including the existing wording in NG-4560 that the team is working on during sprint 68? Thank you!;;;",
            "13/Feb/19 11:07 AM;abondar;[~rdannelly], [~ewinklem]\nTechnically it is not a problem to use \"Teacher\" terminology instead of \"Instructor\" in the scope of IAT.\nBut I would like to double check the request.\n\"Instructor\" term is used in WP for a long time. The term is used across all internal and related components:\n~ XYZ.com\n~ XYZPLUS.com\n~ ProfVal\n~ WAS\n~ E4\n~ NG CST\n~ NG CAP\n~ NG email notifications\n~ NG Onboarding (including dashboard)\netc.\n\"Instructor\" term is used across almost all our documentation.\n\nSo it is not a problem to use another label for \"Instructor\" role in the scope of IAT (and rename the tool to \"TAT\" :)).\nBut could you please double check and confirm as consolidated feedback from the business side.;;;",
            "13/Feb/19 11:09 AM;rdannelly;Hi [~abondar], the updated wireframes look great! I only have one additional change to call out to go along to with Ed's above change.  On the screen in which a user is adding an instructor, can we change the wording from \"Please enter the email address of the person you'd like to add to the course.\" to \"Please enter the email address of the person you would like to add to the course.\"  We'll need to make sure to update that wording for the other used cases for adding instructors, as well.  \n\n!image-2019-02-13-11-07-13-386.png!\n\nOther than that, the wireframes, ACs, and BRs, look good to go! Thank you!;;;",
            "13/Feb/19 11:11 AM;rdannelly;Hi [~abondar], thank you for double checking. We should indeed make the change from \"instructor\" to \"teacher\".  The reason being is that instructors are able to go to the Canvas Peoples section and review the list of users in the the course. From within that view, the instructors are listed as \"teachers\".  We don't want to introduce any confusion/inconsistencies for the user experience, which is why we should use \"teacher\".   Within CAP, we call instructors \"instructors\", which is perfectly okay. We just need to conform to the existing Canvas approach for the IAT. Thank you!;;;",
            "14/Feb/19 2:07 AM;abondar;Update: \"Teacher\" label should be used for instructor role in the context of IAT.;;;",
            "14/Feb/19 8:13 AM;abondar;[~rdannelly]\nPlease review the scope one more time. Significant changes for text wording (Instructor/Teacher) and behavior of \"Sections\" selector on step 1 of the wizard.\n\nLet me know if any changes required.\n\nfyi. [~ewinklem];;;",
            "14/Feb/19 9:40 AM;rdannelly; [~abondar], the updated wireframes, ACs, and BRs look good and are in scope of the changes. The updated wording all looks good to go. Thank you!;;;",
            "15/Feb/19 4:24 AM;abondar;Update based spec workshop today: \"Section\" selector moved to step 2.\nfyi [~rdannelly];;;",
            "18/Feb/19 11:22 AM;daladinski;[~abykova] [~dstepkin] [~apavlov]\n\nAs a part of exploratory testing let's also check how it works with users having both student and instructor roles on their names.;;;",
            "25/Feb/19 3:22 AM;abondar;Case Adding Existing Student as an Instructor (NG-4519) will be implemented in a sprint later. \nSo the temporary error message for the case: \"The user is registered in WP as a student. The case is not supported yet. \";;;",
            "01/Mar/19 4:42 AM;abondar;Spec update for the case based on implementation review:\n~ department field is removed for the existing users;\n~ the user could be associated with more than one school.;;;",
            "13/Mar/19 8:11 AM;nkochmarev;Implemented in version 1.70.0;;;",
            "21/Mar/19 1:16 PM;rdannelly;I've completed my UAT testing, Please view this as sign off for this story. Thank you!\n\n ;;;"
        ]
    },
    {
        "Summary": "Seems like some users are not being prompted for payment and are getting access to courses",
        "Issue key": "NGPROD-14",
        "Description": "Email received by Rich from CSS that summarizes issue\n\nYou emailed yesterday letting us know that the paywall was set up for all schools (except those we sent you) so all courses should be directed to the purchase page, correct?\n \nJennifer is attempting to register as a student to get some personalized screenshots for FDOC, but is not being directed to the purchase options.\n \nSchool: George Mason University\nPFE: Weygandt Financial 10e\n",
        "comments": [
            "15/Aug/18 10:35 AM;dlederer;Details from admin portal for product and FICE\n\nCourse name:\nKieso_Intermediate Accounting_16e_Faughan_Master Course\nID:\n1148\nXYZ Canvas course ID:\n11062\nXYZ Canvas course SIS ID:\n98140a5d-c351-4f77-bd39-2fec9408e98a\nAccess model:\nADOPTION\nRecommendation:\nNOT_SURE\n\nInstitution:\nInstitution name:\nGEORGE MASON UNIVERSITY\nFICE:\nA00374901\n\nProduct:\nProduct name:\nKieso, Intermediate Accounting, 16e\nProduct UUID:\n8862dab9-9ccc-4668-8942-e5535f8effb5\nProduct ISBN:\nEPROF17560\nXYZ Canvas Blueprint course ID:\n9757\n;;;",
            "15/Aug/18 10:43 AM;dlederer;The problem seems to be that the license API is not looking at the date so as long as there is a record in the table (even though the end date has passed), the institution license is active. In order to fix this now in PROD, the recommendation is to remove the \"expired\" licenses in PROD. Once that is done, the license check will not return the institution license and onboarding behavior should be restored and users will be prompted with the pay wall;;;",
            "15/Aug/18 10:51 AM;dlederer;[~rdannelly] - This has been fixed for GMU. If you can validate, [~vasanths] will make sure all institutions are fixed as well. ;;;",
            "15/Aug/18 11:08 AM;dlederer;Confirmed by [~rdannelly] that GMU works now. \n[~vasanths] - please remove the expired licenses so this is fixed for all institutions;;;",
            "15/Aug/18 11:41 AM;dlederer;The script has been run to remove all expired institutional licenses so paywall should be hit where appropriate;;;",
            "17/Aug/18 2:24 PM;jlu2;The issue is resolved by db update.;;;"
        ]
    },
    {
        "Summary": " [NGAI] [F6] Secure NG Admin tool - NG Admin (Phase 1)",
        "Issue key": "NG-3634",
        "Description": "This story is about securing an existing abc Admin tool.\n\nRequirements are:\n 1. The Admin tool API should be protected as specified here: [https://confluence.XYZ.com/x/WjLggKAw]",
        "comments": [
            "01/Aug/18 6:14 AM;aryzhakov;Ready for spec workshop.;;;",
            "16/Aug/18 9:38 AM;daladinski;Hi Sergey,\n\nI'm still able to open https://learning-qa.XYZ.com/abcadmin/index.html#/main and log into if I'm outside of XYZ Network.\n\nRegards,\nDmitry;;;",
            "23/Aug/18 10:49 AM;acostello;I am going to split this story into two tasks.  Requirement #1 is still open.  Requirement #2 can be moved to Regression testing phase.\n\ncc [~ystartsev][~daladinski];;;",
            "21/Sep/18 2:48 AM;smorozov;Hi [~daladinski], assigning this non-functional story to you to let QA team verify that NG Cinnamon Bread uses secure NG API endpoints that are only accessible from XYZ network.\nSecure NG API endpoints contain paths /abc/api/v1/secure/, /abc/api/v2/secure/.;;;",
            "28/Nov/18 10:35 AM;rvirginia;Looks to be done but assigning to you for final confirmation.;;;"
        ]
    },
    {
        "Summary": "Issue with XYZ Reader",
        "Issue key": "NGPROD-3542",
        "Description": "Please see the email chain below from an instructor that I provided a XYZ Reader URL.\n\nThis would not seem to be a reset password issue. They stated that they didn't find anything on their bookshelf after logging on.\n\n--------------- Original Message ---------------\nFrom: Yang, Xiao [xnayang@mail.smu.edu]\nSent: 10/5/2023 4:23 PM\nTo: test@XYZ.com\nSubject: Re: Please Verify Instructor Credentials - Digital Evaluation Copy Request [Case Number : 23562041] {5006T00002JLgUtQAL.0036T00004TDG16QAH} [ ref:_00Dd0eeku._5006T2JLgUt:ref ]\n\n⛔\tThis is an external email.\n\nThank you for giving me access to the digital textbook but when I log in I found no active books on my shelf. Would you mind helping me looking into the issue? Thank you.\n\nXiao\n\n\nOn Sep 27, 2023, at 9:10 AM, test@XYZ.com wrote:\n\n\n\nYou don't often get email from test@XYZ.com. Learn why this is important\n\nXiao,\n\nGood News! Your complimentary digital copy of Geomorphology and Natural Hazards has been approved.\n\nPlease follow this link to login to your XYZ account to start reading!\n \nhttps://read.XYZ.com/books/9781118648605\n \nThanks, Tammy\n\nTammy Mattox\n\nSenior Sales Support Supervisor\nXYZ Academic and Professional Learning\n\n\n\n\n\n\nFirstName:\tXiao\nLastName:\tYang\nEmail:\txnayang@smu.edu\nCountry:\tUnited States\nState/Province:\tTX\nBusiness Phone:\t9193602079\nSchool Name:\tSouthern Methodist University\nJob Role:\tProfessor\nDiscipline:\tGeosciences\nCourse Of Interest:\tGEOL1313 Earthquakes and Volcanoes\nDecision Type:\tIndividual\nTime To Decision:\tBeyond 12 months\nCourse Enrollment:\t50 - 99\nTitle Requested:\tGeomorphology and Natural Hazards: Understanding Landscape Change for Disaster Mitigation\nISBN:\t9781118648605\n\n\n\n\nref:_00Dd0eeku._5006T2JLgUt:ref",
        "comments": [
            "05/Oct/23 5:00 PM;tmattox;[~atyukavkin];;;",
            "06/Oct/23 4:45 AM;osolovyo;hi [~tmattox]  - as per direction from [~dpetrucci] such sort of issues should go to XYZPLUS Tech Support at first (not to WP dev team directly via NGPROD tickets);;;",
            "06/Oct/23 8:15 AM;atyukavkin;Hi [~tmattox] two notes:\n# I see only Student account in our system. There is no instructor with such email.\n !PROD_Stud_10-06-2023.png|thumbnail! \n# There are no XYZ Reader licenses\n !PROD_Stud_10-06-2023_2.png|thumbnail! \n\nIf digital evaluation copy needs to be provided to end user then Comp Copy license should be created in XYZPLUS Cinnamon Bread by Admin or user can request it via XYZ.com site.\nThanks,\nAndrei;;;",
            "06/Oct/23 11:25 AM;tmattox;He is an active instructor at Southern Methodist and was new to our database therefore I added him before providing him with the link. I will have him try again and send a Vitalsouce code if he can't access.;;;",
            "06/Oct/23 11:58 AM;atyukavkin;Hi [~tmattox] I still don't see XYZ Reader license in CAP. There is no need to provide Vital Source. We (XYZ) need to create XYZ Reader license in CAP according to our regular process. User will not see XYZ Reader book in book shelf until then. \n[~jsur] [~mejester] [~snorman]\nThanks,\nAndrei;;;",
            "10/Oct/23 12:09 PM;jmehrotra;As discussed in meeting on 10/09 - Case can be closed.  User has a student role.\n\n++ [~atyukavkin] , [~tmattox] ;;;"
        ]
    },
    {
        "Summary": "Pre-production validation - mthree prod site",
        "Issue key": "EB-61",
        "Description": "As a mthree faculty/staff that will be using the Engage portal in production, I need to sign off that the necessary tools for teaching my courses and administering the intended learning experience are available on the Engage portal prior to production kick-off.",
        "comments": [
            "27/Jan/21 12:30 PM;cmisbach;First meeting was on 1/25. Follow up scheduled for 2/1.\n\nWe will plan to change some branding details for the portal, and possibly change the url as a result of the 2/1 convo. We will also plan on demoting users that currently have Site Admin access to their appropriate roles.\n\nFirst course to be taught is planned for 2/16.;;;"
        ]
    },
    {
        "Summary": "Change NWP User Role and Email",
        "Issue key": "NGPROD-1726",
        "Description": "SFDC # 06325074\n\nU of WISC-M Canvas Admin Kathy Pinkowsky has requested a change for the below user account. Please change the user role to 'Student' and the email address to 'cichock6@uwm.edu'.\n\nUser type: XYZ\nUser profile ID: 1177622\nFirst name: Leo\nLast name: Cichocki\nUser email: disablecichock6@uwm.edu\nRole: Instructor\n\nReason for Request: The school has a pending investigation with Instructure to determine how the student, who was added to Canvas through SIS import as an observer, was designated as a Teacher and then added to XYZPLUS as Instructor.",
        "comments": [
            "03/Nov/20 6:52 AM;osolovyo;hi [~rdannelly] - Proton or Tardis team can implement this request.\nCould you please prioritize this task?\n\n++ [~daladinski] ;;;",
            "03/Nov/20 8:47 AM;rdannelly;[~daladinski], is this NGPROD ticket something that we can take on with either the Proton or Tardis team in the current sprint without impacting the current sprint scope / capacity? If we can take it on, let's add this to one of the current sprints. If we are at NGPROD capacity for the teams this sprint, let's treat this as a potential NGPROD ticket for the next sprint.;;;",
            "04/Nov/20 4:13 PM;jspottsvil;[~rdannelly] [~osolovyo] The customer requested a call with myself and the CSM with their admin team and would like to have a resolution for this student ASAP. This is a remedial math class and the student is falling behind not being able to access NWP and complete work. \n\nAs of now the student cannot access WP or any course content, is this something that can be resolved quickly? ;;;",
            "04/Nov/20 4:25 PM;rdannelly;Hi [~jspottsvil] . [~smorozov] is working on this ticket in our active sprint. [~daladinski] should be able to provide an update tomorrow once our Russia colleagues are back in the office;;;",
            "05/Nov/20 10:21 AM;smorozov;[~jspottsvil], I would like to double check what should be done for this request.\nAs per my analysis, the student account with email address 'cichock6@uwm.edu' already exists in abc database, in CORE and in XYZ Canvas. This student is not enrolled in any course section.\nIf we need to get this student enrolled in some course section, we can do this via Cinnamon Bread.\n\nAs for instructor 'disablecichock6@uwm.edu', this account exists in abc database and in CORE. This user also is not enrolled in any course section.\n\nCould you please clarify?;;;",
            "05/Nov/20 10:34 AM;jspottsvil;[~smorozov] Thanks for the update, do either of the accounts have any prior coursework or anything that would be lost of we broke their claims/pairing? I would want to delete the instructor account all together and remove the pairing for the student account so the student can re claim through Canvas.;;;",
            "06/Nov/20 11:09 AM;jspottsvil;[~smorozov] Were you able to make the changes mentioned above? Thank you;;;",
            "09/Nov/20 10:47 AM;jspottsvil;[~smorozov] Are there any updates on this case? This student needs to get access to his course materials asap, can the instructor account pairing (disablecichock6@uwm.edu) be removed and the account be deleted all together and can the student pairing (cichock6@uwm.edu) be removed so the student is prompted to re claim his account with the right Canvas login.\n\n[~rdannelly] Is this a feature that can be built into CAP at some point? User/course deletion and user/course unpairing is a common feature on most publisher platforms and would cut down on escalations and engineering efforts for cases like this. Sometimes users pair the wrong e-mail address or instructors will pair the wrong LMS course and need to reset it. ;;;",
            "09/Nov/20 11:05 AM;lfavors;[~vsundaramu]  We Need to break the claim of  on disablecichock6@uwm.edu',  its claimed by\nh4. Personal info:\nUser type:XYZ\nUser profile ID:1177622\nFirst name:Leo\nLast name:Cichocki\nUser email:disablecichock6@uwm.edu\nPassword: \nRole:Instructor\nStudent ID:N/A\nGraduation year:N/A\nSubscribed to XYZ alerts:No\nLearning style survey delivery form:N/A\nLearning style survey delivery platform:N/A\nCreation date:2020-10-27\nLast update date:2020-10-28\nh4. Licenses:\n\nN/A\n\n \n\n \n\nThe account is claimed by\nh4. Personal info:\nUser type:LMS\nExternal user ID:312565\nXYZ user:[Leo Cichocki|https://learning.XYZ.com/abcadmin/index.html#/userList/XYZUser/1177622]\nLTI consumer key:CANVAS_04a267df-b4d1-4346-ac51-7caec45a73fa\nLTI user ID:0cd6dab7e0b464edaff4b7ac84be1a956abc13a0\nRole:INSTRUCTOR\nLMS type:CANVAS;;;",
            "10/Nov/20 3:47 PM;lfavors;[~chrcollier], Issue has been resolved..  \n\nno additional work needed on this case and Instructor has been communicated with.\n\n ;;;",
            "05/Feb/21 2:24 AM;osolovyo;Moved to Resolved since the ticket was in Ready for Verification status more than 15 days.;;;"
        ]
    },
    {
        "Summary": "Account test@XYZ.com needs Instructor Role",
        "Issue key": "NGPROD-941",
        "Description": " Please change account test@XYZ.com to role Instructor\n\nPersonal info:\nUser type:\n\nXYZ\nUser profile ID:\n\n538667\nFirst name:\n\nKadeem\nLast name:\n\nBROWN\nUser email:\n\test@XYZ.com\nPassword:\nRole:\n\nStudent\nStudent ID:\n\nN/A\nGraduation year:\n\nN/A\nSubscribed to XYZ alerts:\n\nNo\nLearning style survey delivery form:\n\nN/A\nLearning style survey delivery platform:\n\nN/A\nCreation date:\n\n2019-11-08\nLast update date:\n\n2019-11-20\nLicenses:\n\nN/A\nAssociated LMS users:\n\nN/A",
        "comments": [
            "25/Mar/20 8:05 AM;osolovyo;This ticket has not been updated in more than 15 days.\nHi [~vsundaramu] - could you please take a look and move it forward?;;;",
            "02/Apr/20 4:42 AM;osolovyo;hi [~dstepkin] - could you please take a look and define whether Proton team can do this task?;;;",
            "14/May/20 4:25 AM;osolovyo;hi [~dstepkin] - do you have any updates on this? ;;;",
            "28/May/20 10:46 AM;dstepkin;Hi [~lfavors] unfortunately we don't have an ability to remove user accounts since we have a dependency on CORE system. Also there is no way to change STUDENT role to INSTRUCTOR because of the same reason - CORE system.\n\nBut there is a workaround - add an additional INSTRUCTOR role.\nthere are at least 3 known ways on how to do so. and in any of these cases (if i remember correctly) you need to specify user Institution and Department (needed for CORE system):\n# create a course for that user using *Course Setup Tool*\n# enroll a user as an instructor to any course section using *Cinnamon Bread*\n# enroll a user as an instructor to any existing course section using *Instructor Admin Tool* (not a native XYZ Canvas, but IAT);;;",
            "03/Jun/20 11:37 AM;abondar;[~lfavors] Could you please update if any additional information required.;;;",
            "03/Jun/20 11:39 AM;lfavors;Issue has been  resolved.  \n\nWe can close;;;"
        ]
    },
    {
        "Summary": "Adjust Institution/School search to show best matches first and search for initials & school nicknames",
        "Issue key": "NG-5135",
        "Description": "Right now when user searches for institution/school using type-ahead we sort all matched options just alphabetically without taking into account if matched wording is in the beginning, middle or end of institution/school name.\n\nIf we show best matches like matches in the beginning of institution/school name first this could be more convenient as type-ahead field assumes that user sees results and continue entering to short down the list till he/she finds an option.\n\n \n\n[^bestmatch.png] shows as this was implemented in Course Setup Tool previously\n [^actual.png] shows as it is implemented now in Course Setup Tool, Onboarding (registration and claim account) and in Course Admin interfaces\n\n \n\nThis smarter type ahead functionality should also include school's initials/nicknames.",
        "comments": [
            "29/Jan/19 6:41 AM;daladinski;fyi [~rdannelly] [~ewinklem] [~jlu2]\n\nplease feel free to close this CR if current implementation is OK even as a long-term solution.;;;",
            "29/Jan/19 8:36 AM;jlu2;[~rdannelly] [~ewinklem], The \"previous\" result in [~daladinski]'s description is the current Production behavior. The current behavior on QA is introduced by the new code. Is there any business requirement asking the results to be shown the way on the QA site? If you both never ask the changes in the showing the search results, the assumption for regression testing shall be expected as same as production. Then, the issue shall be fixed. I do not think this is a Change Requirement (CR). But, if you did provide the business requirement to make the search results different than production, then this would be a CR.\n\nHere is the current production behavior:\n\n!image-2019-01-29-08-34-30-432.png|width=527,height=296!;;;",
            "29/Jan/19 8:42 AM;daladinski;from one side (if we limit discussion to CST only) this is a regression issue.\n\nFrom the other side, this is a side effect of using new framework for CST and new field component React Select in particular.\n\nIt is already used in Onboarding and Cinnamon Bread but does not have search customization as old CST field had.;;;",
            "29/Jan/19 5:32 PM;rdannelly;Hi [~daladinski] and [~jlu2], I'm okay with leaving this as the known and expected behavior in the new CST tool. We can leave this in the backlog as a potential improvement down the line.;;;",
            "03/Apr/19 10:28 AM;daladinski;[~rdannelly] [~mlepyoshki]\n\nThis tickets can be closed as duplicate now or when NG-5769 is implemented.;;;"
        ]
    },
    {
        "Summary": "CAP - Unable to upload through Bulk License Import tool",
        "Issue key": "NGPROD-936",
        "Description": "This issue is reported by below email[^FW CAP - Unable to upload through Bulk License Import tool.msg]\n\n \n\n*From:* Brown, Thomas <[test@XYZ.com|mailto:test@XYZ.com]> \n *Sent:* Monday, November 18, 2019 9:55 AM\n *To:* Dannelly, Ryann <[test@XYZ.com|mailto:test@XYZ.com]>; Virginia, Rich <[test@XYZ.com|mailto:test@XYZ.com]>\n *Cc:* Wagner, Megan <[test@XYZ.com|mailto:test@XYZ.com]>\n *Subject:* CAP - Unable to upload through Bulk License Import tool\n\n \n\nGood Morning,\n\n \n\nI’ve tried several times this morning, and Meg has tried on my behalf as well, in both Chrome and Firefox, to upload a spreadsheet in the Bulk License Import tool in CAP.  I keep getting the following error message:\n\n ",
        "comments": [
            "18/Nov/19 10:45 AM;jlu2;The issue can be re-produced by using the excel and the error message is like below:\n\n!image-2019-11-18-11-48-06-867.png|width=973,height=547!;;;",
            "18/Nov/19 11:51 AM;jlu2;[~sconnelly3] I can re-produce the issue by using attached excel at [^LCCCUpload.xlsx]. I checked the template and they are correct.  If it requires code change and there is a workaround, I will create a story in our backlog. ;;;",
            "18/Nov/19 12:44 PM;sconnelly3;From initial investigation, I believe there is a security setting on the PROD environment stopping the file from being proccessed.  [~jlu2] a story needs to be added to our backlog to track the required effort.\n\nI also need PROD credentials for the Cinnamon Bread, so I can test the upload for myself. This issue cannot be replicated on the lower environments.;;;",
            "18/Nov/19 12:50 PM;jlu2;Thank you,[~sconnelly3]. Does it mean this feature was never working on production due to the security issue? or, is this changed just recently? Based on the demo that you showed last time, it seems it would not be any issue on the QA environment. So, I want to know this environment issue happened from date 1 or just recently....Thank you for prompt reply!;;;",
            "18/Nov/19 12:53 PM;sconnelly3;This is the first time I have seen this issue, so I would assume this is recent.;;;",
            "18/Nov/19 1:20 PM;jlu2;I have placed https://jira.XYZ.com/browse/NG-8270 in our backlog for prioritization from [~rvirginia];;;",
            "03/Dec/19 5:11 PM;jlu2;The issue is resolved for now.;;;"
        ]
    },
    {
        "Summary": "LMS course details feature toggle for XYZ eReader",
        "Issue key": "NG-15686",
        "Description": "h4. Description\nThis task shall look at creating an UX option for XYZ eReader feature toggle on the Course Details page for LMS Courses.\n\n!XYZ Reader Check Box LMS.png!",
        "comments": [
            "17/May/22 12:09 PM;jchai;[~atyukavkin], can you confirm if LMS courses need this feature toggle? I recall our conversation in Teams yesterday where I asked you if LMS \"course category\" need a feature toggle for XYZ eReader and you said \"{_}Our idea is to manage Course level feature toggle only for XYZ Redesign because LMS courses are also paired with XYZ Redesign courses{_}\", which I took to mean we don't need this feature toggle for LMS Courses.;;;",
            "17/May/22 12:25 PM;atyukavkin;That's my understanding of requirement:\n{quote}\nStoryline: As a CAP Super Admin User, I want to be able to toggle Vital Source + XYZ Reader enablement on/off at the course level in Course Details (NOT the Master JSON level), by using the following unique identifiers:\nLMS - Integration Code\nStandalone - Course Key\n{quote}\nIntegration code for LMS is a code for pairing LMS course with XYZ Redesign (standalone) course. \nPlease see following example.\nI have LMS curse in my dashboard. There is Integration code for each LMS course.\n !LMS_01.png|thumbnail! \nYou can locate this course in Cinnamon Bread by various search parameters as *XYZ Redesign*\n !LMS_02.png|thumbnail! \nIf you go to course details then you find Integration code for this LMS course which is *XYZ Redesign*\n !LMS_03.png|thumbnail! \nLet me know if you have any other questions.\n\n[~tellin] please let me know if my understanding is not correct.;;;",
            "17/May/22 12:27 PM;jchai;[~afoley] , [~lfishman], can you confirm too?;;;"
        ]
    },
    {
        "Summary": "Add multiple institutions to drop-down in CST",
        "Issue key": "NGPROD-1269",
        "Description": "Please add:\n\n||School Name||FICE||Country||ISO Country Code||Departments available||Reps available||STATUS||\n|MAPUA UNIVERSITY|B00003101|Phillipines|608| yes | yes |HOLD - FICE in CORE is I00238201|\n|MALAYAN COLLEGES LAGUNA|I00756501|Phillipines|608| no | no | |\n|MALAYAN COLLEGES MINDANAO|B00177301|Phillipines|608| yes | yes |ADDED|\n|NEW ERA UNIVERSITY|I00415101|Phillipines|608| no | no | |\n|UNIVERSITI TEKNOLOGI PETRONAS|I00838701|Malaysia|458| no | no | |\n|UNIVERSITY OF MALAYA|I00877501|Malaysia|458| no | no | |\n|ATMA JAYA YOGYAKARTA UNIVERSITY|B00006401|Indonesia|360| yes | yes |ADDED - FICE in CORE is I00165201|\n|PRASETIYA MULYA UNIVERSITY|B00010001|Indonesia|360| yes | yes |ADDED - FICE in CORE is I00159201 (Prasetiya Mulya Business School) |\n|WARMADEWA UNIVERSITY|B00177401|Indonesia|360| no | yes |FICE brings up QUICK LEARNING SCH in CORE? |\n|UNIVERSITAS KRISTEN SATYA WACANA|I00162801|Indonesia|360| no | no | |\n|UNIVERSITAS KRISTEN DUTA WACANA|I00164001|Indonesia|360| no | no | |\n|PPM SCHOOL OF MANAGEMENT|I00159301|Indonesia|360| no | no | |",
        "comments": [
            "21/May/20 9:54 AM;osolovyo;hi [~spetushins] - could you please move it forward with Proton team?;;;",
            "25/May/20 9:30 AM;abondar;Please check core on the presence of the institutions and appropriate departments ;;;",
            "26/May/20 4:18 AM;rbalat;Hi, please correct the school name below to University of Malaya. Thanks!\n|UNIVERSITY OF MAYLAYA|I00877501|Malaysia|458|;;;",
            "26/May/20 7:48 AM;smorozov;Hi [~tsummers], I have checked the related information stored in CORE for the requested institutions and found that for some of them there are no departments and XYZ representatives in CORE. I have put these details for each item in two additional columns in the table.\n\nThis means that we can safely add only institutions that have 'yes' in both columns in order to avoid problems during course provisioning in Course Setup tool.\n\nAlso, could you add new institutions via Cinnamon Bread (CAP)?\nThere is a button \"Create new\" on the Institutions page https://learning.XYZ.com/abcadmin/index.html#/institutionList .\n\nWe created this functionality to support specifically such kind of requests, so it would be great if CAP admin user could start using it.;;;",
            "26/May/20 8:19 AM;tsummers;[~smorozov] - Thank you for the additional details. I've created institutions prior; however, only for North America, and was unsure if there might be other considerations for Asia. In term of the related information stored in CORE, is that US CORE or SG CORE?;;;",
            "26/May/20 9:42 AM;smorozov;[~tsummers], for verification I used CORE instance that is integrated with XYZPLUS. I have no information if this is US CORE or SG CORE. I suppose, [~avenkata] may help to clarify this.;;;",
            "28/May/20 11:43 PM;rbalat;Any updates on this please?;;;",
            "29/May/20 8:22 AM;tsummers;[~rbalat] - I'll get the ones that can be added, added today. The balance I will work with Customer Care to get configured in Core properly, so that they can be added. I'll try to have this all done today.;;;",
            "29/May/20 5:52 PM;tsummers;[~rbalat] - I've updated the table in the description to add a STATUS column.\n\nIn CORE MAPUA INSTITUTE OF TECHNOLOGY has FICE I00238201; this FICE also appears on an old FICE list I have for MAPAU INSTITUTE OF TECHNOLOGY (sic).\nThese sources also identify B00003101 as assigned to ARIZONA JOB COLL INC.\nMy contacts in Customer Service could not change the school name to MAPUA UNIVERSITY because of the \"international\" FICE.  I will need to regroup on 6/1 to reconcile this FICE mismatch, and to get the name changed, prior to adding it to the CST drop-down.\n\nI've encountered some other inconsistencies - not sure if it will cause any issues, or not, but I will reconcile these anomalies.\n\n\n\n\n;;;",
            "03/Jun/20 4:44 PM;tsummers;While I am on vacation, would you please follow-up with Michelle Blair or another resources to confirm:\n\n1. Where a school seems to have reference to both a B FICE and an I FICE, which is correct - particularly, if US CORE shows the B FICE assigned to someone else?\n\n2. How can we edit the school names for I FICEs? (Or, in terms of being able to manage NWP schools in US CORE, does everyone have to have a [A or] B FICE?)\n\n3. Before these schools are added to NWP, I want to update the names so that they appear exactly as shown in the table, which was received by Rojhelyn.\n\nOnce everything is in order, having worked through the FICE conflicts, found a way to update the I FICE school names and departments to use them; or, determining that they must be replaced with B FICEs with one or more departments, and all school names pop-up in CAP with the school portion of the name as it appears in the table above, these should be ready for addition.;;;",
            "12/Jun/20 10:27 AM;lfavors;Evaluating to perform add to NWP institution list.;;;",
            "29/Jun/20 11:51 PM;rbalat;Hi, any update please? If possible, can you first add Mapua University and the rest of the schools to follow? Thank you.;;;",
            "30/Jun/20 11:58 AM;osolovyo;Hi [~lfavors] - do you have any updates on this?\n;;;",
            "02/Jul/20 12:48 AM;rbalat;Hi, Mapua University classes for the incoming term are starting in August. Can we fix Mapua University first, please? Thank you.;;;"
        ]
    },
    {
        "Summary": "Penn State Canvas lti 1.3 course no longer paired",
        "Issue key": "NGPROD-2658",
        "Description": "SFDC 11015378\n\nIssue: Canvas LTI 1.3 course that was once paired became unpaired. It has subsequently been repaired by the instructor. It is now associated with another LTI 1.3 consumer key CANVAS_acd7f1a8-38f3-48fc-812a-bb4c552be0da (prior lti 1.1 key CANVAS_8081).\n\nThe course should have 1810 students within spanning 13 instructors as this is a master course with Canvas sections within.\n\nInstructor:\n\nCECIL SHELTON\n[cjs1170@psu.edu|mailto:cjs1170@psu.edu]\n[https://learning.XYZ.com/abcadmin/index.html#/userList/XYZUser/222731]\n\nCourse: FL 21 STAT 200\n[https://learning.XYZ.com/abcadmin/index.html#/courseSectionList/lmsSection/41151]\n\nWe need to determine how the course became unpaired initially which prompted the instructor to repeat the pairing process.\n\nMore details as they come in",
        "comments": [
            "29/Nov/21 5:33 PM;jlu2;[~atyukavkin] , It seems that the course was \"unpaired\" incorrectly or unexpectedly. The instructor paired it again but it went with wrong consumer key. \n\nThe problems that we may need to find out:\n\nWho did the unexpected \"unpaired\"?\n\nHow can we help the instructor to pair correctly?\n\n[~sweerabahu] , I want to bring you attention again for the complication of course pairing in XYZPLUS. This is an existing LTI 1.3 Canvas users in our MVP...\n\nThank you!;;;",
            "30/Nov/21 10:52 AM;kdalsanto;[~jlu2] Do we have any answers yet as to what happened?  It's as if this course section just disappeared from CAP and cannot be accessed by anyone.\n\nMost recent from the main contact - Cecil Shelton:\n\n \n\nWe (Penn State UP) Is completely “locked out” of XYZPLUS. Keda is working with me since yesterday morning (and always is doing a great job).  \n\nMy stress level just went High. I thought students had access to the textbook still, but they do not. We have any exam this Friday. Students are needing to study.\n\nNeeding to know a timeline of this issue as we may have to push back our exam (Huge consequences and issues if we do)  Also is there a way to direct link them to the text or something in the meantime?\n\n \n\n[~mguarasc] [~ashoffey] \n\n ;;;",
            "30/Nov/21 11:06 AM;atyukavkin;Hi [~kdalsanto], It is still unclear who has unpaired the course but I did some data correction in database. Can you check with customer if they can access XYZPLUS?\nAlso I did not get, what exactly problem customers have. Do they see wrong course? Do they see some error? There is nothing in the ticket about it and is hard to work on fixing it.\nThanks,\nAndrey T;;;",
            "30/Nov/21 11:15 AM;rharman;[~atyukavkin] - If it is unclear who/what unpaired the course what data correction in the database did you complete? Would the changes manifest in cap in any way? Where and how might we witness these changes?;;;",
            "30/Nov/21 11:24 AM;atyukavkin;[~rharman]\nWhat we know at this moment is that unpair happened at 9.49-9.53 am Eastern time.\n!PROD_courses_11-30-2021.png|thumbnail! \nRegarding database correction, we had duplication records in one of our tables as a result of double pairing which should have only one record. I deleted the duplicated record to clear errors from one of backend APIs. Presumably this error prevented to access XYZPLUS (if this was an issue, I still do not know). I'm looking into logs and do not see new errors after correction.\n !PROD_DB_errors_11-30-2021.png|thumbnail! \nRegarding CAP, I'm not sure.;;;",
            "30/Nov/21 12:30 PM;jlu2;[~tsummers] , [~rharman] , could I have your support to find out if there is still an error to the users in any way? If yes, we need to know what errors are seen by the users so we can solve the issue properly.\n\nThank you!;;;",
            "30/Nov/21 2:38 PM;rharman;[~jlu2] & [~atyukavkin] - After the database correction - I now show that the course has re-appeared within CAP showing under the Canvas_8081 consumer key it matches data provided by Keda with the lti course guid. Instructor Cecil, has reported they are able to access; however, I am awaiting to hear about other instructors.\n\nWhen looking at the courses with the same name and comparing the LTI course section GUID I show that the section id's are the same, but different consumers.\n\nLTI course section GUID: CANVAS_8081_{*}f5b10122ddbbcfa8dc5879ea50d7d8efcb49bbe2{*}\n[https://learning.XYZ.com/abcadmin/index.html#/courseSectionList/lmsSection/45519]\n\nLTI course section GUID: CANVAS_acd7f1a8-38f3-48fc-812a-bb4c552be0da_{*}f5b10122ddbbcfa8dc5879ea50d7d8efcb49bbe2{*}\n[https://learning.XYZ.com/abcadmin/index.html#/courseSectionList/lmsSection/41151]\n\nWhat is left to be determined is based on the timeframe given for the unpair; however, do we show anything changed before the unpairing occurred for the course section GUID? What else can we see in records to why the unpair may have happened? Based on the initial report from Cecil, he began seeing emails from students prior to 9AM Eastern. Was something triggered that could have caused the course to disappear from CAP and then be paired with the other consumer based on double pairing? What impact to customers can be caused with a double pairing and how does it occur?;;;",
            "30/Nov/21 2:57 PM;atyukavkin;[~rharman] I can answer only some questions: \n- _why the unpair may happened?_ Most likely it was done manually via Cinnamon Bread. At least, I can see in the logs 'unpair' request however I can not say was it for this course or not. Unfortunately, we do not have audit trail and we do not know who unpaired the course. We do not have automatic unpairing, so the trigger is always manual.\n- _double pairing._ It was not expected that the course could be paired twice. In normal scenario a course should be paired only once. We plan to improve the logic and avoid duplication records even if the course paired twice. ;;;",
            "01/Dec/21 4:44 PM;jlu2;[~rharman] , [~tsummers] , [~dpetrucci] ,\n\nAs we discussed: \n\nPride team will solve double pairing issue in release 2.16 (Mid Dec.)\n\nFor the unpairing functionality, it is owned by [~afoley] and her teams. Based on your feedback, you would like to see if there is audit trail for who did unpairing and when in the CAP. \n\nYou also want to have some messaging to alert people who acted on \"unpair\" functionality for instructors.\n\nIn the short term, [~tsummers]  will look for limiting the unpair functionality to only super admin so that we can limit this type of issues.\n\nLet me know if I miss anything. Thanks.;;;",
            "02/Dec/21 9:45 AM;afoley;[~jlu2]  [~tsummers]  [~dpetrucci] audit functionality/CAP data logging is not implemented yet, so I don't know that it's possible for us to identify who unpaired the course. [~dstepkin] is this data we can find and provide at this time or is that not feasible? cc: [~abondar] ;;;",
            "02/Dec/21 11:20 AM;jlu2;[~afoley] , I know there is no logging for unpairing functionality in CAP. I want to CC you on this in case if you plan the work in CAP.\n\nPlease feel free to ping me if you have any question. :);;;",
            "02/Dec/21 4:06 PM;jlu2;[~tsummers] , [~rharman] , [~dpetrucci] , I got more clarification from the team. The issue mainly happened for LTI 1.3 users when the course is unpaired and paired again.\n\nI do not think this has been tested as part of LTI 1.3. We will include as part of our regression. On the other hand, the impact of issues shall be much smaller than what we thought before. The fix is ready for production. It will be released sometime in Dec.\n\n[~vsaranga] , [~gherath]  please include unpairing scenario in our LTI 1.3 regression. Thank you!;;;",
            "23/Dec/21 4:57 AM;osolovyo;The fix was delivered to Production in the scope of NWP 2.16 release on 22-DEC-2021 at 6:45 am EST\nSee [https://confluence.XYZ.com/displays/abcEN/Release+2.16]\n\nReady for verification;;;"
        ]
    },
    {
        "Summary": "Anonymous students are missing in Static and Adaptive Assignment Overview",
        "Issue key": "NGPROD-2390",
        "Description": "09874140\n School: all LMS schools impacted\n\nIssue: Students in LMS integration who choose to \"Stay anonymous\" do not appear in instructor dashboard in Adaptive or static question set. This needs to be updated so the user at least appears as anonymous user (even if there are multiple anonymous users). I believe they appeared in student progress prior to the dashboard update as anonymous.\n\nReplicated here:\n [https://XYZ02.d2l-partners.brightspace.com/d2l/le/content/8366/viewContent/68301/View]\n\nInstructor: racoffey\n Password: XYZ\n\nAnonymous student (clicked stay anonymous)\n RCanonymous.student\n Password: XYZ\n\nThe anonymous student's grade transfers to D2L but they do not appear in the dashboard. is it possible the previous level of functionality where the student although anonymous is listed in student progress along with LTI user id for this user identification purposes?",
        "comments": [
            "20/Sep/21 3:14 AM;osolovyo;[~nnoskov] [~avoroshin] [~nchernyshe] [~aldubolazo] [~mgritsuk]\n\ncould you please take a look and move forward?;;;",
            "21/Sep/21 6:56 AM;nchernyshe;Could you please look at the comment and check another service.;;;",
            "21/Sep/21 11:27 AM;aldubolazo;[~azagnityko] yes, it's clear the API returns complete enrollments list for the course. The question is how this anonymous user is managed by abc? If it isn't persisted into the DB - how JWT token is generated to him for LTI launch? Could you please clarify this specific registration procedure by the chance?;;;",
            "26/Oct/21 8:19 AM;vganopa;[~jhansen] [~mmancuso]  The business request here is that student list in Static/Adaptive Instructor Assignment Overview should include students who chosen to stay anonymous. What is your view about how anonymous students should be presented in the list?\n\n[~racoffey] You mentioned \"LTI user id for this user identification purposes\". Could you please explain the use case where LTI user id can be utilized for identification? ;;;",
            "26/Oct/21 10:16 AM;racoffey;[~vganopa] An instructor is unable to view student submissions or add time accommodations if a student is anonymous. If a student wishes to claim their account for this purpose we will need to unpair them from the external user ID. Once we have the LTI user ID, if we look at the class section student list in Cinnamon Bread, we are able to see the student's LTI User ID and we can unpair them from the External user ID so they can create an account using their name.  If the solution is to ask the student user to use was.api.XYZ.com/was/ga/v1/launches/current/info  to retrieve their LTI user ID, that is acceptable. ;;;",
            "26/Oct/21 1:21 PM;mmancuso;[~vganopa] [~jhansen] I assume we want an anonymous user's \"name\" to have no PII, including and part of whole of any id numbers that may be associated with them. I also assume that we want each instance of an anonymous user to be different, somehow randomly differentiated for the purpose of support triage, etc.\n\nGiven those two assumptions, I think it would be ideal if we had friendly anonymous names. If we can use Google Docs as an example, they generate a username by combining a random color with a random animal name, such as 'Blue Kuala'. I think that kind of approach is far more preferable than a word + unique string, such as 'Anonymous54321'. If this is a possibility for consideration, we could come up with some other combination of random words unique to XYZ and the context of education, such as 'adjective + element from the periodic table', like 'Fluffy Carbon' or 'Pulchritudinous Fluoride' or similar. Incidentally, 'Pulchritudinous Fluoride' is my new band name.\n\nIf this suggestion requires too much effort to build a database of unique words, I understand and am open to simpler ideas.;;;",
            "26/Oct/21 5:06 PM;jhansen;[~mmancuso] I like your style, but would it be more simple to identify them as \"Anonymous Student 1\", \"Anonymous Student 2\" and so on as they register? It would be clearer as to why they are named that way I think. Thoughts?\n\n[~scallison] [~vganopa];;;",
            "27/Oct/21 8:28 AM;vganopa;[~mmancuso]  [~jhansen]\n # Should auto-generated name for anonymous student be sticky?\n ** should it be the same across different launches of the assignment?\n ** should it be the same across different  assignments?\n ** should it be the same across different courses?\n # Are we going to show anonymous student in other part of XYZPLUS (not only within WAS assignments)? - e.g. in XYZPLUS Administration > User Admin\n # Is it needed to mark anonymous students in the student list with an icon?\n\n ;;;",
            "27/Oct/21 5:07 PM;jhansen;# My assumption is the name should follow that user throughout the course and that's it. I'm thinking about the experience of the instructor managing their class—it'll be easier for them to understand and manage anonymous students with simpler naming conventions. However, I do want to confirm that it's ok from a legal perspective since that is where the anonymous user requirement comes from. Not sure who can provide information on that. [~snorman]?\n# I believe the naming should be consistent in separate areas of the product\n# I'm not sure if instructors currently understand how or why anonymous students are labeled as such in their course. I will look to see if anyone internally has any research or data to back this up. If not, it may benefit us to add context.\n\n[~mmancuso] [~scallison];;;",
            "01/Nov/21 8:55 AM;vganopa;Two stories are created to handle this feature request:\n * LMS-13060 Static Instructor Assignment Overview - Show anonymous students\n * LMS-13061 Adaptive Instructor Assignment Overview - Show anonymous students\n\n[~snorman] [~jkoczara]  Please suggest how to proceed with this NGPROD ticket - are we closing it as Cancelled or Done as soon as LMS tickets are created to implement newly requested functionality?;;;"
        ]
    },
    {
        "Summary": "Pendo Enablement - Course Resources - Implement analytics API - Part 3",
        "Issue key": "NG-16827",
        "Description": "This is a task to implement analytics API in Course Resources to initialize Pendo with additional visitor metadata and to persist that data in UI without using cookies. \n\nAPI will be implemented via NG-16420.\n\nNew metadata that should be tracked in Pendo (note some fields will be unavailable depending on where user logged in from and the state of their user profile):\n\n{code}\n{\n\t\"userId\": \"uuid\", // userProfileKey or externalUserKey\n\t\"courseId\": \"uuid\", //courseKey, or externalCourseKey\n\t\"sectionId\": \"uuid\", //sectionKey, or externalSectionKey\n\t\"institutionId\": \"fice\", // Institution FICE code\n\t\"institutionName\": \"name\", // // Institution name or FICE code\n\t\"role\": \"STUDENT\" // or INSTRUCTOR\n\t\"productId\": \"uuid\", // product UUID\n\t\"productTitle\": \"title\", // product title\n\t\"lmsType\": \"CANVAS\" // or D2L, BLACKBOARD, XYZ_CANVAS, MOODLE,...\n} \n{code}",
        "comments": [
            "24/Oct/22 5:04 PM;jchai;-Pending [https://github.com/XYZ/nwp-ui-analytics/pull/4|https://github.com/XYZ/nwp-ui-analytics/pull/4-]-\n\nPending [https://github.com/XYZ/nwp-course-dashboard-ui/pull/25];;;",
            "31/Oct/22 3:04 PM;jchai;Reassigning to Geeshani to verify.\n\nVerified on QA env via course [https://XYZ2.test.instructure.com/courses/17639.] The new visitor metadata is being populated in Pendo (ie: [https://app.pendo.io/s/5724004899487744/visitor/nwp_a60d33fc-a803-410b-83f5-bf80dfcfffa3)|https://app.pendo.io/s/5724004899487744/visitor/nwp_a60d33fc-a803-410b-83f5-bf80dfcfffa3)]. \n\nYou can grab the visitor ID to verify the Pendo metadata is being populated via opening browser debugging tool, and in the \"Console\" tool, type in `pendo.enabledDebugging()` which brings up Pendo's debugging tools. Expand \"Agent\" and look for \"Initialize statement\" and in that string is the \"visitor\" -> \"id\" string.;;;",
            "04/Nov/22 1:49 AM;gherath;*Test Scenarios*\n # Check meta data sent through API call  when XYZ Canvas Instructor/ student launch Course Resources\n # Check pendo meta data populated in Pendo portal when XYZ Canvas Instructor/ student launch Course Resources\n # Check meta data sent through API call  when LMS Instructor/ student launch Course Resources\n # Check pendo meta data populated in Pendo portal when LMS Instructor/ student launch Course Resources\n\n*Test Steps*\n # Instructor/ student launch Course Resources\n # Check metadata sent through API\n # Get visitor id from Pendo's debugging tool\n # Verify metadata gets sent to Pendo portal.\n\n*Test Data:*\n * XYZ Canvas :[https://XYZ2.test.instructure.com/courses/62097]\ntestins-gh@mailinator.com/ XYZ123\n\n * Canvas: [https://XYZ.instructure.com/courses/3541262]\n16062022RegCode@mailinator.com/ XYZ123\n\n * BB: [https://XYZ2-test.blackboard.com/webapps/blackboard/execute/modulepage/view?course_id=_159_1&cmp_tab_id=_173_1&editMode=true&mode=cpview]\nAdministrator/dbdqptzql9k\n\n * Moodle: [https://XYZlms.moodlecloud.com/course/view.php?id=17]\nautostumoodle@mailinator.com/ XYZ123\n\n*Test Results*\n * Meta data sent through API call  when Instructor/ student launch Course Resources\n * Meta data populated in Pendo portal \n\nXYZ Canvas Ins: [https://app.pendo.io/s/5724004899487744/visitor/nwp_85ebb80e-3cc6-4ee5-b921-1928ec9cc5b8]\nCanvas stu: [https://app.pendo.io/s/5724004899487744/visitor/nwp_6204b68f-2517-4241-905e-b3706375c17d] \nBB Admin: [https://app.pendo.io/s/5724004899487744/visitor/nwp_84d43e06-f8c7-464b-85c0-9862f24ab806]\nMoodle stu: [https://app.pendo.io/s/5724004899487744/visitor/nwp_eaf5857f-d50c-4f22-8048-98ac2681b9fd]\nD2L Ins: [https://app.pendo.io/s/5724004899487744/visitor/nwp_691195d9-bd17-4e4a-84b0-008e0078f055] \n\nQA verification is completed. Assigning Tae for UAT ;;;"
        ]
    },
    {
        "Summary": "[OPERATIONAL REQUEST] Edit the names of each institution's sub-sub-accounts to include institution's names",
        "Issue key": "NG-5327",
        "Description": "Task prerequisite as per [~ewinklem]:\n{quote}Because we've had feedback that naming all the sub-sub-accounts under each institution in the Automatically-Provisioned Courses account as \"Adoptions\" or \"Test Drives\" is not helpful when you're viewing lists of course sub-sub-accounts (because you can't tell them apart), we'd like to test whether there would be any adverse affect on renaming the sub-sub-accounts to include their institution's names (e.g., change DAYTONA BEACH COLLEGE 's \"Test Drive\" sub-sub-account to \"DAYTONA BEACH COLLEGE Test Drives\").\n\nWe began doing that manually in production (after asking Alexander B and his team to verify that there would be no negative impact), and changed the names of about 2 dozen institution's' sub-sub-accounts, but given the issue we're seeing with ORION grades not following through when a course is moved to a different sub-account, we now feel it's better to thoroughly test this is a lower environment before we go any further.\n\nAlso, we think we should un-edit the 2 dozen or so sub-sub-account names in Production, but perhaps even having edited them at all will cause a problem, so we'll hold off on that until we have more information.\n{quote}\n*Successful criteria:*\n # The operational request shall be tested in lower environment (stage or QA).\n # Simulate the production set up to prepare a couple of institutions and courses for testing considering the new and existing sub-sub-accounts which could include students participated assignments and grades.\n # After the renaming according to Edward Winkleman's suggestion, the instructors and students shall be able to access the contents without any issue, except the known production issue https://jira.XYZ.com/browse/NGPROD-225.\n # The renaming shall consider the institution names could include special characters as below. If there is any special character not working, please provide as part of test results.\n\n * STRAYER UNIV-ARLINGTON\n * BISHOP'S SCHOOL\n * ST. JEROME'S UNIVERSITY\n * ELDA READING & MATH\n * OLNEY CENTRAL COLLEGE (ILLINOIS EASTERN COMMUNITY COLLEGES)\n * ITT TECHNICAL INSTITUTE SWARTZ CREEK #062\n * COLO STATE UNIV/FRUITA STATE\n * VPI&SU",
        "comments": [
            "18/Feb/19 4:43 AM;mlepyoshki;[~daladinski],\nCould you please discuss the issue with QE team and provide an estimation for it?;;;",
            "18/Feb/19 4:53 AM;daladinski;[~mlepyoshki]I would preliminary estimate as 2 story points;;;",
            "18/Feb/19 4:55 AM;daladinski;Hi Sergey,\n\nCould you ask someone to check if we have dependencies on Sub-Account names?\n\nRegards,\n\nDmitry;;;",
            "21/Feb/19 10:48 AM;smorozov;Hi [~daladinski], I have verified this with Yury, he has confirmed the sub-sub-account names change should be safe. ;;;",
            "21/Feb/19 3:30 PM;ewinklem;Thanks everyone! [~jlu2] I'm going to close the original ticket I opened for this and we'll begin editing the sub-sub-account names.\n\nEd;;;",
            "21/Feb/19 4:48 PM;jlu2;[~ewinklem] The QA has not tested yet. The confirmation is only from DEV team yet. We shall wait for QA team to confirm with the testing results before we make any change on production. I will reopen NGPROD ticket until I see QA's test results as sign off.;;;",
            "22/Feb/19 4:51 AM;daladinski;Thank you Sergey, I will do my test in Sprint 69;;;",
            "26/Feb/19 6:45 AM;daladinski;Testing is complete\n\nAfter updating subaccount:\n\n* Student and Instructor still have access to Content Player, Tomato (from left navigation panel and from Content Player), ORION and WAS Assessments.\n* Student progress for WAS and ORION Assessments is still in place and correct\n* Review Grades in Canvas is working properly (gradebook visual presentation is correct)\n* Self-enrollment to this course sections keeps working\n* Instructor Admin Tools keeps working properly (update course details, creating new course section, copy course)\n* Course Setup Tool creates new courses within an updated subaccount if the same access model is picked again\n* Edit Access Model through Cinnamon Bread from this subaccount to some other and changing it back works properly - course is again associated with an updated subaccount\n \n\nUser accounts used:\n\nng5327instructor@mailinator.com / 12345678\n ng5327student@mailinator.com / 12345678\n\n \n\nSchool Account used:\n\nEASTERN MICHIGAN UNIVERSITY\n [ canvas id:5140 ]\n\n \n\nSubaccount used:\n\n*Adoptions* was renamed to *UNIV-ARLINGTON BISHOP'S ST. JEROME'S READING & MATH #062 (UNIV/FRUITA) VPI&SU TEST*\n\n[ canvas id: 5140 ]\n\n\n ;;;",
            "28/Feb/19 4:27 AM;daladinski;Closing as done;;;",
            "28/Feb/19 4:29 AM;daladinski;[~jlu2], [~ewinklem], [~mlepyoshki]\nTesting is complete on lower environment (QA) as per acceptance criteria.\nReport is above.\nRegards,\nDmitry;;;"
        ]
    },
    {
        "Summary": "XYZ Reader. Integration testing",
        "Issue key": "NG-15310",
        "Description": "This task is for integration testing to test our changes and integrate with XYZ Reader platform",
        "comments": [
            "16/Mar/22 1:03 AM;tkarunarat;[~gnayak] [~atyukavkin] Can you please give more details to test this in QA? ;;;",
            "16/Mar/22 10:07 AM;atyukavkin;Testing QA Master Courses for XYZ Reader:\n1. Open Cinnamon Bread\n2. Go to Master Courses\n3. Select master course type: Quality Assurance\n4. Search for product which has a content\n5. open link 'click'\n6. You will be redirected to QA Canvas course\n7. Go to XYZ Course resources\n8. Open any eText link;;;",
            "16/Mar/22 12:02 PM;atyukavkin;I tried XYZ Reader in QA but it gives me empty page\nhttps://qa.read.XYZ.com/books/9781119308843\nhttps://qa.read.XYZ.com/books/9781119308843/epubcfi/6/18!/4/2/6\n\n !XYZ_Reader_CAP_1.png|thumbnail! \n !XYZ_Reader_CAP_2.png|thumbnail! \n\nFYI [~ndilina];;;",
            "21/Mar/22 6:30 AM;tkarunarat;*Tested on:* 02/23/2022\n\n*Environment:* QA\n\n+*Tested flows:*+\n * Check whether user redirecting to \"[https://qa.read.XYZ.com/]\" once click on eTextbook through XYZ course resources page.\n * Check whether user redirecting to \"[https://qa.read.XYZ.com/]\" once click on eTextbook through RDT.\n * Check the behavior once user copy the \"[https://qa.read.XYZ.com/]\" and paste it in a different browser.(should go to login page)\n * Check the behavior once user logout from the Ngoboard and try to refresh already logged in reader url \"[https://qa.read.XYZ.com/]\" (should go to login page)\n\n+*Test Steps:*+\n * Open Cinnamon Bread\n * Go to Master Courses\n * Select master course type: Quality Assurance\n * Search for product which has a content\n * open link 'click'\n * You will be redirected to QA Canvas course\n * Go to XYZ Course resources\n * Open any eText link\n\n+*Test Data:*+\n * [https://learning-qa.XYZ.com/abcadmin/index.html#/]\n\nAdmin: test@XYZ.com / XYZ123\n\n+*Test Result:*+\n * Check whether user redirecting to \"[https://qa.read.XYZ.com/]\" once click on eTextbook through XYZ course resources page.\n ** User redirected to the correct url -> [https://qa.read.XYZ.com/books/9781119308843/page/0/section/top-of-page]\n\n * Check whether user redirecting to \"[https://qa.read.XYZ.com/]\" once click on eTextbook through RDT.\n ** User redirected to the correct url -> [https://qa.read.XYZ.com/books/9781119308843/page/6/section/top-of-page]\n\n * Check the behavior once user copy the \"[https://qa.read.XYZ.com/]\" and paste it in a different browser.(should go to login page) \n ** Once user paste and go to the url its redirecting to the login page\n\n * Check the behavior once user logout from the Ngoboard and try to refresh already logged in reader url \"[https://qa.read.XYZ.com/]\" (should go to login page)\n ** Once user logout from the user and refresh the eReader its redirecting to the login page\n\nConfluence page with test results -> https://confluence.XYZ.com/displays/aabcEN/XYZ+Reader+Integration+Testing;;;",
            "22/Mar/22 3:51 PM;atyukavkin;Hi [~tkarunarat] [~gherath], Just let you know that I deployed new version of LTI to address the XYZ Reader feature toggle issue for Learning Hub courses. The LTI version is 2.23.2\nThanks,\nAndrei T;;;"
        ]
    },
    {
        "Summary": "Course Pairing - Updated copy",
        "Issue key": "NG-14432",
        "Description": "UX team requested to update the copy on the Course Pairing screen:\n * Since we initially designed the Pairing screens for Course Resources, it has some specific language regarding resources in it. Would we be able to update the language for all Pairing screens to make them less specific?\n\nNote: In the scope of LMS-13022 Course Pairing screen would appear not only upon launching XYZ Course Resources but also upon launching WAS assignment by instructor.\n\n-----------------\nThe scope of the request: change the text on the course paring page\n~ for instructor\n~ for student\nSee the wireframes section for details.\n_Note: New automated test for pair courses from the Assignment player is not in the scope of the ticket._",
        "comments": [
            "22/Oct/21 5:25 AM;abondar;[~tbaltimore] Could you please help us to determine the priority of the request?\nNote: probably we could discuss the item on our next planned UX check-in (Oct 26)... ;;;",
            "22/Oct/21 6:08 AM;abondar;[~tbaltimore] The request is to include the item to Spront 14. But the scope clarification is still required...\n;;;",
            "22/Oct/21 7:27 AM;vganopa;[~tbaltimore]  In Sprint 14 WAS teams are addressing the root cause of several NGPRODs - working with XYZPLUS assignments in non-paired course should not be allowed. So Course Pairing screen would appear for non-paired course not only upon launching XYZ Course Resources but also upon launching XYZPLUS assignment by instructor. Thus UX wants to make Course Pairing copy not specific to Course Resources. Hopefully the change will be as simple as removing \"Resources\" word. But let's wait for UX input on this.\n\nCC: [~jhansen] [~scallison] ;;;",
            "22/Oct/21 8:10 AM;tbaltimore;[~abondar] , let's see if we can finalize the plan with UX next week and, if so, we'll slot this into Sprint 14.  Thanks. cc [~vganopa] [~daladinski] [~snorman] ;;;",
            "26/Oct/21 5:41 PM;scallison;[~vganopa] [~abondar] Updated student and instructor course pairing copy:\n * [Student|https://www.figma.com/file/pBiVZN1XaSAcCbTvR1XWrE/Student-Assignment?node-id=11812%3A38742]\n * [Instructor|https://www.figma.com/file/RHzVZh5E363Sq5VDXv1VyF/Instructor-Assignment-Overview?node-id=12729%3A81274];;;",
            "27/Oct/21 11:44 AM;tbaltimore;[~scallison] , I think there is a typo in the bottom student example. \"been\" is in there twice.;;;",
            "27/Oct/21 12:37 PM;scallison;Thanks, [~tbaltimore]. Too many bleary-eyed revisions :). Updated.;;;",
            "10/Nov/21 8:38 AM;mmarler;[~tbaltimore]  looking for an update ---- is this ticket ready to resolve?;;;",
            "10/Nov/21 8:41 AM;tbaltimore;Thanks for the reminder, [~mmarler] ! Somehow this ticket got unassigned and is ready for UAT, but wasn't assigned to anyone. This will go through UAT and should be released with the rest of Sprint 14 in a week and a half.;;;",
            "11/Nov/21 11:22 AM;afoley;[~vganopa] brand new PM for Proton/Tardis/XYZPLUS here :) Can you please provide test credentials for me so I can complete UAT on this? cc: [~abondar]  who may be able to provide them as well.;;;",
            "11/Nov/21 12:02 PM;tbaltimore;[~daladinski] , do you remember how I got my QA credentials?;;;",
            "11/Nov/21 1:50 PM;daladinski;[~tbaltimore]  the simplest way is to create any course through course setup tool for Andrea. When she completes standalone activation she will get Canvas account created and will have full account. and then this account could be used for testing standalone or LMS scenarios.;;;",
            "11/Nov/21 2:25 PM;afoley;[~daladinski]  this would work on a lower env as well such as staging?;;;",
            "11/Nov/21 2:26 PM;tbaltimore;[~daladinski] , but I think she needs a XYZqa account....;;;",
            "11/Nov/21 2:28 PM;tbaltimore;Ah, no, wait, she will need a XYZqa account to get into CAP and CST in QA, but not XYZPLUS in QA....;;;",
            "12/Nov/21 2:33 AM;daladinski;[~tbaltimore]  [~afoley]   To get access to CST and CAP we should follow this instruction and create SNOW request [https://confluence.XYZ.com/displasy/abcEbN/HOWTO%3A+Get+Access+to+NWP+tools+%28CAP%2C+CST%2C+WPDC%29+through+Azure+AD]\n\nSupport team should at first create @XYZqa account and then provide access to abc tools as this is managed not in our application.\n\nin case of lower Env Request would look like - please provide access to {color:#000000}CAP/Cinnamon Bread (Dev, QA, Perf, Staging) as abc-tools-superadmins and CST/Course Setup Tool (Dev, QA, Perf, Staging) as course-setup-tool-users{color}\n\n ;;;",
            "12/Nov/21 12:08 PM;afoley;Testing will be completed by EOD 11/15 - when access/set up is complete.;;;"
        ]
    },
    {
        "Summary": "[RD-CB-AC] Activation - Generate Cartridge - Canvas -Unified end point - QA end to end testing",
        "Issue key": "NG-8959",
        "Description": "As an instructor, I would like to have the ability to get downloaded the Canvas LMS course cartridge for the specific draft course as a part of the activation step.\n\nAC: \n\nThere shall include Unified LTI Domain (NG-8785) that can be used by Apex team in their Epic.",
        "comments": [
            "19/Mar/20 4:39 PM;jlu2;[~nmendis], [~vsaranga],\n\nPer meeting with [~rdannelly], Proton team will finish the API to get real data for Course Cartridge at https://jira.XYZ.com/browse/NG-8830 in sprint 94. So, we will be able to test Course Cartridge with real data in sprint 95. \n\n ;;;",
            "20/Mar/20 1:14 AM;vsaranga;Unified LTI domain also needs to be tested with this.\n\nFYI [~jlu2] [~nmendis];;;",
            "31/Mar/20 6:12 AM;nmendis;1. Canvas course created:\n\nGo to Canvas [https://XYZ2.test.instructure.com/login/canvas] \n Login as Instructor : test@XYZ.com / XYZ123\n Select course: \"Test 1 3-31\"   (https://XYZ2.test.instructure.com/courses/13455)\n\nLogin as Student: sl_stu_1@mailinator.com/XYZ123\n\n \n\n2. Blackboard course created:\n\nGo to Blackboard [https://XYZ-test.blackboard.com/]\n Login as Instructor :  jennybba001/XYZ123\n Navigate to Course : \"Test_2_3-31\" ([https://XYZ-test.blackboard.com/ultra/courses/_408_1/outline])\n\nLogin as Student:  jennybba002 / XYZ123\n\n \n\n3. D2L course created\n\nGo to D2L [https://XYZ02.d2l-partners.brightspace.com/] \n Login as Instructor : d2l_instructor1/XYZ123\n On left navigation panel find \"My Courses\"\n Navigate to Course : \"Test_3_3-31\"  ([https://XYZ02.d2l-partners.brightspace.com/d2l/home/7241)|https://XYZ02.d2l-partners.brightspace.com/d2l/home/7241]\n Go to Content tab to view imported content\n\nLogin as Student: d2l_student1/XYZ123;;;",
            "01/Apr/20 7:42 AM;nmendis;*Following flows were tested for each LMS Canvas, Blackboard and D2L:*\n # Create a new course from CST - Receive 2 emails:  \"XYZPLUS course delivered\" and \"Activate your XYZPLUS course\"\n # Convert created draft course to current course from Onboarding \n # Received email with cartridge download link - \"Your XYZPLUS course cartridge is ready to download\" \n #  Created a new course in LMS manually\n #  Import course cartridge\n #  View the content (ORION, WEL, BONGO) organized in folders - {color:#ff0000}CANNOT launch them{color}\n #  Add XYZPLUS Course Resources app and launch it with course pairing ID taken from Admin portal (Only for Canvas) \n #  View content list in Course Resources - {color:#ff0000}CANNOT launch them{color} (Only for Canvas)\n # Assign a student to the course and check student view for content's folder structure \n # Launch XYZ Course Resources from student and check only one tab is visible for students (https://jira.XYZ.com/browse/NG-9438)\n #  Lauch RDT and check course content organized in chapters : - {color:#de350b}CANNOT launch/view content{color};;;",
            "03/Apr/20 8:26 AM;jlu2;[~rvirginia], [~rdannelly] please review the above test results from the team. ;;;",
            "03/Apr/20 4:57 PM;jlu2;All the above issues in [~nmendis]'s test results are documented in separated issues and they will be reviewed with [~rvirginia] during the PI planning and re-test in sprint 96.;;;"
        ]
    },
    {
        "Summary": "Course section removed in IAT, but still remains in CAP",
        "Issue key": "NGPROD-1154",
        "Description": "Course section was removed from IAT, but remains. This  is an unwanted course section please remove from CAP. The course section is not accessible in CAP although listed. its available for students to register, however any attempt to register for for this couse section A66490 resukts in an unexpected error.\n \n33510\t\nEcon 25\nKimmel, Financial, 9e, Raffaele, Adoptio...\tPublished\t\nRAFFAELE MARI\nUNIVERSITY OF CALIFORNIA IRVINE\t\nA66490\n",
        "comments": [
            "26/Mar/20 3:10 PM;dstepkin;Based on quick investigation i found that section was not deleted via IAT (Instructor Admin Tool). Since there are at least 2 limitations which will not allow to do so:\n1. it is impossible to delete a section with users enrolled (and there is still 1 enrollment to that section)\n2. it is impossible to delete the last section in a course.\nand also, after deletion the section in IAT the section will not be hard-deleted, but will be marked with \"isDeleted\" flag in our database.\n\nAll the records in our (abc) database are still there that means that our functionality was not used.\ncourse section with A66490 code is the only section in abc course with id=31046 named \"Kimmel, Financial, 9e, Raffaele, Adoption\". this course is linked to a Canvas course with id = 41606 and that exact course is currently missing in Canvas.\n\nSo, most likely that exact *canvas course was incorrectly deleted* in canvas itself (since there is no such thing as course deletion in IAT). and that deletion led to data inconsistency in abc database which causing the issue itself.\n\nSince abc database data and real Canvas data are out of sync now, most likely Cinnamon Bread functionality will not help to solve this issue. with high probability there is no way other than to manually manage related database records (e.g. enrollments, course sections, course)\n\nSo if the root cause identified correctly it is more like an hour fix (following measure twice cut once approach)\n\nSo it is up to [~rdannelly] to decide the priority of this issue.\n\nOr maybe someone else from Hoboken Pride team could assist;;;",
            "26/Mar/20 4:45 PM;rdannelly;Thank you for that analysis [~dstepkin]!\n\nHi [~lfavors], double-checking this, is the goal to delete the course section so no one can find/register for it?  Or is the goal for students to be able to register? ;;;",
            "01/Apr/20 11:40 AM;dstepkin;Hi [~lfavors] could you please provide some feedback;;;",
            "22/Apr/20 11:44 AM;abondar;Please remove in database\n;;;",
            "27/Apr/20 5:06 AM;smorozov;Hi [~lfavors], I have removed the requested section \"Econ 25\" with section code A66490 from database.\nCould you verify and close this ticket if it works as expected?;;;",
            "06/May/20 11:36 AM;abondar;[~lfavors] could you please check and confirm that the issue is fixed.;;;",
            "13/May/20 11:45 AM;osolovyo;Verified by [~smorozov] in abc database - respective record for this course section is removed.\nClosing as Resolved;;;"
        ]
    },
    {
        "Summary": "MVP Phase 1: LMS Assessment Dashboard - View assignments of a course section for external LMS users",
        "Issue key": "NG-10479",
        "Description": "As a member of the Support Staff of NWP,\n\nI want to have a list of all assignments related to a course section,\n\nSo that I can view the external LMS Instructor(s) associated to the assignment\n\n \n\n*Acceptance Criteria:*\n # The view must be available as the fourth tab of the ‘Properties’ view for a selected course section under the ‘Course Section’ component of the Cinnamon Bread (CAP) (Please refer attachments)\n\n          Tab Name = Assignments\n\n          Navigation Path = Cinnamon Bread --> Select ‘Course Section’ --> Perform Search --> Select course section from search results --> View the fourth tab ‘Assignments’ under ‘Properties’\n\n           Figma Design: [https://www.figma.com/file/FHVda2YzXjuWab5W8Hhc3z/CAP?node-id=12%3A3]\n\n \n\n 2. The view must support for all compatible external LMS platforms which includes;\n * Canvas\n * BlackBoard Learn\n * BlackBoard Ultra\n * D2L\n * Moodle\n * Sakai\n * Schoology\n *Note:* Need to obtain confirmation from stakeholders for the testing scope for LMS platforms\n\n3. The view must include the following columns\n|No|Column Name|Description|\n|1|Assignment name|The assignment name of the course section (derived from the LTI Resource link)\n  \n  |\n|2|Assignment ID\n  |The assignment ID of the assignments under the course section (derived from the assignment ID of the LTI link)\n  |\n|3|Due date\n  |The due date of the assignment of the course section\n -Sortable filed\n -Date format: day, month date year\n   (Eg: Monday, Dec 20 2020) \n -Time format: 12-hour clock (AM/PM) (time zone = Eastern Standard Time)\n    (Eg: 3:00pm EST)\n   \n The value should appear as;\n Eg: Monday, Dec 20 2020 At 3.00pm EST\n *Note:* The year is not available in the Figma design\n  |\n\n \n\n4. The view must have an option to search by ‘Assignment Name’\n\n \n\n5. The assignments must be listed in the descending order of the due date of the assignments\n\n \n\n6. The view must display assignments up to 2 years from the assignments start date\n     6.a All assignments over 2 years must be archived and must be available for the Support Staff member when required\n\n7. The view must display a minimum of 25 records on page load with an infinity scroll display the next 25 records until end of results\n\n ",
        "comments": [
            "01/Dec/20 10:41 PM;aanthony;Hi [~ofernando],\n\nPlease find attached the updated design for the LMS Assessment Dashboard along with the Figma design. Please check and let me know if you are able to view the design.\n\nI have updated the following Acceptance Criteria's based on the updated design;\n1. *Acceptance Criteria 1:* Included the updated design\n2. *Acceptance Criteria 3:* Updated the columns that should be displayed in the view\n3. *Acceptance Criteria 4:* Removed the note on the filter options since we decided to remove the filters \n\n\nCC: [~dwood];;;",
            "02/Dec/21 5:00 AM;mpraneeth;This has been partially delivered and without further direction, this task would be obsolete ;;;"
        ]
    },
    {
        "Summary": "[TECH DEBT] Implement page for consolidated information about all  Delivery Cache components' versions deployed to NextGen Environment",
        "Issue key": "NG-3996",
        "Description": "There is a page [http://was-private-app-qa-elb.aws.XYZ.com/was-test-harness/versions] created for WAS\n\nWe would like to have something similar BUT instead of having one \"Version\" column that means QA environment there, we would like to display information for all 4 Envs: DEV QA PERF PROD with respective versions in every column\n\nDescription and application columns seem unnecessary and can be omitted in order to fit the entire table.\n It would be also nice to see this page and understand what services were recently built and updated on QA so final columns could look following way:\n||Application Name||Dev||QA||QA Build timestamp||Perf||Prod||\n\n \n\nIn addition we would like to see comparing components versions below on that page:\n\n1. Between +Dev and QA+, i.e. show only application having different version like\n||Application Name||Dev||QA||\n||App1||Version 1.01||Version 1.02||\n||App2||Version 1.02||Version 1.01||\n\nand don't shop App3 row if Dev version is equal to QA version, for example version 1.01 on both\n\nIn addition we would like to see co\n\n2. Between +Prod and QA+, i.e. show only application having different version like\n||Application Name||QA||Prod||\n||App1||Version 1.01||Version 1.02||\n||App2||Version 1.02||Version 1.01||\n\nand don't shop App3 row if Prod version is equal to QA version, for example version 1.01 on both\n\n...\n\n \n  ",
        "comments": [
            "24/Sep/18 12:07 PM;rparshin;Potential task for [~igabdullin] if he has capacity in Sprint 58.;;;",
            "05/Oct/18 8:49 AM;daladinski;All components can be taken from https://confluence.XYZ.com/displays/abdcEN/NextGen+QA+Environment;;;",
            "05/Oct/18 12:06 PM;daladinski;Example of Applications order:\n\n \n\nContent Player App\n\nNG User Interface\n\n{color:#172b4d}Onboarding UI{color}\n\nProduct Pairing UI\n\n{color:#172b4d}Cinnamon Bread UI{color}\n\nCourse Setup Tool\n\n{color:#172b4d}Notifications Service{color}\n\n{color:#172b4d}SSO (CAS){color}\n\n{color:#172b4d}CAS Auth (CAS){color}\n\n{color:#172b4d}LTI{color}\n\n{color:#172b4d}Outcome Service{color}\n\n{color:#172b4d}Caliper Event Service{color}\n\n{color:#172b4d}Efour-synchronization{color}\n\n{color:#172b4d}Delivery Cache UI{color}\n\n{color:#172b4d}DC Auth Service{color}\n\n{color:#172b4d}DC Metadata validation{color}\n\n{color:#172b4d}DC Search{color}\n\n{color:#172b4d}DC Content Cache{color}\n\n ;;;",
            "05/Oct/18 12:18 PM;daladinski;As an option (can be implemented later) proposed by Dmitry S we could have tabs like we have in Delivery Cache (Media, Ebook, Products) but here it would be like\n\nAll, NextGen Features, Delivery Cache and where NextGen Features tab would not have Delivery Cache Services and Delivery Cache tab would have only DC services.;;;",
            "15/Oct/18 10:17 AM;daladinski;New application was implemented\n\nProduct Pairing UI https://learning-qa.XYZ.com/ngprodpair/version.json;;;",
            "18/Oct/18 7:44 AM;rparshin;[~daladinski] - please check it and let me know if this is what you expect to see.;;;",
            "18/Oct/18 10:40 AM;igabdullin;Version [1.7.5|https://jira.XYZ.com/secure/bbb.gp.gitviewer.BrowseGit.jspa?repoId=176&tagName=1.7.5]\nUI deployed to DEV and QA Env.\n\nBut to work, need to update abc_services.json files. \nAs I understand it, I need access to git DO_abc. ;;;"
        ]
    },
    {
        "Summary": "Students in Asia report an inability to login to abc",
        "Issue key": "NGPROD-3220",
        "Description": "SFDC#17124651 and 17104614\n\nMultiple students report an inability to login to XYZPLUS. When the username and password is entered, the screen shows a spinning pacifier, suggesting the information is loading, but the students are never taken to their dashboard.\n\n !image-2022-11-22-09-50-41-928.png|thumbnail! \n\nA feature of these user accounts is that they contain Chinese characters. An inability to create new accounts with Chinese characters was addressed in NGPROD-3080, after which the problem was resolved.\n\nIn fact, I had created an account to test the resolution of NGPROD-3080 and it is still operational; I also created a 2nd account since this latest report to test account creation and login with a name containing Chinese characters and it, too, works for login:\n\ntcs.XYZ+test@gmail.com / \ntcs.XYZ+test@gmail.com / paassword\n\nYet, here is an unaltered example (at the time of creating this JIRA ticket) of a student account that cannot login.\n\nf74112271@gs.ncku.edu.tw / zXc12300\n\nOther students are able to login after the Asia team removed the Chinese characters:\n\n||Original First Name||Username||Password||New First Name||\n|陳剴崴|f54101048@gs.ncku.edu.tw|GAY945haha|F54101048|\n|蘇芳君|f54104054@gs.ncku.edu.tw|Aa92010890845|F54104054|\n|吳承諺|f54101072@gs.ncku.edu.tw|blacksmith1011|F54101072|\n\nA secondary issue that has been detected is in trying to use CAP to set a student name back to using the Chinese characters for further testing. CAP does not allow these characters to be saved to a user's record, giving the error that \"Double-byte charset and Latin Extended-A symbols are not allowed\".\n\n !image-2022-11-22-09-50-06-491.png|thumbnail! \n\nThe need to support Chinese characters, as explained in NGPROD-3080, is important to the market in Asia.\n\nWhy are these students once again having problems, seemingly related to the use of Chinese characters in their names?\n\nWhy is the issue inconsistent, as evidenced by my two test accounts that contain Chinese characters?\n\nWhy does abc allow accounts with Chinese characters to be created, but CAP does not perpetuate that support?\n\n\n",
        "comments": [
            "22/Nov/22 10:03 AM;azagnityko; !screenshot-1.png|thumbnail! \n\n[~nkochmarev] could you please investigate ;;;",
            "22/Nov/22 10:22 AM;abondar;[~tsummers] The current NWP limitations/restrictions were defined based on the existing Back Office restrictions.\nSee https://confluence.XYZ.com/pagetges/viewpage.action?pageId=22544402 for details.\n---\nAs I understand the restrictions might be removed as a part of Convergence Onboarding flow enabling: hybris/ALM instead of Shopping Card / Core.\n---\nCould someone confirm/comment on that point?\nfyi [~slynch], [~vsundaramu], [~azagnityko];;;",
            "22/Nov/22 3:24 PM;tellin;[~abondar] I'm confused by your referring to the NWP limitations. This looks like E4 documentation from 2018, is it still applicable?\n\nThis ticket seems like a new PROD issue, and not an existing limitation, no? See [~tsummers] comment (bold/underline mine): \n{quote}Definitely not the same symptoms as initially reported for NGPROD-3080, where users could not create accounts with Chinese characters. *For NGPROD-3220, the accounts with the characters had previously been created, but could suddenly not login.*\n\nAnd to confuse matters further, I have two test accounts (documented in NGPROD-3220) - one that I created to validate the solution for NGPROD-3080 and the other created just last week - {+}both of which contain Chinese characters and both of which continue to work for login{+}.\n{quote}\nDid [~nkochmarev] already investigate this issue? \n\nAlso [~tsummers] do we know how many students are affected? \n\ncc [~azagnityko] ;;;",
            "22/Nov/22 5:15 PM;tsummers;[~tellin] - Between the two cases and a list I solicited from our colleagues in Singapore, I would estimate at least 6 students have been reported, but there are likely more that have not been reported. The quick fix seems to be to update the name in CAP, after which the student is able to login. In that sense, there is a workaround, but having to employ this workaround is contrary to what we thought was solved for with NGPROD-3080, allowing students to create and use their accounts with Chinese characters.\n\nIf this is eventually resolved, it further seems we are unable to use CAP to restore the characters that are remove, due to rules in place with CAP that are apparently different than those employed during account creation.\n\nFor the record, WPE4 could also tolerate Chinese characters from the XYZPLUS perspective, but just as with abc, these characters are replaced with '?' in CORE.;;;",
            "23/Nov/22 3:14 AM;nkochmarev;[~azagnityko] In this case, the error is described in the console - *\"DOMException: Failed to execute 'atob' on 'Window': The string to be decoded is not correctly encoded.\"* Something wrong with second part of JWT. Current implementation do not expect extra symbols (decodes a Base64-encoded string (\"atob\" should be read as \"ASCII to binary\")) To support this we need additional implementation.\n\n!image-2022-11-23-11-13-08-123.png|width=616,height=130!\n\n[~tellin] \nhttps://jira.XYZ.com/browse/NG-16572 We were not notified about this ticket and it seems that it is not completed, because if the validation of one entity changes, then this should be distributed throughout the system (FE/BE busness logic including IAT, Course Builder, Cinnamon Bread, Onboarding applications) Also as Alexander Bondar and Tim Summers mentioned new rules cause issues with a corrupted data on the Core side.;;;",
            "23/Nov/22 8:32 AM;tsummers;Jess Ho (Digital Delivery Coordinator) in Singapore created a new test account with Chinese characters that, as with my test accounts with Chinese characters, has no problem. The issue, therefore, seems to be present only for older accounts - perhaps those earlier than a specific date for creation?\n\nJolyn Ng (Senior Manager, Digital Delivery) would appreciate a speedy resolution to the problem. Given the inconvenience and disruption these issues have caused, our Taiwan customers are reconsidering using XYZPLUS.\n\nSince GA for abc (and earlier, in WPE4), the use of Chinese characters was not a problem until the issue reported in NGPROD-3080. After that was addressed, and for the more recently created accounts, it is still not a problem (yet). These accounts may have appeared less than desirable or easy to read in CORE, but the important thing was that the system worked, despite appearances in CORE.;;;",
            "23/Nov/22 8:40 AM;nkochmarev;[~tsummers] Unfortunately I was able to reproduce it today with the new account on QA env. Also, this issue affect all of our applications (not only login flow);;;",
            "23/Nov/22 9:07 AM;tellin;Assigning to [~slynch] for ProTardis to take the lead on this fix, per my conversation with Andrei and Artem. (It's understood other team assistance may be needed to update applications.);;;",
            "23/Nov/22 10:04 AM;tsummers;Here is another observation that may be probative:\n\nAn account that failed to login using: https://www.XYZPLUS.com/go/login which redirects to https://learning.XYZ.com/ngonboard/index.html#/Login\n\nHowever, that same account logged in successfully using: https://learn.XYZPLUS.com (or https://XYZhighered.instructure.com) which redirects to https://learning.XYZ.com/ngonboard/index.html#/LoginSSO\n\nThe difference is that the former seeks to take the student to the dashboard on the abc side, whereas the latter takes the student to the dashboard in Canvas.;;;",
            "23/Nov/22 10:33 AM;nkochmarev;[~tsummers] LoginSSO works in a different way. It will log in but other apps will fail (like Instructor admin tool) and fail on attempt to return to the abc dashboard;;;",
            "23/Nov/22 1:52 PM;tsummers;[~nkochmarev] - Actually, the return to abc dashboard seems to work in my limited testing, but in any case, we are employing this as a workaround in lieu of changing the student name in CAP until we learn more about next steps.;;;",
            "07/Dec/22 4:14 AM;nkochmarev;[~tsummers] Hi, in scope of the fix (deployment december 14) will be fixed login/onboarding functionality, also possible issues with WAS functionality. Registration and CAP will be in the same state. For the field validations/restrictions we have separate ticket. (Currently we do not have any restrictions on First/Last name during self-registration but we have restrictions in CAP)\n\nfyi [~osolovyo] ;;;",
            "15/Dec/22 2:38 AM;osolovyo;NWP FY23.PI4.3 Production Release was completed on 14-DEC-2022 at 6:00 - 6:30 am EST.\nSee https://confluence.XYZ.com/get/abcEN/Release+NWP+FY23.PI4.3   \nReady for verification;;;",
            "15/Dec/22 5:10 PM;tsummers;Validation may be difficult because many of the affected accounts were modified to remove the Chinese characters as a workaround. Contacted Yen Sing Tan to see if she is aware of any students who were directed to login to https://learn.XYZPLUS.com as a workaround without editing the user record. Such student accounts would be able to validate whether the issue is resolved.;;;",
            "21/Dec/22 8:30 AM;tsummers;Closing ticket as no account is found from which to test the solution. The account team in Singapore is aware of the fix and will let us know if a problem persists for any student.;;;"
        ]
    },
    {
        "Summary": "CAP - search by Canvas course ID to quicker identify a user's course",
        "Issue key": "NG-5609",
        "Description": "As a new XYZPLUS Cinnamon Bread super admin/admin user/viewer, I would like to be able to search by a Canvas course ID so that I can identify a user's course quicker.",
        "comments": [
            "13/Sep/19 6:07 AM;abondar;[~okalitsev]\n\"Search Course by Canvas ID\" ticket was requested and closed same time ago.\nPlease contact [~rdannelly] if the functionality is really critical for content production flow.\n\nfyi [~aryzhakov], [~smorozov];;;"
        ]
    },
    {
        "Summary": "QA Testing for NG-17388",
        "Issue key": "NG-17515",
        "Description": "'- QA testing for a new flow - create a new user with ACADEMIC role",
        "comments": [
            "19/Apr/23 12:10 PM;abykova;*1. A user compaccess1_04_17_2023@dispostable.com with ACADEMIC_USER role and institution was created via new API.*\n - To login to My Account the user requested resetting password on My Account login page.\n - The user set a new password - XYZ12345.\n - User logged in to My Account.\n \n+Actual results:+\n - The first login prompts the user to accept Terms of Use and Privacy Policy.\n!AnyUser_ToU.PNG|thumbnail!\n - After accepting ToU user is navigated to My Account dashboard page.\n - User role is displayed as ACADEMIC_USER\n!academic_user_role.PNG|thumbnail!\n\n*2. A user compaccess3_04_17_2023@dispostable.com with ACADEMIC_USER role was created via new API. No institution is added for user.*\n - To login to My Account the user requested resetting password.\n - The user set a new password XYZ12345.\n - User logged in to My Account.\n\n+Actual results:+\n - The first login prompts the user to accept Terms of Use and Privacy Policy.\n - After acepting ToU user is navigated to 'Enter your Institution name page' page.\n(In case when ACADEMIC_USER is created without any institution, My Account suggest to select particular institution. Any institution is needed for displaying My Account dashboard)\n!complete_signup_select_institution.PNG|thumbnail!\n - {color:#FF0000}After the user selects an institution, nothing happens. The user is not able to navigate to My Account dashboard.{color}\n\n*3. Open user account in Cinnamon Bread.*\n - User with Admin role is logged into CAP.\n - Admin navigates to Users page.\n - Admin proceeds with searching user by email compaccess1_04_17_2023@dispostable.com.\n - Admin clicks user id link in Users table.\n+Actual results:+\n - User account page is not displayed - blank screen is appeared.\n - {color:#FF0000}It is not possible to view the list of licenses for the user with ACADEMIC_USER role.{color}\n !cap_academic_user_account.PNG|thumbnail! \n\n*4. Cinnamon Bread: create a new user based on Academic User email*\n\n - User with Admin role is logged into CAP.\n - Admin navigates to Users page and clicks 'Create user' button.\n - Admin creates a new user with the role of student or instructor by entering the email of an existing academic user compaccess5.04_19_2023@dispostable.com.\n\n+Actual results:+\n - A new role is added for email compaccess5.04_19_2023@dispostable.com. So it is possible to create a user with 2 roles: ACADEMIC_USER and INSTRUCTOR or ACADEMIC_USER and STUDENT.\n - It is also possible to create a user with 3 roles ACADEMIC_USER and INSTRUCTOR and STUDENT.\n !user_with_three_roles.PNG|thumbnail! \n*{color:red} will be fixed in{color}* https://jira.XYZ.com/browse/NG-17534\n\n*5. Instructor Admin Tool in XYZPLUS:*\nabc instructor is able to enroll to course other users via IAT in XYZPLUS.\n - abc instructor opens IAT based on their own abc course.\n - abc instructor wants to enroll user to the course.\n - abc instructor enters email of academic user(+on purpose or by accident+) in IAT add user flow.\n\n+Actual results:+\n - endless loader is displayed for the instructor.\n - refreshing page is needed to continue using IAT.\n !iat_user_enrollment.PNG|thumbnail! ;;;"
        ]
    },
    {
        "Summary": "[NGAI] Concluding/Unconcluding the XYZ course from CAP - NG Admin ",
        "Issue key": "NG-4975",
        "Description": "This story is about concluding/unconcluding the XYZ course from Cinnamon Bread interface.\n\nThe course should be concluded in Canvas as well.",
        "comments": []
    },
    {
        "Summary": "CAP KTs and Code / Architecture Walkthrough",
        "Issue key": "NG-9947",
        "Description": "Cinnamon Bread code walk through as initial KT for LTI log\n\n[https://github.com/XYZ/XYZPLUS-course-admin-ui]",
        "comments": []
    },
    {
        "Summary": " [NGAI] Finishing/Unfinishing the course sections related to the concluded XYZ course from CAP - NG Admin ",
        "Issue key": "NG-4977",
        "Description": "This story is about finishing/unfinishing the course sections related to the concluded/unconcluded XYZ course from Cinnamon Bread interface.\n\nThe course sections should be finished in Canvas as well.",
        "comments": []
    },
    {
        "Summary": "[NGAI] [F6] Using TacoBell to login into Course Admin - NG Admin",
        "Issue key": "NG-1038",
        "Description": "As an NG Admin I would like to be use my XYZ SSO to access Course Admin area.\n\nDefault TacoBell logging interface should be used for authentication in the Cinnamon Bread\n\n ",
        "comments": [
            "26/Feb/18 10:12 AM;rvirginia;[~abondar] we can defer this for now;;;",
            "30/Jul/18 11:52 AM;acostello;[~aryzhakov] - Please set up meeting with [~smorozov] and [~rtangri] and [~jlu2] to discuss design specifications unless it is being covered by [~dlederer] in 7/31 security meeting.\n;;;",
            "13/Aug/18 7:49 AM;aryzhakov;This is no longer a priority - a separate story was created to handle security issues on the 1st phase: NG-3624.\nReducing the business rank to 2;;;",
            "31/Oct/18 7:25 AM;aryzhakov;Could possibly be taken into Sprint 61;;;",
            "04/Dec/18 7:48 AM;akiselev;Testing is compelte;;;"
        ]
    },
    {
        "Summary": "[Regression] [CAP] Error during user update",
        "Issue key": "NGPROD-1094",
        "Description": "*Browser:* Chrome\n *Environment:* QA\n *Version:*\n{code:java}\nXYZPLUS-COURSE-ADMIN-UI: 1.91.1 (hash 2429b4911af8f965554b2c5357c4021f883dfa45) built at 2020-01-31 15:39:22 +0300{code}\n*Preconditions:*\n\nUser with Super Admin Role logged in Cinnamon Bread.\n\n(Cinnamon Bread: [https://learning-qa.XYZ.com/abcadmin/index.html]\n\ndaladinski / XYZ12345d / XYZ)\n\n*Steps to Replicate:* \n1. Find the Lms User(click 'Users' link in the page header, select 'Select user type' - LMS, input 'LTI consumer key' - 'smTestClaimAug10', click 'Search', click 'External user ID' - '46524' in the search result table)\n2.Click 'Edit user details'\n3.Change the data (for example 'Start date' and 'End Date' of the license) to different value.\n4.Click 'Save' button\n\n*Expected Result:* Lisence's data saved successfully.\n *Actual Result:* There is an error 'Unable to save changes!', \n *Workaround:* No",
        "comments": [
            "26/Feb/20 10:13 AM;jlu2;Clone the issue at NG-9013 to NGPROD-1094. ;;;",
            "26/Feb/20 10:19 AM;jlu2;[~rdannelly], [~rvirginia], This production issue was found during the regression testing. The impact to the production users is when the XYZPLUS admin makes license changes for instructor or students such as end date, there would be an error to block the save.\n\nPlease review the priority if we need to fix it ASAP in March 4th release (release 92) or current sprint 93 and delivered in release 93. \n\n \n\n ;;;",
            "26/Feb/20 11:19 AM;rvirginia;Thanks [~jlu2]. I can reproduce this issue as well but notice that the NWP license end date does update despite the error message. We see the updated date in the UI and it is also updated in the license_end_date column in the license table, though the actual_end_date still lists the original/pre-extension date. I assume NWP uses license_end_date for all access logic and not actual_end_date? The answer will allow us to determine the real impact of NGPROD-1094.\n\nThat said, the error message could be related to NGPROD-1088 where we see that VS licenses are not being updated to align with the new NWP license date. NGPROD-1088 is an urgent issue to fix, so maybe the fix for that will also address NGPROD-1094?\n\n[~vsundaramu] FYI;;;",
            "26/Feb/20 11:24 AM;atyukavkin;Hi [~rvirginia], It looks like you are right. When I tried to replicate I have got an error from VS\n{code}Error occurred while updating license with id=26868 : TomatoCreateLicenseErrorResponse [errorCode=474, errorText=User could not be found]\ncom.XYZ.abc.ecommerce.exception.TomatoSystemException: TomatoCreateLicenseErrorResponse [errorCode=474, errorText=User could not be found]{code}\nThanks,\nAndrey T;;;",
            "06/Mar/20 3:45 PM;vsundaramu;[~vsaranga] - This has been fixed in the CST build 1.93.10 and the build has been deployed to QA environment. This has to be tested from the course setup admin tool. The sceanrio and steps is same as explained in the description of the ticket. \n\nTo give a little context, when we want to extend a license of a user (STUDENT/INSTRUCTOR), updating the license date throwed an error and this has been fixed. Can you do some testing around this and let me know?\n\nAlso do some regression around it. \n\nIf you need anyother details, we can catch up on Sunday night EST. \n\n ;;;",
            "10/Mar/20 4:36 AM;vsaranga;QA verification is completed. Following areas were tested.\n\nTested version : [https://abc-course-setup-qa.aws.XYZ.com/abc/api/v1/courses/version.json]\n\n{\"Component name\": \"abc-course-setup-app\", \"Component version\": \"1.93.10\", \"Build timestamp\": \" 20200306-1109\", \"Git commit hash\": \"5020c25d\"{{}}}\n * Verified updating and saving from admin tool,\n ** First name\n ** Last name\n ** User email\n ** Password\n ** Subscribed to XYZ alerts\n ** Learning style survey delivery form\n ** Learning style survey delivery platform\n ** License Start date\n ** License End date\n * Verified license end date changes for INSTRUCTOR and STUDENT launches\n * Verified TRIAL , REGCODE and ECOMMERCE for student\n * Verified can't access XYZPLUS, WAS, Orion, EText launch after license downgrade and can access again after a license upgrade\n\nTested using the following credentials,\n\nCourse : [https://XYZ2.test.instructure.com/courses/12000]\n Student : cst_test_stu1@mailinator.com\n Intructor : [cst_test_ins1@mailinator.com|mailto:cst_test_ins2@mailinator.com]\n\nFollowing issues were observed,\n * Updating the first name, last name, email from course admin did not get reflected on the intercom\n * Getting a 'no access' error for etext book launch from left panel of the LMS course to instructor. But can get access after clicking on the home icon of vital source and then going to continue reading option. Not getting this when launching the etext book via the resource player. For the student, this happened the other way around. Could launch via left panel etext and got error via resource player etext launch.\n\n!etext.PNG|width=367,height=226!\n\n \n\n[~vsundaramu], could you please verify whether the above issues are due to the change or not. If they are ok I can sign off the release.\n\nFYI [~jlu2];;;",
            "10/Mar/20 8:18 AM;vsundaramu;This issue 2 will be fixed as part of NG-9175. But issue 1 is not part of this fix. It has to be separate JIRA ticket and added to backlog.;;;",
            "10/Mar/20 8:33 AM;vsaranga;[~vsundaramu] bug reported and added to the backlog for 1st issue: https://jira.XYZ.com/browse/NG-9252\n\nI'll retest for the 2nd issue when the bug is fixed. ;;;",
            "17/Mar/20 3:26 AM;osolovyo;Hi [~jlu2] - if NG-9223 and NG-9280 are going to be done in Sprint 94, can we remove abc 1.93 tag from this ticket? ;;;",
            "17/Mar/20 6:25 AM;jlu2;[~osolovyo] This issue is fixed but the other is placed in release 1.94.;;;",
            "19/Mar/20 7:24 AM;jlu2;Per confirmation from [~vsaranga], the CAP user profile update issue is resolved on production in release 1.93. ;;;",
            "19/Mar/20 7:25 AM;jlu2;[~drodionov], please review and close the ticket when you have time\n\n ;;;",
            "31/Mar/20 5:25 AM;osolovyo;NWP Release 1.93 deployment to PROD was completed by @Tyukavkin, Nikolay with the support from @Ananda, Chamil, @Bonu, RaviShankar, @Chilla, Malleswar, @Dubolazov, Alexey, @Gulati, Vaibhav, @Kochmarev, Nikita, @Korobkina, Natalia, @Lederer, David, @Mohapatra, Debajyoti, @Morozov, Sergey, @Omelchenko, Dmitry, @Patel,  Deval Govindbhai, @Pechet, Aryeh, @Prakriya, Shankar, @Saranga, Vimukthi, @Startsev, Yuri, @Stepkin, Denis, @Sundaramurthy, Vasanth, @Trivedi, Ujwal, @Tyukavkin, Andrey, @Zagnityko, Artem.\n\n \n\nProduction sanity testing was done and confirmed by @Saranga, Vimukthi, @Morozov, Sergey, @Stepkin, Denis, @Korobkina, Natalya, @Boychook, Olga, @Winkleman, Edward, @Norman, Stephanie, @Sundaramurthy, Vasanth, @Trivedi, Ujwal, Kafka Dev Team, @Omelchenko, Dmitry, @Dubolazov, Alexey, @Solovyov, Oleg.\n\n \n\nThe updated release plan can be found at [https://confluence.XYZ.com/getdot/abcEN/Release+1.93+Deployment+Plan] and the release notes can be found at [https://confluence.XYZ.com/get/abcEN/Release+1.93] .;;;",
            "31/Mar/20 5:26 AM;osolovyo;Closing the ticket.;;;",
            "31/Mar/20 7:13 AM;daladinski;Fix verified on PROD.\n\n \n\nChecked on PROD for following users:\n\nLMS\n|141474|722897|Cypress|Test|cypress_test@mailinator.com|\n\n Standalone\n|4|Dmitry|Aladinsky|test@XYZ.com|;;;",
            "02/Apr/20 4:55 PM;rvirginia;We are still able to replicate this issue on Prod. Could you review?\n\nI had failures trying to extend licenses for this user: [https://learning.XYZ.com/abcadmin/index.html#/userList/XYZUser/244254]\n\n[~daladinski] [~jlu2] [~lfavors] FYI;;;",
            "10/Apr/20 2:05 PM;vsundaramu;[~rvirginia] - I chekced the account that you are trying to update. The reason why it is failing is we manually cleaned up the Tomato tables earlier and for update, it requires the data to be there. These will happen to the cases when we are trying to update a license for which we manually cleaned up the VS logs. \n\nI checked your license and it is valid. you can directly launch the Tomato first and then try to update the license through CAP, it should work. ;;;",
            "29/Apr/20 8:46 AM;jlu2;Confirmed with [~rvirginia] in the meeting, the issue can be closed now.;;;"
        ]
    },
    {
        "Summary": "[NGAI] [F6] Editing the Pairing Data of the Product from Course Admin - NG Admin ",
        "Issue key": "NG-4259",
        "Description": "This story is about editing the pairing data of LMS course to the product from the Cinnamon Bread side.\n\nChanging the paring  data (unpairing or changing the paired product) will be performed from the detailed LMS course view while editing the course details. \n\n ",
        "comments": [
            "03/Oct/18 5:59 AM;aryzhakov;Estimations: Approximately 5 points;;;",
            "04/Oct/18 10:46 AM;aryzhakov;Ready for spec workshop;;;",
            "05/Oct/18 3:38 AM;aryzhakov;Wireframes updated as per spec workshop. Ready for TA;;;",
            "19/Oct/18 10:09 AM;smorozov;[~acostello], the story development is done and, as per agreement with QA team, should be carried over to Sprint 60 for acceptance testing.;;;",
            "06/Nov/18 4:21 AM;daladinski;Testing is complete. Please note that this story will go to PROD with defect NG-4479  and 4479 will be fixed in Sprint 61 only.;;;"
        ]
    }
]